Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# cmsCodeSelect.Text
source: Select All
ar: اختر الكل
cs: Vybrat vše
de_de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: すべて選択
pl: Wybierz wszystko
pt: Selecionar tudo
ru: Выбрать все
tr: Hepsini seç
zh_cn: 全选

# cmsCodeCopy.Text
source: Copy to clipboard
ar: نسخ إلى الحافظة
cs: Zkopírovat do schránky
de_de: In die Zwischenablage kopieren
es: Copiar al portapapeles
fr: Copier dans le presse-papier
it: Copia negli appunti
ja: クリップボードにコピー
pl: Kopiuj do schowka
pt: Copiar para área de transferência
ru: Скопировать в буфер обмена
tr: Panoya kopyala
zh_cn: 复制到剪贴板

# cmsCodePaste.Text
source: Paste from clipboard
ar: لصق من الحافظة
cs: Vložit ze schránky
de_de: Einfügen aus der Zwischenablage
es: Pegar desde el portapapeles
fr: Coller depuis le presse-papiers
it: Incolla dagli appunti
ja: クリップボードから貼り付け
pl: Wklej ze schowka
pt: Colar da área de transferência
ru: Вставить из буфера обмена
tr: Panodan yapıştır
zh_cn: 从剪贴板粘贴

# cmsCodePasteSpecial1.Text
source: Insert 'PenUp'
ar: إدراج "PenUp"
cs: Vložit 'PenUp'
de_de: Fügt 'PenUp' ein
es: Insertar 'PenUp'
fr: Insérez «PenUp»
it: Inserisci 'PenUp'
ja: 「ペンアップ」を挿入
pl: Wstaw 'Pen-Up'
pt: Inserir 'PenUp'
ru: Вставьте PenUp
tr: 'PenUp' ekle
zh_cn: 插入“ 抬笔”

# cmsCodePasteSpecial2.Text
source: Insert 'PenDown'
ar: إدراج "PenDown"
cs: Vložit „PenDown“
de_de: Fügt 'PenDown' ein
es: Insertar 'PenDown'
fr: Insérez «PenDown»
it: Inserisci 'PenDown'
ja: 「ペンダウン」を挿入
pl: Wstaw 'Pen-Down'
pt: Inserir 'PenDown'
ru: Вставьте «PenDown»
tr: 'PenDown' ekle
zh_cn: 插入“ 落笔”

# cmsFindDialog.Text
source: Find Dialog
ar: البحث عن الحوار
cs: Najít dialog
de_de: 'Finden' Dialog
es: Buscar diálogo
fr: Trouver un dialogue
it: Finestra di dialogo Trova
ja: 検索ダイアログ
pl: Znajdź
pt: Caixa de diálogo Localizar
ru: Найти диалог
tr: Diyalog Bul
zh_cn: 查找对话框

# cmsReplaceDialog.Text
source: Replace dialog
ar: استبدال الحوار
cs: Nahradit dialog
de_de: 'Ersetzen' Dialog
es: Reemplazar diálogo
fr: Remplacer le dialogue
it: Sostituisci finestra di dialogo
ja: 置換ダイアログ
pl: Znajdź i zamień
pt: Caixa de diálogo Substituir
ru: Заменить диалог
tr: İletişim kutusunu değiştir
zh_cn: 替换对话框

# cmsCodeSendLine.Text
source: Send marked line towards GRBL
ar: إرسال خط ملحوظ نحو GRBL
cs: Pošlete označenou čáru směrem na GRBL
de_de: Sende Codezeile
es: Enviar línea marcada hacia GRBL
fr: Envoyer la ligne marquée en direction du GRBL
it: Invia linea contrassegnata verso GRBL
ja: マークされた行をGRBLに向けて送信する
pl: Wyślij linię kodu
pt: Enviar linha marcada em direção a GRBL
ru: Отправить отмеченную линию в сторону GRBL
tr: İşaretli satırı GRBL'ye gönder
zh_cn: 向GRBL发送标记线

# cmsCommentOut.Text
source: Comment out unknown G-Code
ar: علق على G-Code غير معروف
cs: Zakomentujte neznámý G-Code
de_de: Auskommentieren von unbekannten G-Code
es: Comentario fuera de G-Code desconocido
fr: Commenter un G-Code inconnu
it: Commenta il codice G sconosciuto
ja: 不明なGコードをコメント化する
pl: Skomentuj nieznany G-Code
pt: Comentar código G desconhecido
ru: Комментарий за неизвестный G-Code
tr: Bilinmeyen G-Code'u yorumlayın
zh_cn: 注释掉未知的G-Code

# cmsUpdate2DView.Text
source: Update 2D view
ar: تحديث عرض 2D
cs: Aktualizujte 2D zobrazení
de_de: Update 2D Ansicht
es: Actualizar vista 2D
fr: Mettre à jour la vue 2D
it: Aggiorna vista 2D
ja: 2Dビューを更新
pl: Aktualizuj widok 2D
pt: Atualizar visualização 2D
ru: Обновить 2D вид
tr: 2B görünümü güncelle
zh_cn: 更新2D视图

# btnStreamStop.ToolTip
source: Stop sending code to GRBL
ar: التوقف عن إرسال رمز إلى GRBL
cs: Zastavit odesílání kódu do GRBL
de_de: Stoppt die Übertragung
es: Dejar de enviar código a GRBL
fr: Arrête d'envoyer le code à GRBL
it: Interrompi l'invio del codice a GRBL
ja: GRBLへのコード送信を停止
pl: Zatrzymaj przesyłanie kodu do GRBL
pt: Parar de enviar código para GRBL
ru: Прекратить отправку кода в GRBL
tr: GRBL'ye kod göndermeyi durdur
zh_cn: 停止向GRBL发送代码

# btnStreamStart.ToolTip
source: Send code from text-editor to GRBL Right click to choose start line number
ar: إرسال رمز من محرر النصوص إلى GRBL
cs: Odešlete kód z textového editoru do GRBL Kliknutím pravým tlačítkem vyberte číslo startovní řady
de_de: Sende den G-Code aus dem Editor an GRBL
es: Enviar código del editor de texto a GRBL
fr: Envoyer le code de l'éditeur de texte au GRBL
it: Invia il codice dall'editor di testo a GRBL Fare clic con il pulsante destro del mouse per scegliere il numero di riga iniziale
ja: テキストエディターからGRBLにコードを送信する
pl: Wysyłanie kodu z edytora tekstu do GRBL Kliknij prawym przyciskiem myszy, aby wybrać numer linii startowej
pt: Enviar código do editor de texto para GRBL
ru: Отправить код из текстового редактора в GRBL
tr: Metin düzenleyiciden GRBL'ye kod gönderin Başlangıç ​​satırı numarasını seçmek için sağ tıklayın
zh_cn: 向GRBL发送代码

# btnOverrideSpindle.ToolTip
source: Only works in HOLD state
ar: يعمل فقط في حالة HOLD
cs: Funguje pouze ve stavu HOLD
de_de: Funktioniert nur im HOLD-Zustand
es: Solo funciona en estado HOLD
fr: Fonctionne uniquement dans l'état HOLD
it: Funziona solo in stato HOLD
ja: ホールド状態でのみ動作します
pl: Działa tylko w stanie HOLD (wstrzymanie)
pt: Funciona apenas no estado HOLD
ru: Работает только в состоянии HOLD
tr: Yalnızca HOLD durumunda çalışır
zh_cn: 仅在保持状态下工作

# btnOverrideMist.ToolTip
source: M7 may not enabled in grbl
ar: قد لا يتم تمكين M7 في grbl
cs: M7 nemusí být povoleno v grbl
de_de: M7 ist möglicherweise in grbl nicht aktiviert
es: M7 puede no estar habilitado en grbl
fr: M7 peut ne pas être activé dans grbl
it: M7 potrebbe non essere abilitato in grbl
ja: M7はgrblで有効になっていない可能性があります
pl: M7 może być niewłączone w grbl
pt: M7 pode não estar ativado no grbl
ru: M7 может не включен в grbl
tr: M7, grbl'de etkin olmayabilir
zh_cn: 在grbl中可能未启用M7（雾状冷却液）

# btnJogStop.ToolTip
source: Stop current jogging motion
ar: وقف حركة الركض الحالية
cs: Zastavte aktuální joggingový pohyb
de_de: Abbruch der jetzigen Jogging-Bewegung
es: Detener el movimiento de trote actual
fr: Arrêter le mouvement de jogging en cours
it: Arresta il movimento di jogging in corso
ja: 現在のジョギングモーションを停止する
pl: Zatrzymaj aktualny ruch roboczy
pt: Pare o movimento de corrida atual
ru: Остановить текущее беговое движение
tr: Geçerli hızlı hareket hareketini durdur
zh_cn: 停止当前的点动运动

# cBSendJogStop.Text
source: STOP Jogging on mouse up
ar: وقف الركض على الماوس لأعلى
cs: STOP běhání s myší nahoru
es: Parar al soltar el ratón
fr: STOP Jogging à la souris levée
it: STOP di fare jog con il mouse in alto
ja: マウスアップでジョギングを停止
pl: Stop gdy 'mouse-up'
pt: Ativa Parar com um Toque
ru: Оставока при отажатии кнопки
tr: Fare yukarı kaldırıldığında Jogging'i DURDUR
zh_cn: 松开鼠标时停止运动

# btnOverrideDoor.ToolTip
source: Although typically connected to an input pin to detect the opening of a safety door, this command allows a GUI to enact the safety door behavior with this command. Immediately suspends into a DOOR state and disables the spindle and coolant. If in motion, the machine will decelerate to a stop and then be suspended. If executed during homing, Grbl will instead halt motion and throw a homing alarm. If already in a suspend state or HOLD, the DOOR state supersedes it. If the parking compile-time option is enabled, Grbl will park the spindle to a specified location. Command executes when Grbl is in an IDLE, HOLD, RUN, HOMING, or JOG state. It is otherwise ignored. If jogging, a safety door will cancel the jog and all queued motions in the planner buffer. When the safety door is closed and resumed, Grbl will return to an IDLE state. An input pin is available to connect a button or switch, if enabled with a compile-time option.
ar: على الرغم من أن عادةً ما تكون متصلة بمسمار إدخال للكشف عن فتح باب الأمان ، فإن هذا الأمر يسمح لـ GUI بتفعيل سلوك باب الأمان باستخدام هذا الأمر. يعلق على الفور في حالة الباب ويعطل المغزل والمبرد. في حالة الحركة ، ستتباطأ الماكينة وتوقف بعد ذلك. إذا تم تنفيذ أثناء صاروخ موجه ، فإن Grbl ستوقف الحركة وتلقي إنذارًا صارخًا. إذا كانت موجودة بالفعل في حالة تعليق مؤقت أو HOLD ، فإن حالة DOOR ستحل محلها. إذا تم تمكين خيار وقت إيقاف السيارات ، فسيقوم Grbl بإيقاف المغزل إلى موقع محدد. يتم تنفيذ الأمر عندما يكون Grbl في حالة IDLE أو HOLD أو RUN أو HOMING أو JOG. يتم تجاهله بطريقة أخرى. إذا كان الركض ، فإن باب السلامة سوف يلغي الركض وجميع حركات الانتظار في المخزن المؤقت للمخطط. عند إغلاق باب الأمان واستئنافه ، سيعود Grbl إلى حالة IDLE. يتوفر دبوس إدخال لتوصيل زر أو مفتاح ، إذا تم تمكينه باستخدام خيار وقت الترجمة.
cs: Ačkoli je tento příkaz obvykle připojen ke vstupnímu kolíku pro detekci otevření bezpečnostních dveří, umožňuje GUI pomocí tohoto příkazu aktivovat chování bezpečnostních dveří. Okamžitě přejde do stavu DOOR a deaktivuje vřeteno a chladicí kapalinu. Pokud je stroj v pohybu, zpomalí až do zastavení a poté se pozastaví. Pokud je proveden během navádění, Grbl místo toho zastaví pohyb a spustí alarm navádění. Pokud je již ve stavu pozastavení nebo HOLD, nahradí jej stav DOOR. Pokud je povolena možnost parkování v době kompilace, Grbl zaparkuje vřeteno na určené místo. Příkaz se provede, když je Grbl ve stavu IDLE, HOLD, RUN, HOMING nebo JOG. Jinak se to ignoruje. Pokud provádíte krokování, bezpečnostní dveře zruší krokování a všechny pohyby ve frontě ve vyrovnávací paměti plánovače. Když jsou bezpečnostní dveře zavřeny a obnoveny, Grbl se vrátí do stavu NEČINNOSTI. Vstupní kolík je k dispozici pro připojení tlačítka nebo přepínače, pokud je povolen s možností kompilace.
de_de: Obwohl dieser Befehl normalerweise mit einem Eingangspin verbunden ist, um das Öffnen einer Schutztür zu erkennen, kann eine grafische Benutzeroberfläche mit diesem Befehl das Verhalten der Schutztür festlegen. Hängt sofort in einem TÜR-Zustand an und deaktiviert die Spindel und das Kühlmittel. Wenn die Maschine in Bewegung ist, wird sie bis zum Stillstand abgebremst und dann angehalten. Wenn sie während der Referenzfahrt ausgeführt werden, stoppt Grbl stattdessen die Bewegung und löst einen Referenzalarm aus. Wenn bereits ein Suspend-Status oder ein HOLD-Status vorliegt, wird dieser durch den DOOR-Status ersetzt. Wenn die Option zum Kompilieren des Parkens aktiviert ist, parkt Grbl die Spindel an einer angegebenen Position. Der Befehl wird ausgeführt, wenn sich Grbl im Status IDLE, HOLD, RUN, HOMING oder JOG befindet. Es wird sonst ignoriert. Beim Tippen bricht eine Schutztür das Tippen und alle anstehenden Bewegungen im Planerpuffer ab. Wenn die Schutztür geschlossen und wieder aufgenommen wird, kehrt Grbl in den Leerlaufzustand zurück. Ein Eingangspin ist verfügbar, um eine Schaltfläche oder einen Schalter anzuschließen, sofern diese Option zur Kompilierungszeit aktiviert ist.
es: Aunque normalmente está conectado a un pin de entrada para detectar la apertura de una puerta de seguridad, este comando permite que una GUI active el comportamiento de la puerta de seguridad con este comando. Inmediatamente se suspende al estado de PUERTA y desactiva el husillo y el refrigerante. Si está en movimiento, la máquina desacelerará hasta detenerse y luego se suspenderá. Si se ejecuta durante la búsqueda, Grbl detendrá el movimiento y emitirá una alarma de búsqueda. Si ya está en estado suspendido o HOLD, el estado DOOR lo reemplaza. Si la opción de tiempo de compilación de estacionamiento está habilitada, Grbl estacionará el eje en una ubicación específica. El comando se ejecuta cuando Grbl está en un estado IDLE, HOLD, RUN, HOMING o JOG. De lo contrario se ignora. Si trota, una puerta de seguridad cancelará el trote y todos los movimientos en cola en el búfer del planificador. Cuando la puerta de seguridad se cierra y se reanuda, Grbl volverá a un estado inactivo. Un pin de entrada está disponible para conectar un botón o interruptor, si está habilitado con una opción de tiempo de compilación.
fr: Bien qu’elle soit généralement connectée à une broche d’entrée pour détecter l’ouverture d’une porte de sécurité, cette commande permet à une interface utilisateur graphique d’activer le comportement de la porte de sécurité avec cette commande. Suspend immédiatement dans un état PORTE et désactive la broche et le liquide de refroidissement. Si elle est en mouvement, la machine ralentira jusqu'à son arrêt puis sera suspendue. Si elle est exécutée pendant le référencement, Grbl arrêtera le mouvement et déclenchera une alarme de référencement. Si vous êtes déjà dans un état suspendu ou HOLD, l’état DOOR le remplace. Si l'option de stationnement à la compilation est activée, Grbl garera la broche à un emplacement spécifié. La commande s'exécute lorsque Grbl est dans un état IDLE, HOLD, RUN, HOMING ou JOG. Il est par ailleurs ignoré. Si vous faites du jogging, une porte de sécurité annulera le jogging et tous les mouvements en file d'attente dans la mémoire tampon du planificateur. Lorsque la porte de sécurité est fermée et reprise, Grbl reviendra à l'état IDLE. Une broche d’entrée est disponible pour connecter un bouton ou un commutateur, si elle est activée avec une option de compilation.
it: Sebbene in genere sia collegato a un pin di ingresso per rilevare l'apertura di una porta di sicurezza, questo comando consente a una GUI di attivare il comportamento della porta di sicurezza con questo comando. Sospende immediatamente in uno stato PORTA e disabilita il mandrino e il liquido di raffreddamento. Se in movimento, la macchina decelera fino all'arresto e poi viene sospesa. Se eseguito durante l'homing, Grbl fermerà invece il movimento e lancerà un allarme di homing. Se è già in uno stato di sospensione o HOLD, lo stato DOOR lo sostituisce. Se l'opzione di parcheggio in fase di compilazione è abilitata, Grbl parcheggerà il mandrino in una posizione specificata. Il comando viene eseguito quando Grbl è in uno stato IDLE, HOLD, RUN, HOMING o JOG. Altrimenti viene ignorato. In caso di jogging, una porta di sicurezza annullerà il jog e tutti i movimenti in coda nel buffer del pianificatore. Quando la porta di sicurezza viene chiusa e ripristinata, Grbl tornerà in uno stato IDLE. È disponibile un pin di input per collegare un pulsante o un interruttore, se abilitato con un'opzione in fase di compilazione.
ja: 通常、安全ドアの開放を検出するために入力ピンに接続されていますが、このコマンドを使用すると、GUIでこのコマンドを使用して安全ドアの動作を実現できます。 すぐにDOOR状態になり、スピンドルとクーラントが無効になります。 動いている場合、機械は停止するまで減速してから停止します。 原点復帰中に実行されると、Grblは代わりにモーションを停止し、原点復帰アラームをスローします。 すでにサスペンド状態またはHOLDにある場合、DOOR状態がそれに優先します。 コンパイル時の駐車オプションが有効な場合、Grblは指定された場所にスピンドルを駐車します。 GrblがIDLE、HOLD、RUN、HOMING、またはJOG状態のときにコマンドが実行されます。 それ以外の場合は無視されます。 ジョギングの場合、安全ドアはジョギングとプランナーバッファー内のすべてのキューに入れられたモーションをキャンセルします。 安全ドアを閉じて再開すると、GrblはIDLE状態に戻ります。 コンパイル時オプションで有効になっている場合、ボタンまたはスイッチの接続に入力ピンを使用できます。
pl: Chociaż polecenie to jest normalnie podłączone do styku wejściowego w celu wykrycia otwarcia bramki bezpieczeństwa, polecenie to pozwala GUI kontrolować zachowanie bramki bezpieczeństwa za pomocą tego polecenia. W stanie DOOR natychmiast wstrzymuje pracę i wyłącza wrzeciono i chłodziwo. Jeśli maszyna jest w ruchu, zwolni do zatrzymania, a następnie zostanie wstrzymana. Jeśli wykonywane podczas powrotu do pozycji wyjściowej, GRBL zatrzyma ruch i wyda sygnał powrotu do pozycji wyjściowej. Jeśli już jest w stanie zawieszenia lub HOLD, to zastąpi go stan DOOR. Jeżeli włączona jest opcja kompilacji parkowania, to GRBL zaparkuje wrzeciono w podanym miejscu. Polecenie jest wykonywane gdy GRBL jest w stanie IDLE, HOLD, RUN, HOMING lub JOG. W przeciwnym razie jest ignorowane. Gdy bramki ochronne są uruchomione, to anuluje to uruchomienie i wszystkie ruchy w kolejce w buforze harmonogramu. Gdy bramki ochronne zostaną zamknięte i wznowione, GRBL powróci do stanu gotowości. Styk wejściowy jest dostępny do podłączenia przycisku lub przełącznika, jeśli jest włączony za pomocą opcji czasu kompilacji.
pt: Embora normalmente esteja conectado a um pino de entrada para detectar a abertura de uma porta de segurança, esse comando permite que uma GUI decida o comportamento da porta de segurança com esse comando. Suspende imediatamente a condição de PORTA e desativa o eixo e o líquido de refrigeração. Se estiver em movimento, a máquina desacelerará até parar e depois será suspensa. Se executado durante o retorno ao local, o Grbl interromperá o movimento e acionará um alarme de retorno. Se já estiver em um estado de suspensão ou HOLD, o estado DOOR substitui-o. Se a opção de tempo de compilação do estacionamento estiver ativada, o Grbl estacionará o eixo em um local especificado. O comando é executado quando o Grbl está nos estados IDLE, HOLD, RUN, HOMING ou JOG. Caso contrário, é ignorado. Se correr, uma porta de segurança cancelará o movimento e todos os movimentos na fila no buffer do planejador. Quando a porta de segurança é fechada e retomada, o Grbl retornará ao estado de inatividade. Um pino de entrada está disponível para conectar um botão ou comutador, se ativado com uma opção em tempo de compilação.
ru: Хотя эта команда обычно подключается к входному контакту для обнаружения открытия защитной двери, эта команда позволяет графическому интерфейсу пользователя управлять поведением защитной двери с помощью этой команды. Немедленно приостанавливается в состояние DOOR и отключает шпиндель и охлаждающую жидкость. В случае движения машина замедлится до остановки, а затем будет приостановлена. Если выполнено во время возврата в исходное положение, Grbl остановит движение и выдаст сигнал возврата в исходное положение. Если уже в состоянии приостановки или HOLD, состояние DOOR заменяет его. Если опция компиляции при парковке включена, Grbl будет парковать шпиндель в указанном месте. Команда выполняется, когда Grbl находится в состоянии IDLE, HOLD, RUN, HOMING или JOG. В противном случае игнорируется. При пробежке защитная дверь отменит пробежку и все движения в очереди в буфере планировщика. Когда защитная дверь будет закрыта и возобновлена, Grbl вернется в состояние ожидания. Входной контакт доступен для подключения кнопки или переключателя, если он включен с опцией времени компиляции.
tr: Bir güvenlik kapısının açılmasını algılamak için tipik olarak bir giriş pimine bağlı olmasına rağmen, bu komut bir GUI'nin bu komutla güvenlik kapısı davranışını etkinleştirmesine izin verir. Hemen KAPI durumuna geçer ve iş mili ile soğutma sıvısını devre dışı bırakır. Hareket halindeyken makine yavaşlayarak durur ve ardından askıya alınır. Hedef arama sırasında yürütülürse, Grbl bunun yerine hareketi durduracak ve bir hedef arama alarmı verecektir. Halihazırda askıda veya HOLD durumundaysa, KAPI durumu onun yerine geçer. Park derleme zamanı seçeneği etkinleştirilirse, Grbl iş milini belirli bir konuma park eder. Komut, Grbl bir BOŞTA, HOLD, RUN, HOMING veya JOG durumundayken yürütülür. Aksi halde göz ardı edilir. Yavaş hareket ediliyorsa, bir güvenlik kapısı yavaş hareketi ve planlayıcı arabelleğindeki tüm sıralı hareketleri iptal eder. Güvenlik kapısı kapatılıp devam ettirildiğinde, Grbl IDLE durumuna geri dönecektir. Bir derleme zamanı seçeneğiyle etkinleştirildiyse, bir düğmeyi veya anahtarı bağlamak için bir giriş pini mevcuttur.
zh_cn: 尽管通常连接到输入引脚以检测安全门的打开，但是此命令允许GUI使用此命令来指定安全门的行为。 立即暂停并进入DOOR状态并禁用主轴和冷却液。 如果机器正在运动，则机器将减速至停止。 如果在回原点时执行，Grbl将停止运动并引发回原点警报。 如果机器处于挂起状态或保持状态，则DOOR状态将取代它。 如果启用了停车编译时间选项，Grbl将把主轴停到指定位置。 当Grbl处于IDLE，HOLD，RUN，HOMING或JOG状态时，将执行命令。 否则将被忽略。 如果进行手动控制，这个按钮将取消手动控制和计划器缓冲区中所有排队的动作。 当安全门关闭并恢复时，Grbl将返回到空闲状态。 如果启用了编译时选项，则可以使用输入引脚来连接按钮或开关。

# btnResume.ToolTip
source: The cycle start or resume command '~' can be issued at any time, as it is a real-time command. When Grbl has motions queued in its buffer and is ready to go, the ~ cycle start command will start executing the buffer and Grbl will begin moving the axes.
ar: يمكن إصدار أمر بدء الدورة أو استئنافها "~" في أي وقت ، حيث إنه أمر في الوقت الفعلي. عندما يكون لدى Grbl حركات قائمة الانتظار في المخزن المؤقت الخاص به ويكون جاهزًا للذهاب ، فإن الأمر ~ cycle start سوف البدء في تنفيذ المخزن المؤقت وسيبدأ Grbl في تحريك المحاور.
cs: Příkaz spuštění nebo obnovení cyklu '~' lze vydat kdykoli, protože se jedná o příkaz v reálném čase. Když má Grbl ve vyrovnávací paměti ve frontě pohyby a je připraven jít, spustí se příkaz ~ cycle start začněte provádět vyrovnávací paměť a Grbl začne pohybovat osami.
de_de: ~ : Cycle Start / Resume (Zyklus Start / Fortsetzen) Fortsetzung bei den Zuständen 'Feed Hold', Sicherheitstür- / Parkzustand (bei geschlossener Tür) und M0-Programmpause. Befehl wird sonst ignoriert. Wenn die Park-Option aktiviert ist und die Sicherheitstür wieder geschlossen ist, wird Grbl die Spindel und das Kühlmittel wieder freigeben, sich zur Ausgangsposition bewegen und dann den Ablauf fortsetzen. Zur Verbindung einer Taste oder eines Schalters steht ein Eingangspin zur Verfügung.
es: El comando de inicio o reanudación del ciclo '~' puede emitirse en cualquier momento, ya que es un comando en tiempo real. Cuando Grbl tiene movimientos en cola en su búfer y está listo, el comando ~ cycle start comience a ejecutar el búfer y Grbl comenzará a mover los ejes.
fr: La commande de démarrage ou de reprise de cycle '~' peut être émise à tout moment, car il s'agit d'une commande en temps réel. Lorsque Grbl a des motions en file d'attente dans sa mémoire tampon et qu'il est prêt à fonctionner, la commande ~ cycle start commencez à exécuter le tampon et Grbl commencera à déplacer les axes.
it: Se eseguito durante l'homing, Grbl fermerà invece il movimento e lancerà un allarme di homing.
ja: サイクルの開始または再開コマンド「〜」は、リアルタイムコマンドであるため、いつでも発行できます。 Grblのバッファーにモーションがキューイングされていて準備ができている場合、〜cycle startコマンドは バッファの実行を開始すると、Grblは軸の移動を開始します。
pl: Komenda rozpoczęcia lub wznowienia cyklu '~' może być wydana w dowolnym momencie, ponieważ jest komendą czasu rzeczywistego. Kiedy w kolejce bufora GRBL są ustawione ruchy i jest gotowy do pracy, komenda rozpoczęcia cyklu ~ rozpocznie wykonywanie bufora i GRBL zacznie poruszać osiami.
pt: O comando de início ou retomada do ciclo '~' pode ser emitido a qualquer momento, pois é um comando em tempo real. Quando o Grbl tiver movimentos na fila do buffer e estiver pronto, o comando ~ cycle start começará a executar o buffer e o Grbl começará a mover os eixos.
ru: Команда запуска или возобновления цикла '~' может быть введена в любое время, так как это команда реального времени. Когда Grbl поставит в очередь движения в своем буфере и готов к работе, команда ~ цикл запуска начать выполнение буфера, и Grbl начнет движение осей.
tr: Gerçek zamanlı bir komut olduğu için döngü başlatma veya devam ettirme komutu '~' herhangi bir zamanda verilebilir. Grbl, arabelleğinde sıraya alınmış hareketlere sahip olduğunda ve gitmeye hazır olduğunda, ~ döngü başlatma komutu tamponu çalıştırmaya başlayın ve Grbl eksenleri hareket ettirmeye başlayacaktır.
zh_cn: 循环启动或恢复命令“〜”可以随时发出，因为它是实时命令。 当Grbl的动作在缓冲区队列中并且准备就绪时，〜cycle start命令将 开始执行缓冲区，Grbl将开始移动轴。
