Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# skaliereYAufDrehachseToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# toolStrip_RadiusComp.Text
source: Radius compensation
ar: تعويض نصف القطر
cs: Kompenzace poloměru
de_de: Radiuskompensation
es: Compensación de radio
fr: Compensation de rayon
it: Compensazione del raggio
ja: 半径補正
pl: Kompensacja promienia
pt: Compensação do raio
ru: Compensation de rayon
tr: Yarıçap telafisi
zh_cn: 半径补偿

# toolStripMenuItem1.Text
source: Show Camera
ar: عرض الكاميرا
cs: Zobrazit fotoaparát
de_de: Kamera
es: Mostrar cámara
fr: Montrer la caméra
it: Mostra fotocamera
ja: カメラを表示
pl: Kamera
pt: Mostrar câmera
ru: Показать камеру
tr: Kamerayı Göster
zh_cn: 显示相机

# toolStripMenuItem1.ToolTipText
source: Show camera picture
ar: عرض صورة الكاميرا
cs: Zobrazit snímek z fotoaparátu
de_de: Zeigt das Kamerabild einer angeschlossenen WebCam
es: Muestra la imagen de la cámara de una cámara web conectada
fr: Affiche l'image de la caméra d'une WebCam connectée
it: Mostra l'immagine della fotocamera
ja: カメラ画像を表示
pl: Pokaż obraz z kamery
pt: Mostrar imagem da câmera
ru: Показывает изображение с камеры подключенной веб-камеры
tr: Kamera resmini göster
zh_cn: 显示已连接的WebCam的摄像机图像

# toolStrip_tb_StreamLine.ToolTipText
source: Marked line
ar: خط ملحوظ
cs: Označená čára
de_de: Markierte Zeile
es: Línea marcada
fr: Ligne marquée
it: Linea segnata
ja: マークライン
pl: Linia oznaczona
pt: Linha marcada
ru: Отмеченная линия
tr: işaretli çizgi
zh_cn: 标记线

# startStreamingAtLineToolStripMenuItem.Text
source: Start Streaming at line
ar: بدء الجري في خط
cs: Začněte streamovat na řádku
de_de: Startet das Streaming ab Zeile
es: Comience a transmitir en línea
fr: Commencer le streaming à la ligne
it: Avvia lo streaming in linea
ja: ラインでストリーミングを開始
pl: Rozpocznij strumieniowanie na linii
pt: Comece a transmitir na linha
ru: Начать потоковую передачу на линии
tr: Satırda Akışı Başlat
zh_cn: 开始在线传输流

# startStreamingAtLineToolStripMenuItem.ToolTipText
source: Set start line here if G-Code must not start at line 0
ar: اضبط سطر البدء هنا إذا كان يجب ألا يبدأ G-Code من السطر 0
cs: Zde nastavte počáteční řádek, pokud G-Code nesmí začínat na řádku 0
de_de: Lege hier die Startzeile fest, wenn G-Code nicht bei Zeile 0 beginnen soll
es: Establezca la línea de inicio aquí si G-Code no debe comenzar en la línea 0
fr: Définissez la ligne de départ ici si G-Code ne doit pas commencer à la ligne 0
it: Imposta qui la linea di partenza se il codice G non deve iniziare alla linea 0
ja: Gコードが行at0で開始してはならない場合は、ここで開始行を設定します
pl: Ustaw tutaj linię startową, jeśli G-Code nie może zaczynać się od linii 0
pt: Defina aqui a linha inicial se o Código G não puder começar na linha 0
ru: Установите начальную строку здесь, если G-Code не должен начинаться со строки 0
tr: G Kodunun 0 satırında başlamaması gerekiyorsa başlangıç ​​satırını burada ayarlayın
zh_cn: 如果G代码不能从第0行开始，则在此处设置开始行

# toolStripViewMachineFix.Text
source: Fixed Machine area
ar: منطقة آلة ثابتة
cs: Pevná oblast stroje
de_de: Machinenbereich fixiert
es: Área de la máquina
fr: Zone de machine fixe
it: Zona macchina fissa
ja: 固定機械エリア
pl: Stały obszar maszyny
pt: Área fixa da máquina
ru: Фиксированная площадь машины
tr: Sabit Makine alanı
zh_cn: 固定机器区

# toolStripViewMachineFix.ToolTipText
source: Limit and offset can be set via 'Setup' - 'Control' - 'Maschine area'
ar: يمكن ضبط الحد والإزاحة عبر "الإعداد" - "التحكم" - "منطقة Maschine"
cs: Limit a offset lze nastavit pomocí 'Setup' - 'Control' - 'Maschine area'
de_de: Grenzen und Offset werden über 'Einstellungen' - 'Steuerung' - 'Maschinen Arbeitsbereich' gesetzt
es: El límite y la compensación se pueden configurar a través de 'Configuración' - 'Control' - 'Área de máquina'
fr: La limite et le décalage peuvent être définis via 'Configuration' - 'Contrôle' - 'Zone Maschine'
it: Limite e offset possono essere impostati tramite 'Impostazioni' - 'Controllo' - 'Area macchina'
ja: 制限とオフセットは、「セットアップ」-「コントロール」-「マシン領域」で設定できます
pl: Limit i offset można ustawić poprzez 'Ustawienia' - 'Kontrola' - 'Obszar maszyny'
pt: O limite e o deslocamento podem ser definidos através de 'Setup' - 'Control' - 'Maschine area'
ru: Предел и смещение могут быть установлены с помощью «Setup» - «Control» - «Maschine area»
tr: Limit ve ofset 'Kurulum' - 'Kontrol' - 'Makine alanı' aracılığıyla ayarlanabilir
zh_cn: 限制和偏移可以通过“设置”-“控制”-“机器区域”进行设置

# toolStripViewMachine.Text
source: Machine limits
ar: حدود الجهاز
cs: Limity stroje
de_de: Maschinengrenze
es: Límites de la máquina
fr: Limites de la machine
it: Limiti della macchina
ja: 機械の制限
pl: Limity maszyny
pt: Limites da máquina
ru: Пределы машины
tr: makine limitleri
zh_cn: 机器行程

# toolStripViewMachine.ToolTipText
source: Limit and offset can be set via 'Setup' - 'Control' - 'Maschine area'
ar: يمكن ضبط الحد والإزاحة عبر "الإعداد" - "التحكم" - "منطقة Maschine"
cs: Limit a offset lze nastavit pomocí 'Setup' - 'Control' - 'Maschine area'
de_de: Grenzen und Offset werden über 'Einstellungen' - 'Steuerung' - 'Maschinen Arbeitsbereich' gesetzt
es: El límite y la compensación se pueden configurar a través de 'Configuración' - 'Control' - 'Área de máquina'
fr: La limite et le décalage peuvent être définis via 'Configuration' - 'Contrôle' - 'Zone Maschine'
it: Limite e offset possono essere impostati tramite 'Impostazioni' - 'Controllo' - 'Area macchina'
ja: 制限とオフセットは、「セットアップ」-「コントロール」-「マシン領域」で設定できます
pl: Limit i offset można ustawić poprzez 'Ustawienia' - 'Kontrola' - 'Obszar maszyny'
pt: O limite e o deslocamento podem ser definidos através de 'Setup' - 'Control' - 'Maschine area'
ru: Предел и смещение могут быть установлены с помощью «Setup» - «Control» - «Maschine area»
tr: Limit ve ofset 'Kurulum' - 'Kontrol' - 'Makine alanı' aracılığıyla ayarlanabilir
zh_cn: 限制和偏移可以通过“设置”-“控制”-“机器区域”进行设置

# toolStripViewTool.Text
source: Tool table
ar: الجدول أداة
cs: Stůl na nářadí
de_de: Werkzeugpositionen
es: Tabla de herramientas
fr: Table à outils
it: Tabella degli attrezzi
ja: ツールテーブル
pl: Tablica narzędzi
pt: Tabela de ferramentas
ru: Стол для инструментов
tr: alet tablosu
zh_cn: 工具表

# toolStripViewTool.ToolTipText
source: Limit and offset can be set via 'Setup' - 'Tool change setup' - 'Tool table'
ar: يمكن ضبط الحد والإزاحة عبر "الإعداد" - "إعداد تغيير الأداة" - "جدول الأدوات"
cs: Limit a offset lze nastavit pomocí 'Nastavení' - 'Nastavení výměny nástroje' - 'Tabulka nástrojů'
de_de: Grenzen und Offset werden über 'Einstellungen' - 'Werkzeugwechsel' - 'Werkzeugliste' gesetzt
es: El límite y la compensación se pueden configurar a través de 'Configuración' - 'Configuración de cambio de herramienta' - 'Tabla de herramientas'
fr: La limite et l'offset peuvent être définis via 'Configuration' - 'Configuration de changement d'outil' - 'Table d'outils'
it: Limite e offset possono essere impostati tramite 'Setup' - 'Setup cambio utensile' - 'Tabella utensili'
ja: 制限とオフセットは、「セットアップ」-「ツール変更セットアップ」-「ツールテーブル」で設定できます
pl: Ograniczenie i przesunięcie można ustawić za pomocą „Ustawienia” - „Ustawienia wymiany narzędzi” - „Tablica narzędzi”
pt: O limite e o deslocamento podem ser definidos através de 'Configuração' - 'Configuração de troca de ferramenta' - 'Tabela de ferramentas'
ru: Предел и смещение могут быть установлены через «Настройка» - «Настройка смены инструмента» - «Таблица инструментов»
tr: Limit ve ofset 'Kurulum' - 'Takım değiştirme ayarı' - 'Alet tablosu' yoluyla ayarlanabilir
zh_cn: 可以通过“设置”-“换刀设置”-“工具表”设置极限和偏移

# toolStripViewBackground.Text
source: Background
ar: خلفية
cs: Pozadí
de_de: Hintergrund
es: Antecedentes
fr: Contexte
it: Sfondo
ja: バックグラウンド
pl: Tło
pt: fundo
ru: Фон
tr: Arka plan
zh_cn: 背景

# viewToolStripMenuItem.Text
source: View
ar: رأي
cs: Pohled
de_de: Ansicht
es: Vista
fr: Vue
it: Visualizzazione
ja: 表示する
pl: Widok
pt: Visão
ru: вид
tr: Görüş
zh_cn: 视图

# textWizzardToolStripMenuItem.ToolTipText
source: Simple copywriting with Hershey fonts
ar: كوبيوريتنغ بسيطة مع الخطوط هيرشي
cs: Jednoduchý copywriting s fonty Hershey
de_de: Einfache Texterstellung mit Hershey Fonts
es: Redacción simple con fuentes Hershey
fr: Rédaction simple avec les polices Hershey
it: Copywriting semplice con i caratteri Hershey
ja: Hersheyフォントを使用した簡単なコピーライティング
pl: Prosty copywriting z czcionkami Hershey
pt: Redação simples com fontes Hershey
ru: Простой копирайтинг с использованием шрифтов Hershey
tr: Hershey yazı tipleriyle basit metin yazarlığı
zh_cn: 使用Hershey字体进行简单的文案撰写

# btnStreamCheck.Text
source: Check Code
ar: التحقق من الشفرة
cs: Kontrolní kód
de_de: G-Code überprüfen
es: Código de verificación
fr: Vérifier le code
it: Controlla il codice
ja: チェックコード
pl: Sprawdź kod
pt: Verificar código
ru: Проверьте код
tr: Kodu kontrol et
zh_cn: 检查GCode

# btnOffsetApply.Text
source: Apply Offset
ar: تطبيق الأوفست
cs: Použít odsazení
de_de: Offset setzen
es: Aplicar desplazamiento
fr: Appliquer un décalage
it: Applica offset
ja: オフセットを適用
pl: Zastosuj offset
pt: Aplicar deslocamento
ru: Применить смещение
tr: Ofset Uygula
zh_cn: 应用偏移

# label6.Text
source: Offset Y
ar: إزاحة Y
it: Sposta Y
ja: オフセットY
ru: Смещ. Y
tr: Ofset Y
zh_cn: 偏移Y

# label1.Text
source: Offset X
ar: إزاحة X
it: Sposta X
ja: オフセットX
ru: Смещ. X
tr: Ofset X
zh_cn: 偏移X

# groupBox4.Text
source: Origin XY
ar: الأصل س ص
cs: Původ XY
de_de: Nullpunkt XY
es: Punto cero XY
fr: Point zéro XY
it: Origine XY
ja: 原点XY
pl: Punkt zero XY
pt: Origem XY
ru: Нулевая точка XY
tr: Menşei XY
zh_cn: XY零点位置

# gBOverrideRGB.Text
source: Rapid
ar: سريعون
de_de: Schnell
es: Rápido
fr: Rapide
it: Rapido
ja: ラピッド
pl: Szybki posuw
pt: Rápido
ru: быстрое
tr: Ani
zh_cn: 加速度

# gBoxOverride.Text
source: Overrides (grbl 1.1 only) - click to expand / shrink
ar: Overrides (grbl 1.1 فقط) - انقر لتوسيع / تقليص
cs: Přepsání (pouze grbl 1.1) – kliknutím rozbalíte / zmenšíte
de_de: Übersteuerungen (nur Grbl 1.1) - Klicken zum Vergrößern / Verkleinern
es: Anulaciones (solo grbl 1.1): haga clic para expandir / reducir
fr: Remplacements (grbl 1.1 uniquement) - cliquez pour agrandir / réduire
it: Sostituzioni (solo grbl 1.1): fare clic per espandere/ridurre
ja: オーバーライド（grbl 1.1のみ）-クリックして展開/縮小
pl: Nadpisywanie (tylko GRBL 1.1) - kliknij, aby rozwinąć / zmniejszyć
pt: Substituições (somente grbl 1.1) - clique para expandir / reduzir
ru: Переопределения (только для grbl 1.1) - нажмите, чтобы увеличить / уменьшить
tr: Geçersiz kılmalar (yalnızca grbl 1.1) - genişletmek / küçültmek için tıklayın
zh_cn: 调速（仅适用于grbl 1.1）-单击以展开/收缩

# btnJogStop.Text
source: STOP Jogging
ar: وقف الركض
cs: PŘESTAŇTE běhat
es: DETENER trotar
it: SMETTERE di fare jogging
ja: ジョギングをやめる
pl: ZATRZYMAJ bieg
pt: Parar Movimento
ru: Остановить перемещение
tr: Jogging'i DURDUR
zh_cn: 停止点动

# btnOverrideDoor.Text
source: Door
ar: باب
cs: Dveře
de_de: Tür
es: Puerta
fr: Porte
it: Porta
ja: ドア
pl: Bramka
pt: Porta
ru: Дверь
tr: Kapı
zh_cn: 安全门/紧急停止

# btnZeroC.Text
source: Zero C
ar: صفر جيم
cs: nula C
de_de: C nullen
es: Cero C
fr: Zéro C
ja: ゼロC
ru: Ноль C
tr: Sıfır C
zh_cn: 清零C

# btnZeroB.Text
source: Zero B
ar: صفر ب
cs: nula B
de_de: B nullen
es: Cero B
fr: Zéro B
ja: ゼロB
ru: Ноль B
tr: Sıfır B
zh_cn: 清零B

# btnZeroA.Text
source: Zero Z
ar: صفر Z
cs: Nula Z
de_de: A nullen
es: Cero A
fr: Zéro A
ja: ゼロZ
ru: Ноль A
tr: Sıfır Z
zh_cn: 清零A

# btnZeroXYZ.Text
source: Zero XYZ
ar: صفر XYZ
cs: Nula XYZ
de_de: XYZ nullen
es: Cero XYZ
fr: Zéro XYZ
ja: ゼロXYZ
ru: Ноль XYZ
tr: sıfır XYZ
zh_cn: 清零XYZ

# btnZeroXY.Text
source: Zero XY
ar: صفر XY
cs: Nula XY
de_de: XY nullen
es: Cero XY
fr: Zéro XY
ja: ゼロXY
ru: Ноль XY
tr: sıfır XY
zh_cn: 清零XY

# btnZeroZ.Text
source: Zero Z
ar: صفر Z
cs: Nula Z
de_de: Z nullen
es: Cero Z
fr: Zéro Z
ja: ゼロZ
ru: Ноль Z
tr: Sıfır Z
zh_cn: 清零Z

# btnZeroY.Text
source: Zero Y
ar: صفر Y
cs: nula Y
de_de: Y nullen
es: Cero Y
fr: Zéro Y
ja: ゼロY
ru: Ноль Y
tr: Sıfır Y
zh_cn: 清零Y

# btnZeroX.Text
source: Zero X
ar: صفر X
cs: nula X
de_de: X nullen
es: Cero X
fr: Zéro X
ja: ゼロX
ru: Ноль X
tr: Sıfır X
zh_cn: 清零X

# gCodeToolStripMenuItem.Text
source: G-Code T&ransform
ar: تحويل G- كود
cs: G-kód T&transformace
de_de: G-Code transformieren
es: Modificación G-Code
fr: Transformation de code
ja: Gコード変換
pl: Transformacje G-Code
pt: Alterar Código G
ru: Преобразование кода
tr: G Kodu T&dönüşüm
zh_cn: G代码转换

# laserToolsToolStripMenuItem.Text
source: Laser tools
ar: أدوات الليزر
cs: Laserové nástroje
es: Herramientas láser
fr: Outils laser
it: Strumenti laser
ja: レーザーツール
pl: Narzędzia lasera
pt: Ferramentas a laser
ru: Лазерные инструменты
tr: Lazer araçları
zh_cn: 激光工具

# probingToolLengthToolStripMenuItem.Text
source: Probing / Tool length
ar: التحقيق / طول الأداة
cs: Snímání / Délka nástroje
de_de: Abtasten / Werkzeuglänge
es: Sondeo / longitud de herramienta
fr: Palpage / Longueur de l'outil
it: Tastatura / Lunghezza utensile
ja: プロービング/ツールの長さ
pl: Sondowanie / Długość narzędzia
pt: Sondagem / comprimento da ferramenta
ru: Зондирование / Длина инструмента
tr: Problama / Takım uzunluğu
zh_cn: 探测/刀具长度

# surfaceScanHeightMapToolStripMenuItem.Text
source: Surface scan / Height map
ar: مسح السطح / خريطة الارتفاع
cs: Povrchový sken / Výšková mapa
de_de: Oberflächenscan / Höhenprofil
es: Escaneo de superficie / Mapa de altura
fr: Scan de surface / carte de hauteur
it: Scansione della superficie/mappa dell'altezza
ja: 表面スキャン/高さマップ
pl: Skanowanie powierzchni / Mapa wysokości
pt: Digitalização de superfície / mapa de altura
ru: Сканирование поверхности / Карта высот
tr: Yüzey taraması / Yükseklik haritası
zh_cn: 表面扫描/高度图

# workpieceToolStripMenuItem.Text
source: &Workpiece
ar: والشغل
cs: &Obrobek
de_de: Werkstück
es: Pieza de trabajo
fr: Pièce
it: &Pezzo
ja: ワーク
pl: Obróbka
pt: Auto Nivelamento e Sonda
ru: заготовки
tr: &İş parçası
zh_cn: 工件

# edgeFinderToolStripMenuItem.Text
source: Probing
ar: جس
cs: Sondování
de_de: Abtasten
es: Sondeo
fr: Sondage
it: Sondaggio
ja: プロービング
pl: Sondowanie
pt: Sondagem
ru: прощупывание
tr: Sondaj
zh_cn: 探测

# foldCodeBlocks1stLevelToolStripMenuItem.Text
source: Fold code blocks 1st level
ar: أضعاف كتل رمز المستوى 1
cs: Přeložte bloky kódu 1. úrovně
de_de: Codeblock auf erster Ebene einklappen
es: Doblar bloques de código 1er nivel
fr: Plier les blocs de code 1er niveau
it: Piega i blocchi di codice 1° livello
ja: フォールドコードブロック1レベル
pl: Składanie bloków kodu 1 poziom
pt: Dobrar blocos de código no 1º nível
ru: Сложите кодовые блоки 1-го уровня
tr: Katlama kodu blokları 1. düzey
zh_cn: 折叠代码块1级

# expandCodeBlocksToolStripMenuItem1.Text
source: Expand code blocks
ar: توسيع كتل التعليمات البرمجية
cs: Rozbalte bloky kódu
de_de: Alle Codeblöcke aufklappen
es: Expandir bloques de código
fr: Développer les blocs de code
it: Espandi i blocchi di codice
ja: コードブロックを展開する
pl: Rozwiń bloki kodu
pt: Expandir blocos de código
ru: Развернуть блоки кода
tr: Kod bloklarını genişlet
zh_cn: 展开代码块

# toolStripViewRuler.Text
source: Ruler
ar: مسطرة
cs: Pravítko
de_de: Lineal
es: Gobernante
fr: Règle
it: Governate
ja: 定規
pl: Linijka
pt: governante
ru: правитель
tr: Cetvel
zh_cn: 网格标尺

# toolStripViewInfo.Text
source: Info
ar: معلومات
it: Informazioni
ja: 情報
pl: Informacja
pt: Informações
ru: Информация
tr: Bilgi
zh_cn: 信息

# toolStripViewPenUp.Text
source: Pen-Up path
ar: مسار القلم الهاتفي
cs: Pen-Up cesta
de_de: Stift-Oben Pfad
es: Ruta de Pen-Up
fr: Chemin Pen-Up
it: Percorso Pen-Up
ja: ペンアップパス
pl: Ścieżka 'Pen-Up'
pt: Caminho de caneta para cima
ru: Пин-ап путь
tr: Pen-Up yolu
zh_cn: 无切削、落笔的路径（快速移动）

# foldCodeBlocks2ndLevelToolStripMenuItem.Text
source: Fold code blocks 2nd level
ar: أضعاف كتل رمز المستوى 2
cs: Přeložte bloky kódu 2. úrovně
de_de: Codeblock auf zweiter Ebene einklappen
es: Bloques de código plegado 2do nivel
fr: Plier les blocs de code 2e niveau
it: Piega i blocchi di codice 2° livello
ja: フォールドコードブロック2レベル
pl: Składanie bloków kodu 2 poziom
pt: Dobrar blocos de código 2º nível
ru: Сложите кодовые блоки 2-го уровня
tr: Katlama kodu blokları 2. düzey
zh_cn: 折叠代码块2级

# foldCodeBlocks3rdLevelToolStripMenuItem.Text
source: Fold code blocks 3rd level
ar: أضعاف كتل رمز المستوى 3
cs: Přeložte kódové bloky 3. úrovně
de_de: Codeblock auf dritter Ebene einklappen
es: Bloques de código plegado 3er nivel
fr: Le code de pliage bloque le 3e niveau
it: Piega i blocchi di codice 3° livello
ja: フォールドコードブロック3レベル
pl: Składanie bloków kodu 3 poziom
pt: Blocos de código dobrável 3º nível
ru: Сложите кодовые блоки 3-го уровня
tr: Katlama kodu blokları 3. düzey
zh_cn: 折叠代码块3级

# label6.ToolTip
source: Offset Y
ar: إزاحة Y
it: Sposta Y
ja: オフセットY
ru: Смещ. Y
tr: Ofset Y
zh_cn: 偏移Y

# label1.ToolTip
source: Offset X
ar: إزاحة X
it: Sposta X
ja: オフセットX
ru: Смещ. X
tr: Ofset X
zh_cn: 偏移X

# gBOverrideASGB.Text
source: Toggle Accessory States
ar: تبديل الدول التبعي
cs: Přepnout stavy příslušenství
de_de: Zubehörstatus umschalten
es: Alternar estados accesorios
fr: Toggle États des accessoires
it: Attiva/disattiva gli stati degli accessori
ja: アクセサリ状態の切り替え
pl: Przełączanie stanów akcesoriów
pt: Alternar estados acessórios
ru: переключать вспомогательные состояния
tr: Aksesuar Durumlarını Değiştir
zh_cn: 切换附件状态

# lblStatusFeed.Text
source: actual feed
ar: تغذية الفعلية
cs: skutečné krmivo
de_de: Akt. Vorschub
es: alimentación actual
fr: flux actuel
it: alimentazione reale
ja: 実際のフィード
pl: Posuw rzeczywisty
pt: alimentação atual
ru: текущий канал
tr: gerçek besleme
zh_cn: 当前的进给

# gBOverrideFRGB.Text
source: Feed
ar: تغذية
cs: Krmit
de_de: Vorschub
es: pienso
fr: alimentation
it: Alimentazione
ja: フィード
pl: Posuw
pt: alimentação
ru: подача
tr: Beslemek
zh_cn: 进给

# lblStatusSpeed.Text
source: actual speed
ar: السرعة الفعلية
cs: skutečná rychlost
de_de: aktuelle Drehzahl
es: velocidad actual
fr: vitesse actuelle
it: velocità effettiva
ja: 実際の速度
pl: Rzeczywista prędkość
pt: velocidade atual
ru: текущая скорость
tr: gerçek hız
zh_cn: 当前速度

# btnStreamCheck.ToolTip
source: This toggles the Grbl's gcode parser to take all incoming blocks and process them completely, as it would in normal operation, but it does not move any of the axes, ignores dwells, and powers off the spindle and coolant. This is intended as a way to provide the user a way to check how their new G-code program fares with Grbl's parser and monitor for any errors (and checks for soft limit violations, if enabled).
ar: يعمل هذا على تبديل المحلل اللغوي الخاص بـ Grbl لأخذ جميع الكتل الواردة ومعالجتها تمامًا ، كما هو الحال في التشغيل العادي ، لكنه لا يحرك أي من المحاور ، ويتجاهل المساكن ، ويفصل الطاقة عن المغزل والمبرد. الغرض من ذلك هو توفير وسيلة للمستخدم للتحقق من كيفية حصول برنامج G-code الجديد على محلل Grbl ومراقبته عن أي أخطاء (والتحقق من انتهاكات الحد المسموح به ، إذا كان ممكّنًا).
cs: Tím se přepne analyzátor gcode Grbl tak, aby vzal všechny příchozí bloky a úplně je zpracoval, jako by to bylo za normálního provozu, ale nepohybuje žádnou z os, ignoruje prodlevy a vypne vřeteno a chladicí kapalinu. Toto je zamýšleno jako způsob, jak poskytnout uživateli způsob, jak zkontrolovat, jak si jejich nový program G-code vede pomocí analyzátoru Grbl a monitorovat případné chyby (a kontroluje překročení měkkých limitů, je-li povoleno).
de_de: Dadurch wird der Gcode-Parser des Grbl so umgeschaltet, dass alle eingehenden Blöcke wie im normalen Betrieb vollständig verarbeitet werden. Er bewegt jedoch keine der Achsen, ignoriert Verweilzeiten und schaltet die Spindel und das Kühlmittel aus. Auf diese Weise kann der Benutzer überprüfen, wie sein neues G-Code-Programm mit dem Grbl-Parser abschneidet und auf Fehler überwacht (und, falls aktiviert, auf Soft-Limit-Verstöße überprüft).
es: Esto alterna el analizador gcode de Grbl para tomar todos los bloques entrantes y procesarlos por completo, como lo haría en una operación normal, pero no mueve ninguno de los ejes, ignora las paradas y apaga el eje y el refrigerante. Esto pretende ser una forma de proporcionar al usuario una forma de verificar cómo su nuevo programa de código G funciona con el analizador y monitor de Grbl en busca de errores (y verifica si hay violaciones del límite flexible, si está habilitado).
fr: Cela bascule l'analyseur gcode du Grbl pour prendre tous les blocs entrants et les traiter complètement, comme il le ferait en fonctionnement normal, mais il ne déplace aucun des axes, ignore les arrêts et éteint la broche et le liquide de refroidissement. Ceci est destiné à fournir à l'utilisateur un moyen de vérifier comment son nouveau programme G-code se comporte avec l'analyseur de Grbl et de surveiller les erreurs (et vérifie les violations de limites logicielles, s'il est activé).
it: Questo commuta il parser gcode di Grbl per prendere tutti i blocchi in entrata ed elaborarli completamente, come farebbe nel normale funzionamento, ma non sposta nessuno degli assi, ignora le soste e spegne il mandrino e il refrigerante. Questo è inteso come un modo per fornire all'utente un modo per verificare come si comporta il loro nuovo programma G-code con il parser di Grbl e monitorare eventuali errori (e controlla le violazioni dei limiti software, se abilitati).
ja: これは、Grblのgcodeパーサーを切り替えて、すべての着信ブロックを取得し、通常の動作と同様に完全に処理しますが、軸を移動せず、滞留を無視し、スピンドルとクーラントの電源を切ります。 これは、ユーザーに新しいGコードプログラムがGrblのパーサーでどのように動作するかを確認し、エラーを監視する（および有効になっている場合はソフト制限違反を確認する）方法を提供することを目的としています。
pl: Włącza to parser kodu GRBL'a, który przyjmuje wszystkie przychodzące bloki i przetwarza je w całości, tak jak w normalnym trybie pracy, ale nie przesuwa żadnej z osi, ignoruje opóźnienia i wyłącza wrzeciono i chłodziwo. Ma to na celu zapewnienie użytkownikowi sposobu na sprawdzenie, jak jego nowy program G-Code radzi sobie z parserem GRBL'a i monitorowanie wszelkich błędów (oraz sprawdzanie naruszeń miękkiego limitu, jeśli jest włączony).
pt: Isso alterna o analisador gcode do Grbl para pegar todos os blocos recebidos e processá-los completamente, como faria na operação normal, mas não move nenhum dos eixos, ignora as interrupções e desliga o eixo e o líquido de arrefecimento. Isso tem como objetivo fornecer ao usuário uma maneira de verificar como o seu novo programa de código G se sai bem com o analisador do Grbl e monitorar se há erros (e verifica se há violações de limites suaves, se ativado).
ru: Это переключает анализатор g-кода Grbl на прием всех входящих блоков и их полную обработку, как при обычной работе, но он не перемещает ни одну из осей, игнорирует задержки и отключает шпиндель и охлаждающую жидкость. Это предназначено для того, чтобы предоставить пользователю способ проверить, как его новая программа G-кода работает с парсером Grbl, и следить за любыми ошибками (и проверять нарушения мягкого лимита, если они включены).
tr: Bu, Grbl'nin gcode ayrıştırıcısını normal çalışmada olduğu gibi tüm gelen blokları alacak ve tamamen işleyecek şekilde değiştirir, ancak eksenlerin hiçbirini hareket ettirmez, beklemeleri yok sayar ve iş milini ve soğutma sıvısını kapatır. Bu, kullanıcıya yeni G-kodu programının Grbl'ın ayrıştırıcısı ile nasıl çalıştığını kontrol etmesi ve herhangi bir hatayı izlemesi (ve etkinleştirilmişse yumuşak limit ihlallerini kontrol etmesi) için bir yol sağlamayı amaçlamaktadır.
zh_cn: 切换到Grbl的gcode解释器以获取所有传入的代码并完全对其进行处理，就像在正常操作中一样，但是它不会移动任何轴，停止并关闭主轴和冷却液。 这样是为了给用户提供使用Grbl的解析器检查其新G代码程序的运行状况并检测错误的方法（并检查运动是否超出了软限位，如果已启用）。

# btnSimulateSlower.ToolTip
source: Half simulation speed
ar: نصف سرعة المحاكاة
cs: Poloviční rychlost simulace
de_de: Halbe Simulationsgeschwindigkeit
es: Media velocidad de simulación
fr: Demi vitesse de simulation
it: Velocità di simulazione dimezzata
ja: 半分のシミュレーション速度
pl: Połowa prędkości symulacji
pt: Meia velocidade de simulação
ru: Половина скорости симуляции
tr: Yarım simülasyon hızı
zh_cn: 半倍仿真速度
