Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# control3rdGRBLToolStripMenuItem.ToolTipText
source: Opens a simple window to control a unit via a 3rd serial com
ar: يفتح نافذة بسيطة للتحكم في وحدة عن طريق كوم التسلسلي الثالث
cs: Otevře jednoduché okno pro ovládání jednotky přes 3. sériový com
de_de: Öffnet ein einfaches Fenster, um ein Gerät über eine dritte serielle Schnittstelle zu steuern
es: Abre una ventana simple para controlar una unidad a través de un tercer serial com
fr: Ouvre une fenêtre simple pour contrôler une unité via un 3ème com série
it: Apre una semplice finestra per controllare un'unità tramite una terza comunicazione seriale
ja: 3番目のシリアルコムを介してユニットを制御するための簡単なウィンドウを開きます
pl: Otwiera proste okno do sterowania urządzeniem za pośrednictwem 3go portu szeregowego
pt: Abre uma janela simples para controlar uma unidade através de um 3º com serial
ru: Открывает простое окно для управления блоком через 3-й последовательный порт.
tr: Bir birimi 3. bir seri iletişim yoluyla kontrol etmek için basit bir pencere açar
zh_cn: 打开一个简单的窗口以通过第三个COM口控制一个设备

# projectorToolStripMenuItem.Text
source: Projector
ar: كشاف ضوئي
cs: Projektor
de_de: Projektor
es: Proyector
fr: Projecteur
it: Proiettore
ja: プロジェクター
pl: Projektor
pt: Projetor
ru: проектор
tr: projektör
zh_cn: 投影仪

# projectorToolStripMenuItem.ToolTipText
source: Opens a new window to display machine-path on the workpiece via a projector above the work bench
ar: يفتح نافذة جديدة لعرض مسار الماكينة على قطعة العمل عبر جهاز عرض أعلى طاولة العمل
cs: Otevře nové okno pro zobrazení dráhy stroje na obrobku prostřednictvím projektoru nad pracovním stolem
de_de: Öffnet ein neues Fenster, um die Maschinenbahn auf dem Werkstück über einen Projektor über der Werkbank anzuzeigen
es: Abre una nueva ventana para mostrar la trayectoria de la máquina en la pieza de trabajo a través de un proyector sobre el banco de trabajo
fr: Ouvre une nouvelle fenêtre pour afficher la trajectoire de la machine sur la pièce via un projecteur au-dessus du banc de travail
it: Apre una nuova finestra per visualizzare il percorso macchina sul pezzo tramite un proiettore sopra il banco di lavoro
ja: 新しいウィンドウを開き、作業台の上のプロジェクターを介してワークピースのマシンパスを表示します
pl: Otwiera nowe okno, aby wyświetlić ścieżkę maszyny na obrabianym przedmiocie za pomocą projektora nad stołem roboczym
pt: Abre uma nova janela para exibir o caminho da máquina na peça de trabalho por meio de um projetor acima da bancada de trabalho
ru: Открывает новое окно для отображения траектории станка на заготовке с помощью проектора над рабочим столом.
tr: Çalışma tezgahının üzerindeki bir projektör aracılığıyla iş parçası üzerindeki makine yolunu görüntülemek için yeni bir pencere açar
zh_cn: 打开一个新窗体，通过工作台上方的投影仪显示工件上的机器路径

# showFormsToolStripMenuItem.Text
source: Forms to front
ar: أشكال في المقدمة
cs: Formy dopředu
de_de: Fenster nach vorne
es: Formularios al frente
fr: Formulaires à l'avant
it: Moduli davanti
ja: 前面にフォーム
pl: Okna na wierzch
pt: Formulários para a frente
ru: Формы вперед
tr: Öne doğru formlar
zh_cn: 显示其他窗口

# showFormsToolStripMenuItem.ToolTipText
source: Brings all open GRBL-Plotter forms (e.g. Text creation) to the front of the z order
ar: يجلب جميع نماذج GRBL-Plotter المفتوحة (مثل إنشاء النص) في مقدمة الترتيب z
cs: Přenese všechny otevřené formuláře GRBL-Plotter (např. vytváření textu) na začátek pořadí z
de_de: Bringt alle geöffneten GRBL-Plotter-Formulare (z. B. Texterstellung) in den Vordergrund der z-Reihenfolge
es: Trae todos los formularios GRBL-Plotter abiertos (por ejemplo, creación de texto) al frente del orden z
fr: Amène tous les formulaires GRBL-Plotter ouverts (par exemple, la création de texte) au début de l'ordre z
it: Porta tutti i moduli GRBL-Plotter aperti (ad es. Creazione di testo) in primo piano nell'ordine z
ja: 開いているすべてのGRBL-プロッタフォーム（テキスト作成など）をzオーダーの前に移動します
pl: Sprowadza wszystkie otwarte okna GRBL-Plotter (np. tworzenie tekstu) na wierzch.
pt: Traz todos os formulários GRBL-Plotter abertos (por exemplo, criação de texto) para a frente da ordem z
ru: Переносит все открытые формы GRBL-Plotter (например, создание текста) в начало порядка z.
tr: Tüm açık GRBL-Plotter formlarını (ör. Metin oluşturma) z sırasının önüne getirir
zh_cn: 将所有打开的 GRBL-Plotter 窗口（例如文本创建）带到 z 顺序的前面

# CbAddGraphic.ToolTip
source: If enabled, the new imported G-Code will be inserted to the already existing code. Changing import settings after the first import can lead to undesired effects.
ar: في حالة التمكين ، سيتم إدراج G-Code الجديد المستورد في الكود الموجود بالفعل. قد يؤدي تغيير إعدادات الاستيراد بعد الاستيراد الأول إلى تأثيرات غير مرغوب فيها.
cs: Pokud je povoleno, nový importovaný G-kód bude vložen do již existujícího kódu. Změna nastavení importu po prvním importu může vést k nežádoucím efektům.
de_de: Wenn aktiviert, wird der neu importierte G-Code in den bereits vorhandenen Code eingefügt. Das Ändern der Importeinstellungen nach dem ersten Import kann zu unerwünschten Effekten führen.
es: Si está habilitado, el nuevo código G importado se insertará en el código ya existente. Cambiar la configuración de importación después de la primera importación puede provocar efectos no deseados.
fr: Si activé, le nouveau G-Code importé sera inséré dans le code déjà existant. La modification des paramètres d'importation après la première importation peut entraîner des effets indésirables.
it: Se abilitato, il nuovo G-Code importato verrà inserito nel codice già esistente.La modifica delle impostazioni di importazione dopo la prima importazione può causare effetti indesiderati.
ja: 有効にすると、新しくインポートされたGコードが既存のコードに挿入されます。 最初のインポート後にインポート設定を変更すると、望ましくない影響が生じる可能性があります。
pl: Jeśli jest włączone, nowy importowany G-Code zostanie wstawiony do już istniejącego kodu. Zmiana ustawień importu po pierwszym imporcie może prowadzić do niepożądanych efektów.
pt: Se habilitado, o novo G-Code importado será inserido no código já existente. Alterar as configurações de importação após a primeira importação pode levar a efeitos indesejados.
ru: Если этот параметр включен, новый импортированный G-код будет вставлен в уже существующий код. Изменение настроек импорта после первого импорта может привести к нежелательным последствиям.
tr: Etkinleştirilirse, içe aktarılan yeni G-Kodu mevcut koda eklenecektir. İlk içe aktarmadan sonra içe aktarma ayarlarının değiştirilmesi istenmeyen etkilere neden olabilir.
zh_cn: 如果启用，新导入的 G 代码将插入到现有代码中。 首次导入后更改导入设置可能会导致不良影响。

# cmsPicBoxDuplicatePath.Text
source: Duplicate selected path
ar: المسار المحدد مكرر
cs: Duplikovat vybranou cestu
de_de: Ausgewählten Pfad duplizieren
es: Ruta seleccionada duplicada
fr: Dupliquer le chemin sélectionné
it: Duplica il percorso selezionato
ja: 選択したパスを複製する
pl: Duplikuj wybraną ścieżkę
pt: Duplicar caminho selecionado
ru: Дублировать выбранный путь
tr: Seçilen yolu kopyala
zh_cn: 复制所选路径

# cmsPicBoxShowProperties.Text
source: Properties of selected path
ar: خصائص المسار المحدد
cs: Vlastnosti vybrané cesty
de_de: Eigenschaften des ausgewählten Pfads
es: Propiedades de la ruta seleccionada
fr: Propriétés du chemin sélectionné
it: Proprietà del percorso selezionato
ja: 選択したパスのプロパティ
pl: Właściwości wybranej ścieżki
pt: Propriedades do caminho selecionado
ru: Свойства выбранного пути
tr: Seçilen yolun özellikleri
zh_cn: 所选路径的属性

# cmsPicBoxMoveToMarkedPosition.ToolTipText
source: Move tool to marked position
ar: انقل الأداة إلى الموضع المحدد
cs: Přesuňte nástroj do označené pozice
de_de: Werkzeug an markierte Position fahren
es: Mover la herramienta a la posición marcada
fr: Déplacer l'outil à la position marquée
it: Sposta lo strumento nella posizione contrassegnata
ja: ツールをマークされた位置に移動します
pl: Przesuń narzędzie na zaznaczoną pozycję
pt: Move a ferramenta para a posição marcada
ru: Переместите инструмент в отмеченное положение
tr: Aleti işaretli konuma taşı
zh_cn: 将工具移动到标记位置

# cmsPicBoxZeroXYAtMarkedPosition.ToolTipText
source: Set actual work coordinate system to zero at marked position
ar: اضبط نظام الإحداثيات الفعلي على صفر في الموضع المحدد
cs: Nastavte aktuální souřadný systém na nulu na označené pozici
de_de: Aktuelles Koordinatensystem an markierter Stelle auf Null setzen
es: Establezca el sistema de coordenadas real en cero en la posición marcada
fr: Définir le système de coordonnées réel sur zéro à la position marquée
it: Impostare il sistema di coordinate effettivo su zero nella posizione contrassegnata
ja: マークされた位置で実際の座標系をゼロに設定します
pl: Ustaw rzeczywisty układ współrzędnych na zero w zaznaczonym miejscu
pt: Defina o sistema de coordenadas real para zero na posição marcada
ru: Установите фактическую систему координат на ноль в отмеченной позиции
tr: Gerçek koordinat sistemini işaretli konumda sıfıra ayarla
zh_cn: 在标记位置将实际坐标系设置为零

# cmsPicBoxPasteFromClipboard.ToolTipText
source: Process data from clipboard, like SVG, DXF, TXT (SVG or GCode) or image
ar: معالجة البيانات من الحافظة ، مثل SVG أو DXF أو TXT (SVG أو GCode) أو الصورة
cs: Zpracování dat ze schránky, jako jsou SVG, DXF, TXT (SVG nebo GCode) nebo obrázek
de_de: Verarbeitet die Daten aus der Zwischenablage, wie SVG, DXF, TXT (SVG oder GCode) oder Bild
es: Procese datos del portapapeles, como SVG, DXF, TXT (SVG o GCode) o imagen
fr: Traiter les données du presse-papiers, comme SVG, DXF, TXT (SVG ou GCode) ou image
it: Elabora i dati dagli appunti, come SVG, DXF, TXT (SVG o GCode) o immagini
ja: SVG、DXF、TXT（SVGまたはGCode）や画像などのクリップボードからのデータを処理する
pl: Przetwarzanie danych ze schowka, takich jak SVG, DXF, TXT (SVG lub G-Code) lub obrazów
pt: Processe dados da área de transferência, como SVG, DXF, TXT (SVG ou GCode) ou imagem
ru: Обработка данных из буфера обмена, таких как SVG, DXF, TXT (SVG или GCode) или изображения
tr: SVG, DXF, TXT (SVG veya GCode) veya görüntü gibi panodaki verileri işleyin
zh_cn: 处理剪贴板中的数据，例如 SVG、DXF、TXT（SVG 或 GCode）或图像

# cmsPicBoxReloadFile.ToolTipText
source: Reload last loaded file
ar: إعادة تحميل آخر ملف تم تحميله
cs: Znovu načíst naposledy načtený soubor
de_de: Zuletzt geladene Datei neu laden
es: Recargar último archivo cargado
fr: Recharger le dernier fichier chargé
it: Ricarica l'ultimo file caricato
ja: 最後にロードされたファイルをリロードします
pl: Przeładuj ostatnio załadowany plik
pt: Recarregue o último arquivo carregado
ru: Перезагрузить последний загруженный файл
tr: Son yüklenen dosyayı yeniden yükle
zh_cn: 重新加载上次加载的文件

# cmsPicBoxShowProperties.ToolTipText
source: Show or edit properties of selected figure or group
ar: إظهار أو تحرير خصائص الشكل أو المجموعة المحددة
cs: Zobrazit nebo upravit vlastnosti vybraného obrázku nebo skupiny
de_de: Eigenschaften der ausgewählten Figur oder Gruppe anzeigen oder bearbeiten
es: Mostrar o editar propiedades de la figura o grupo seleccionado
fr: Afficher ou modifier les propriétés de la figure ou du groupe sélectionné
it: Mostra o modifica le proprietà della figura o del gruppo selezionato
ja: 選択した図またはグループのプロパティを表示または編集する
pl: Pokaż lub edytuj właściwości wybranej figury lub grupy
pt: Mostrar ou editar propriedades da figura ou grupo selecionado
ru: Показать или изменить свойства выбранной фигуры или группы
tr: Seçili şekil veya grubun özelliklerini göster veya düzenle
zh_cn: 显示或编辑选定路径的属性

# cmsPicBoxDuplicatePath.ToolTipText
source: Duplicate figure or group with optional offset (check [Setup - Program appearance - 2D-View / Editor]
ar: شكل أو مجموعة مكررة مع إزاحة اختيارية (حدد [الإعداد - مظهر البرنامج - عرض ثنائي الأبعاد / محرر]
cs: Duplicitní obrázek nebo skupina s volitelným odsazením (zkontrolujte [Nastavení - Vzhled programu - 2D-View / Editor]
de_de: Figur oder Gruppe mit optionalem Versatz duplizieren (siehe [Setup - Programmdarstellung - 2D-Ansicht / Editor]
es: Duplicar figura o grupo con desplazamiento opcional (marque [Configuración - Aspecto del programa - Vista 2D / Editor]
fr: Figure ou groupe en double avec décalage facultatif (vérifier [Configuration - Apparence du programme - Vue 2D / Éditeur]
it: Figura o gruppo duplicati con offset opzionale (selezionare [Impostazioni - Aspetto programma - Vista 2D / Editor]
ja: オプションのオフセットを使用して図またはグループを複製します（[セットアップ-プログラムの外観-2D-ビュー/エディター]をチェックします]
pl: Powielanie figury lub grupy z opcjonalnym przesunięciem (sprawdź [Ustawienia - Wygląd programu - Widok 2D / Edytor]
pt: Figura ou grupo duplicado com deslocamento opcional (verifique [Configuração - Aparência do programa - Visualização 2D / Editor]
ru: Дублировать фигуру или группу с необязательным смещением (отметьте [Настройка - Внешний вид программы - 2D-вид / Редактор]
tr: İsteğe bağlı ofset ile yinelenen şekil veya grup ([Kurulum - Program görünümü - 2B Görünüm / Düzenleyici] öğesini kontrol edin)
zh_cn: 用可选偏移量复制图形或组（检查 [设置 - 程序外观 - 2D-视图/编辑器]）

# cmsPicBoxCropSelectedPath.ToolTipText
source: Crop (release) selected figure or group
ar: اقتصاص (تحرير) الشكل أو المجموعة المحددة
cs: Ořízněte (uvolněte) vybranou postavu nebo skupinu
de_de: Ausgewählte Figur oder Gruppe zuschneiden (freigeben).
es: Recortar (liberar) figura o grupo seleccionado
fr: Recadrer (libérer) la figure ou le groupe sélectionné
it: Ritaglia (rilascia) la figura o il gruppo selezionato
ja: 選択したフィギュアまたはグループを切り抜く（リリースする）
pl: Kadrowanie (zwalnianie) wybranej figury lub grupy
pt: Cortar (soltar) figura ou grupo selecionado
ru: Обрезать (освободить) выбранную фигуру или группу
tr: Seçilen figürü veya grubu kırpın (bırakın)
zh_cn: 剪切（释放）所选图形或组

# cmsPicBoxReverseSelectedPath.ToolTipText
source: Reverse order of path node - only possible after import of graphic
ar: ترتيب عكسي لعقدة المسار - ممكن فقط بعد استيراد الرسم
cs: Opačné pořadí uzlu cesty - možné pouze po importu grafiky
de_de: Umgekehrte Reihenfolge der Pfadknoten - nur nach Import der Grafik möglich
es: Orden inverso del nodo de ruta: solo es posible después de importar el gráfico
fr: Ordre inverse du nœud de chemin - uniquement possible après l'importation du graphique
it: Ordine inverso del nodo del percorso - possibile solo dopo l'importazione della grafica
ja: パスノードの逆順-グラフィックのインポート後にのみ可能
pl: Odwrócenie kolejności węzła ścieżki - możliwe tylko po zaimportowaniu grafiki
pt: Ordem inversa do nó do caminho - só possível após a importação do gráfico
ru: Обратный порядок узлов пути - возможен только после импорта графики
tr: Yol düğümünün ters sırası - yalnızca grafiğin içe aktarılmasından sonra mümkündür
zh_cn: 路径节点的逆序 - 仅在导入图形后才有可能

# cmsPicBoxRotateSelectedPath.ToolTipText
source: Rotate start node of selected path to click position- only possible after import of graphic
ar: قم بتدوير عقدة البداية للمسار المحدد للنقر فوق الموضع - ممكن فقط بعد استيراد الرسم
cs: Otočit počáteční uzel vybrané cesty na pozici kliknutí – možné pouze po importu grafiky
de_de: Startknoten des ausgewählten Pfades auf Klickposition drehen - nur nach Import der Grafik möglich
es: Gire el nodo de inicio de la ruta seleccionada para hacer clic en la posición; solo es posible después de importar el gráfico
fr: Faire pivoter le nœud de départ du chemin sélectionné pour cliquer sur la position - uniquement possible après l'importation du graphique
it: Ruota il nodo iniziale del percorso selezionato per fare clic sulla posizione, possibile solo dopo l'importazione della grafica
ja: 選択したパスの開始ノードを回転して位置をクリックします-グラフィックのインポート後にのみ可能です
pl: Obróć węzeł początkowy wybranej ścieżki do pozycji kliknięcia - możliwe tylko po zaimportowaniu grafiki
pt: Gire o nó inicial do caminho selecionado para a posição do clique - somente possível após a importação do gráfico
ru: Повернуть начальный узел выбранного пути в положение щелчка — возможно только после импорта графики.
tr: Seçilen yolun başlangıç ​​düğümünü tıklama konumuna döndürme - yalnızca grafiğin içe aktarılmasından sonra mümkündür
zh_cn: 将所选路径的起始节点旋转到单击位置-仅在导入图形后才可能

# cmsPicBoxSetGCodeAsBackground.ToolTipText
source: Copy selected path to background
ar: نسخ المسار المحدد إلى الخلفية
cs: Zkopírujte vybranou cestu na pozadí
de_de: Ausgewählten Pfad in den Hintergrund kopieren
es: Copiar la ruta seleccionada al fondo
fr: Copier le chemin sélectionné en arrière-plan
it: Copia il percorso selezionato in background
ja: 選択したパスをバックグラウンドにコピーします
pl: Kopiuj wybraną ścieżkę do tła
pt: Copie o caminho selecionado para o plano de fundo
ru: Скопировать выбранный путь в фон
tr: Seçilen yolu arka plana kopyala
zh_cn: 将所选路径复制到背景

# copyContentTroClipboardToolStripMenuItem.ToolTipText
source: Copy 2D-View image to clipboard
ar: نسخ صورة ثنائية الأبعاد إلى الحافظة
cs: Zkopírujte obrázek 2D-View do schránky
de_de: Kopiert das 2D-View-Bild in die Zwischenablage
es: Copie la imagen de vista 2D al portapapeles
fr: Copier l'image 2D-View dans le presse-papiers
it: Copia l'immagine 2D-View negli appunti
ja: 2D-View画像をクリップボードにコピー
pl: Kopiuj obraz widoku 2D do schowka
pt: Copie a imagem 2D-View para a área de transferência
ru: Копировать 2D-изображение в буфер обмена
tr: 2D-View görüntüsünü panoya kopyala
zh_cn: 将 2D 视图图像复制到剪贴板

# toggleBlockExpansionToolStripMenuItem.Text
source: Automatic block folding
ar: الطي التلقائي للكتل
cs: Automatické skládání bloku
de_de: Automatische Blockfaltung
es: Plegado automático de bloques
fr: Pliage automatique des blocs
it: Piegatura automatica dei blocchi
ja: 自動ブロック折りたたみ
pl: Automatyczne składanie kodu
pt: Dobragem automática de blocos
ru: Автоматическое складывание блоков
tr: Otomatik blok katlama
zh_cn: 自动块折叠

# grblSetupToolStripMenuItem.Text
source: Grbl Setup
ar: إعداد Grbl
cs: Nastavení Grbl
es: Configuración Grbl
fr: Configuration Grbl
it: Configurazione grbl
ja: Grblセットアップ
pl: Ustawienia GRBL
pt: Configuração Grbl
ru: Настройка Грбл
tr: Grbl Kurulumu
zh_cn: Grbl设置

# processAutomationToolStripMenuItem.Text
source: Process automation
ar: أتمتة العمليات
cs: Procesní automatizace
de_de: Prozessautomatisierung
es: Automatización de procesos
fr: Automatisation des processus
it: Automazione del processo
ja: プロセスの自動化
pl: Automatyzacja procesów
pt: Automação do processo
ru: Автоматизация процессов
tr: Proses otomasyonu
zh_cn: 脚本

# wireCutterToolStripMenuItem.Text
source: Wire cutter
ar: قاطع الاسلاك
cs: Štípačky
de_de: Drahtschneider
es: cortador de alambre caliente
fr: Coupe-fil
it: Tagliafilo a filo caldo
ja: 熱線カッター
pl: Przecinarka do gorącego drutu
pt: Cortador de fio quente
ru: Резак для горячей проволоки
tr: Sıcak tel kesici
zh_cn: 热丝剪?

# BtnJogAbsZ.Text
source: Move to
ar: انتقل الى
cs: Convidar a
de_de: Fahre
es: Convidar a
fr: Passer à
it: Spostati in
ja: に移動します
pl: Przejdź do
pt: Mover para
ru: Перейти к
tr: Şuraya taşı:
zh_cn: 移动至

# BtnJogAbsY.Text
source: Move to
ar: انتقل الى
cs: Convidar a
de_de: Fahre
es: Convidar a
fr: Passer à
it: Spostati in
ja: に移動します
pl: Przejdź do
pt: Mover para
ru: Перейти к
tr: Şuraya taşı:
zh_cn: 移动至

# BtnJogAbsX.Text
source: Move to
ar: انتقل الى
cs: Convidar a
de_de: Fahre
es: Convidar a
fr: Passer à
it: Spostati in
ja: に移動します
pl: Przejdź do
pt: Mover para
ru: Перейти к
tr: Şuraya taşı:
zh_cn: 移动至

# Gb_Jogging.Text
source: Control / Jogging - click to expand
ar: التحكم / الركض - انقر للتوسيع
cs: Ovládání / Jogging - kliknutím rozbalte
de_de: Steuerung/Joggen – zum Vergrößern anklicken
es: Control/Jogging: haga clic para expandir
fr: Contrôle / Jogging - cliquez pour agrandir
it: Controllo/Jogging: fai clic per espandere
ja: コントロール / ジョギング - クリックして展開します
pl: Sterowanie / Jogging - kliknij, żeby rozwinąć
pt: Controle / Jogging - clique para expandir
ru: Контроль / Бег – нажмите, чтобы развернуть
tr: Kontrol / Jogging - genişletmek için tıklayın
zh_cn: 控制/慢跑 - 单击展开

# applyLastTransformToolStripMenuItem.Text
source: Apply last transform
ar: تطبيق التحويل الأخير
cs: Použít poslední transformaci
de_de: Letzte Transformation anwenden
es: Aplicar la última transformación
fr: Appliquer la dernière transformation
it: Applica l'ultima trasformazione
ja: 最後の変換を適用する
pl: Zastosuj ostatnią transformację
pt: Aplicar a última transformação
ru: Применить последнее преобразование
tr: Son dönüşümü uygula
zh_cn: 应用最后一次变换

# cmsPicBoxReloadFile2.Text
source: Reload File 2
ar: إعادة تحميل الملف 2
cs: Znovu načíst soubor 2
de_de: Datei 2 neu laden
es: Recargar archivo 2
fr: Recharger le fichier 2
it: Ricarica il file 2
ja: ファイル 2 のリロード
pl: Załaduj ponownie plik 2
pt: Recarregar arquivo 2
ru: Перезагрузить файл 2
tr: Dosya 2'yi Yeniden Yükle
zh_cn: 重新加载文件2

# cmsPicBoxClearWorkspace.Text
source: Clear workspace
ar: مسح مساحة العمل
cs: Vyčistit pracovní prostor
de_de: Arbeitsbereich löschen
es: Limpiar el espacio de trabajo
fr: Espace de travail clair
it: Spazio di lavoro chiaro
ja: すっきりとしたワークスペース
pl: Wyczyść obszar roboczy
pt: Limpar espaço de trabalho
ru: Очистить рабочее пространство
tr: Çalışma alanını temizle
zh_cn: 清空工作区

# convertToPolarCoordinatesToolStripMenuItem.Text
source: Convert to polar coordinates
ar: تحويل إلى الإحداثيات القطبية
cs: Převést na polární souřadnice
de_de: In Polarkoordinaten umrechnen
es: Convertir a coordenadas polares
fr: Convertir en coordonnées polaires
it: Convertire in coordinate polari
ja: 極座標に変換する
pl: Konwertuj na współrzędne biegunowe
pt: Converter para coordenadas polares
ru: Преобразовать в полярные координаты
tr: Kutupsal koordinatlara dönüştür
zh_cn: 转换为极坐标

# CbMist.ToolTip
source: Set 'M7', clear 'M9'
ar: اضبط "M7" وامسح "M9"
cs: Nastavit 'M7', vymazat 'M9'
de_de: „M7“ setzen, „M9“ löschen
es: Configure 'M7', borre 'M9'
fr: Définir 'M7', effacer 'M9'
it: Imposta 'M7', cancella 'M9'
ja: 「M7」を設定、「M9」をクリア
pl: Ustaw „M7”, wyczyść „M9”
pt: Defina 'M7', limpe 'M9'
ru: Установите «M7», очистите «M9».
tr: 'M7'yi ayarlayın, 'M9'u silin
zh_cn: 设置“M7”，清除“M9”

# CbSpindle.ToolTip
source: Set 'M3' or 'M4', clear 'M5'
ar: اضبط "M3" أو "M4"، وامسح "M5"
cs: Nastavte „M3“ nebo „M4“, vymažte „M5“
de_de: „M3“ oder „M4“ setzen, „M5“ löschen
es: Configure 'M3' o 'M4', borre 'M5'
fr: Réglez « M3 » ou « M4 », effacez « M5 »
it: Imposta 'M3' o 'M4', cancella 'M5'
ja: 「M3」または「M4」を設定し、「M5」をクリアします
pl: Ustaw „M3” lub „M4”, wyczyść „M5”
pt: Defina 'M3' ou 'M4', limpe 'M5'
ru: Установите «M3» или «M4», очистите «M5».
tr: 'M3' veya 'M4'ü ayarlayın, 'M5'i temizleyin
zh_cn: 设置“M3”或“M4”，清除“M5”

# CbCoolant.ToolTip
source: Set 'M8', clear 'M9'
ar: اضبط "M8"، امسح "M9"
cs: Nastavit 'M8', vymazat 'M9'
de_de: „M8“ setzen, „M9“ löschen
es: Configure 'M8', borre 'M9'
fr: Définir 'M8', effacer 'M9'
it: Imposta 'M8', cancella 'M9'
ja: 「M8」を設定、「M9」をクリア
pl: Ustaw „M8”, wyczyść „M9”
pt: Defina 'M8', limpe 'M9'
ru: Установите «M8», очистите «M9».
tr: 'M8'i ayarlayın, 'M9'u silin
zh_cn: 设置“M8”，清除“M9”

# gBoxDROSetCoord.Text
source: Set Coordinate System
ar: ضبط نظام الإحداثيات
cs: Nastavit souřadnicový systém
de_de: Koordinatensystem festlegen
es: Establecer sistema de coordenadas
fr: Définir le système de coordonnées
it: Imposta il sistema di coordinate
ja: 座標系の設定
pl: Ustaw układ współrzędnych
pt: Definir sistema de coordenadas
ru: Установить систему координат
tr: Koordinat Sistemini Ayarla
zh_cn: 设置坐标系

# gBoxDRO.Text
source: Tool Coordinates (Work / Machine)
ar: إحداثيات الأداة (العمل / الجهاز)
cs: Souřadnice nástroje (práce / stroj)
de_de: Werkzeugkoordinaten (Arbeit / Maschine)
es: Coordenadas (Trabajo/Máquina)
fr: Coordonnées de l'outil (travail / machine)
it: Coordinate utensile (Lavoro/Macchina)
ja: 工具座標（作業/機械）
pl: Współrzędne narzędzia (praca/maszyna)
pt: Coordenadas da ferramenta (Trabalho / Máquina)
ru: Координаты инструмента (работа / станок)
tr: Takım Koordinatları (İş / Makine)
zh_cn: 工具坐标（工作/机器）

# btnJogZeroXY.Text
source: Move XY=0
cs: Pohyb XY=0
zh_cn: 移动到XY=0

# tBURL.ToolTip
source: Check https://openclipart.org/ for SVG files
pl: Sprawdź pliki SVG na https://openclipart.org/
zh_cn: Check https://openclipart.org/ for SVG 文件

# Rb2DViewMode1.Text
source: Edit figure
ar: تحرير الشكل
cs: Upravit obrázek
de_de: Pfad bearbeiten
es: Editar figura
fr: Modifier la figure
it: Modifica figura
ja: 図形の編集
pl: Edytuj figurę
pt: Editar figura
ru: Редактировать фигуру
tr: Şekli düzenle
zh_cn: 编辑图形
