Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# Rb2DViewMode1.ToolTip
source: Enables the edit mode for the 2DView to edit figures - check context menu on right click
ar: يُفعّل وضع التحرير في العرض ثنائي الأبعاد لتحرير الأشكال - تحقق من قائمة السياق عند النقر بزر الماوس الأيمن.
cs: Povolí režim úprav pro 2DView pro úpravu obrázků - kliknutím pravým tlačítkem zkontrolujte kontextovou nabídku
de_de: Aktiviert den Bearbeitungsmodus für die 2D-Ansicht zum Bearbeiten von Figuren. Kontextmenü bei Rechtsklick.
es: Habilita el modo de edición de la vista 2D para editar figuras. Consulta el menú contextual al hacer clic derecho.
fr: Active le mode édition de la vue 2D pour modifier les figures. Consultez le menu contextuel lors d'un clic droit.
it: Abilita la modalità di modifica per la vista 2D per modificare le figure - seleziona il menu contestuale facendo clic con il pulsante destro del mouse.
ja: 2DView の編集モードを有効にして図形を編集します。右クリックでコンテキストメニューを表示します。
pl: Włącza tryb edycji dla 2DView, aby edytować figury - sprawdź menu kontekstowe po kliknięciu prawym przyciskiem myszy
pt: Ativa o modo de edição para a Visualização 2D para editar figuras - verifique o menu de contexto ao clicar com o botão direito.
ru: Включает режим редактирования для 2DView для редактирования фигур — проверьте контекстное меню при щелчке правой кнопкой мыши
tr: 2DView için şekilleri düzenlemek üzere düzenleme modunu etkinleştirir - sağ tıklamada bağlam menüsünü kontrol edin
zh_cn: 启用 2DView 的编辑模式以编辑图形 - 右键单击​​时检查上下文菜单。

# Rb2DViewMode2.Text
source: Jog to figure pos.
ar: التحريك إلى موضع الشكل.
cs: Jog to figure poz.
de_de: Werkzeug zur markierten Pfadposition bewegen
es: Desplazar a la posición de la figura.
fr: Déplacement vers la position de la figure.
it: Avanzamento a passo sulla figura.
ja: 図形の位置へ移動
pl: Przesuń do pozycji figury
pt: Deslocar para a posição da figura.
ru: Перейти к позиции фигуры
tr: Şekil pozisyonuna doğru ilerle.
zh_cn: 慢速移动到图形位置。

# Rb2DViewMode2.ToolTip
source: Enable jog mode on figure: moves tool to gcode position which is closest to clicked position
ar: تفعيل وضع التحريك على الشكل: يُحرّك الأداة إلى موضع gcode الأقرب إلى موضع النقر.
cs: Povolit režim krokování na obrázku: přesune nástroj do pozice gcode, která je nejblíže pozici, na kterou jste kliknuli
de_de: Jog-Modus für Figur aktivieren: Bewegt das Werkzeug zur G-Code-Position, die der angeklickten Position am nächsten liegt.
es: Habilitar el modo de desplazamiento en la figura: mueve la herramienta a la posición de código G más cercana a la posición donde se hizo clic.
fr: Activer le mode déplacement sur la figure : déplace l'outil vers la position du Gcode la plus proche de la position cliquée.
it: Abilita la modalità di avanzamento a passo sulla figura: sposta lo strumento nella posizione del gcode più vicina alla posizione cliccata.
ja: 図形のジョグモードを有効にすると、クリックした位置に最も近い Gcode 位置にツールが移動します。
pl: Włącz tryb przesuwania na figurze: przesuwa narzędzie do pozycji gcode, która jest najbliższa klikniętej pozycji
pt: Ativar modo de deslocamento na figura: move a ferramenta para a posição do código de barras mais próxima da posição clicada.
ru: Включить режим перемещения на фигуре: перемещает инструмент в позицию gcode, которая ближе всего к нажатой позиции
tr: Şekilde ilerle modunu etkinleştir: aracı tıklanan pozisyona en yakın olan gcode pozisyonuna taşır
zh_cn: 在图形上启用慢速移动模式：将工具移动到最接近点击位置的 Gcode 位置。

# Rb2DViewMode3.Text
source: Jog to clicked pos.
ar: التحريك إلى موضع النقر.
cs: Přejděte na kliknutou pozici.
de_de: Werkzeug zur angeklickten Position bewegen
es: Desplazar a la posición donde se hizo clic.
fr: Déplacement vers la position cliquée.
it: Avanzamento a passo sulla posizione cliccata.
ja: クリックした位置へ移動
pl: Przesuń do klikniętej pozycji.
pt: Deslocar para a posição clicada.
ru: Перейти к нажатой позиции.
tr: Tıklanan pozisyona doğru ilerle.
zh_cn: 慢速移动到点击位置。

# Rb2DViewMode3.ToolTip
source: Enables the jog mode on machine area, moves tool to clicked position. Alt-click rounds position to 0.1 raster,
ar: يُفعّل وضع الركض على منطقة الآلة، ويُحرّك الأداة إلى موضع النقر. يُدوّر النقر مع الضغط على مفتاح Alt الموضع إلى ٠.١ نقطة.
cs: Povolí krokový režim v oblasti stroje, přesune nástroj do klepnuté polohy. Kliknutí se stisknutou klávesou Alt zaokrouhlí pozici na 0,1 rastru,
de_de: Aktiviert den Bewegungdmodus im Maschinenbereich und bewegt das Werkzeug zur angeklickten Position. Alt-Klick rundet die Position auf 0,1 Raster.
es: Habilita el modo de avance en el área de la máquina y mueve la herramienta a la posición seleccionada. Al mantener presionada la tecla Alt, se redondea la posición a un ráster de 0,1.
fr: Abilite la modalitât jog su la aree de machine, al sposte il strument inte posizion clicade. Clic alt al arrotonde la posizion a 0.1 raster,
it: Abilita la modalità jog sull'area macchina, spostando l'utensile nella posizione cliccata. Alt-clic arrotonda la posizione a 0,1 raster.
ja: 機械エリアでジョグモードを有効にし、工具をクリックした位置に移動します。 Altキーを押しながらクリックすると、位置が0.1ラスターに丸められます。
pl: Włącza tryb przesuwania w obszarze maszyny, przesuwa narzędzie do klikniętej pozycji. Alt-klik zaokrągla pozycję do rastra 0,1,
pt: Habilita o modo de deslocamento na área da máquina, move a ferramenta para a posição clicada. A tecla Alt-clique arredonda a posição para 0,1 raster.
ru: Включает режим толчковой подачи на участке машины, перемещает инструмент в позицию щелчка. Alt-щелчок округляет позицию до 0,1 растра,
tr: Makine alanında jog modunu etkinleştirir, aracı tıklanan konuma taşır. Alt-tıklama konumu 0,1 rastere yuvarlar,
zh_cn: 在机器区域启用慢进模式，将工具移动到点击位置。 按住 Alt 键并点击可将位置四舍五入到 0.1 个光栅，

# cmsPicBoxMoveGraphicsOrigin.ToolTipText
source: Applies an offset to all G-Code coordinates, so that the Marker position will get coordinate 0;0.
ar: يُطبّق إزاحة على جميع إحداثيات G-Code، بحيث يصبح موضع العلامة إحداثيًا ٠:٠.
cs: Použije posun na všechny souřadnice G-kódu, takže poloha značky bude mít souřadnice 0;0.
de_de: Wendet einen Offset auf alle G-Code-Koordinaten an, sodass die Markerposition die Koordinate 0;0 erhält.
es: Aplica un desplazamiento a todas las coordenadas del código G, de modo que la posición del marcador se corresponda con la coordenada 0;0.
fr: Applique un décalage à toutes les coordonnées du code G, de sorte que la position du marqueur obtienne la coordonnée 0;0.
it: Applica un offset a tutte le coordinate del G-Code, in modo che la posizione del marcatore ottenga la coordinata 0;0.
ja: すべての G コード座標にオフセットを適用し、マーカー位置が座標 0;0 になるようにします。
pl: Zastosowuje przesunięcie do wszystkich współrzędnych kodu G, tak aby pozycja znacznika uzyskała współrzędną 0;0.
pt: Aplica um deslocamento a todas as coordenadas do código G, de modo que a posição do marcador obtenha a coordenada 0;0.
ru: Применяет смещение ко всем координатам G-кода, так что положение маркера получит координату 0;0.
tr: Tüm G-Kodu koordinatlarına bir ofset uygular, böylece İşaretleyici konumu 0;0 koordinatını alır.
zh_cn: 对所有 G 代码坐标应用偏移，使标记位置获得坐标 0;0。

# cmsPicBoxMoveGraphicsOriginTo00.Text
source: Offset graphics -> Marker pos. to (last) tool pos.
ar: إزاحة الرسومات -> موضع العلامة إلى موضع الأداة (الأخير).
cs: Offsetová grafika -> Poz. značky. do (poslední) pozice nástroje.
de_de: Grafik-Offset -> Markerposition auf (letzte) Werkzeugposition
es: Gráficos de desplazamiento -> Posición del marcador a la (última) posición de la herramienta
fr: Décalage graphique -> Position du marqueur à la (dernière) position de l'outil
it: Offset grafico -> Posizione marcatore all'ultima posizione utensile
ja: グラフィックスのオフセット -> マーカー位置を（最後の）ツール位置に
pl: Przesunięcie grafiki -> Poz. znacznika do (ostatniego) położenia narzędzia.
pt: Deslocamento de gráficos -> Posição do marcador para a (última) posição da ferramenta.
ru: Смещение графики -> Положение маркера на (последнюю) позицию инструмента.
tr: Ofset grafikleri -> İşaretleyici konumu (son) araç konumu.
zh_cn: 偏移图形 -> 标记位置至（最后一个）工具位置。

# cmsPicBoxMoveGraphicsOriginTo00.ToolTipText
source: Applies an offset to all G-Code coordinates, so that the Marker position will get the actual tool coordinate.
ar: يُطبّق إزاحة على جميع إحداثيات G-Code، بحيث يصبح موضع العلامة إحداثيًا للأداة.
cs: Použije offset na všechny souřadnice G-kódu, takže poloha značky získá skutečné souřadnice nástroje.
de_de: Wendet einen Offset auf alle G-Code-Koordinaten an, sodass die Markerposition die tatsächliche Werkzeugkoordinate erhält.
es: Aplica un desplazamiento a todas las coordenadas del código G, de modo que la posición del marcador se corresponda con la coordenada real de la herramienta.
fr: Applique un décalage à toutes les coordonnées du code G, de sorte que la position du marqueur obtienne la coordonnée réelle de l'outil.
it: Applica un offset a tutte le coordinate del G-Code, in modo che la posizione del marcatore ottenga la coordinata effettiva dell'utensile.
ja: すべての G コード座標にオフセットを適用し、マーカー位置が実際のツール座標になるようにします。
pl: Zastosowuje przesunięcie do wszystkich współrzędnych kodu G, tak aby pozycja znacznika uzyskała rzeczywistą współrzędną narzędzia.
pt: Aplica um deslocamento a todas as coordenadas do código G, de modo que a posição do marcador obtenha a coordenada real da ferramenta.
ru: Применяет смещение ко всем координатам G-кода, так что положение маркера получит фактическую координату инструмента.
tr: Tüm G-Kodu koordinatlarına bir ofset uygular, böylece İşaretleyici konumu gerçek araç koordinatını alır.
zh_cn: 对所有 G 代码坐标应用偏移，使标记位置获得实际工具坐标。

# useOrigin.Text
source: Use origin 0;0
ar: استخدم الأصل 0؛0
cs: Použít počátek 0;0
de_de: Ursprung 0;0 verwenden
es: Usar origen 0;0
fr: Utiliser l'origine 0;0
it: Usa origine 0;0
ja: 原点 0;0 を使用
pl: Użyj punktu początkowego 0;0
pt: Use a origem 0;0
ru: Использовать начало координат 0;0
tr: Kökeni 0;0 kullanın
zh_cn: 使用原点 0;0

# useOrigin.ToolTipText
source: Use 0;0 work coordinate as center for mirroring, rotation, and scaling
ar: استخدم إحداثيات العمل 0؛0 كمركز للانعكاس والدوران والتغيير في الحجم
cs: Použijte pracovní souřadnici 0;0 jako střed pro zrcadlení, otáčení a změnu měřítka
de_de: Arbeitskoordinate 0;0 als Mittelpunkt für Spiegelung, Drehung und Skalierung verwenden
es: Usar la coordenada de trabajo 0;0 como centro para la duplicación, rotación y escalado.
fr: Utiliser la coordonnée de travail 0;0 comme centre pour la mise en miroir, la rotation et la mise à l'échelle
it: Usa la coordinata di lavoro 0;0 come centro per specchiatura, rotazione e ridimensionamento
ja: ミラーリング、回転、スケーリングの中心として 0;0 作業座標を使用します
pl: Użyj współrzędnej roboczej 0;0 jako środka do odbicia lustrzanego, obrotu i skalowania
pt: Use a coordenada de trabalho 0;0 como centro para espelhamento, rotação e dimensionamento.
ru: Использовать рабочую координату 0;0 как центр для зеркального отображения, вращения и масштабирования
tr: Yansıtma, döndürme ve ölçekleme için merkez olarak 0;0 çalışma koordinatını kullanın
zh_cn: 使用 0;0 工作坐标作为镜像、旋转和缩放的中心

# toolStrip_RadiusComp.ToolTipText
source: Radius compensation
ar: تعويض نصف القطر
cs: Kompenzace poloměru
de_de: Radiuskompensation
es: Compensación de radio
fr: Compensation de rayon
it: Compensazione del raggio
ja: 半径補正
pl: Kompensacja promienia
pt: Compensação de raio
ru: Компенсация радиуса
tr: Yarıçap telafisi
zh_cn: 半径补偿

# cms2ToolStripMenuItem.Text
source: Offset graphics -> Marker pos. to 0;0
ar: إزاحة الرسومات ← موضع العلامة إلى ٠:٠
cs: Grafika odsazení -> Pozice značky na 0;0
de_de: Grafik-Offset -> Markerposition auf 0;0
es: Desplazamiento gráfico -> Posición del marcador a 0;0
fr: Décalage graphique -> Position du marqueur à 0;0
it: Offset grafico -> Posizione marcatore a 0;0
ja: グラフィックのオフセット -> マーカー位置を 0;0 に
pl: Przesunięcie grafiki -> Poz. znacznika do 0;0
pt: Deslocamento de gráficos -> Posição do marcador para 0;0
ru: Смещение графики -> Положение маркера на 0;0
tr: Ofset grafikleri -> İşaretleyici konumu 0;0'a
zh_cn: 将图形偏移 -> 标记位置偏移至 0;0

# cms2ToolStripMenuItem.ToolTipText
source: Apply an offset to all G-Code coordinates, so that the Marker position will get coordinate 0;0.
ar: طبّق إزاحة على جميع إحداثيات G-Code، بحيث يصبح موضع العلامة إحداثيًا ٠:٠.
cs: Použijte odsazení na všechny souřadnice G-kódu, aby pozice značky získala souřadnici 0;0.
de_de: Verschiebt alle G-Code-Koordinaten, sodass die Markerposition die Koordinate 0;0 erhält.
es: Aplica un desplazamiento a todas las coordenadas del código G para que la posición del marcador tenga la coordenada 0;0.
fr: Appliquer un décalage à toutes les coordonnées du G-Code, afin que la position du marqueur obtienne les coordonnées 0;0.
it: Applica un offset a tutte le coordinate del G-Code, in modo che la posizione del marcatore ottenga la coordinata 0;0.
ja: すべての G コード座標にオフセットを適用し、マーカー位置が座標 0;0 になるようにします。
pl: Zastosuj przesunięcie do wszystkich współrzędnych kodu G, tak aby pozycja znacznika otrzymała współrzędną 0;0.
pt: Aplique um deslocamento a todas as coordenadas do G-Code, para que a posição do marcador obtenha a coordenada 0;0.
ru: Применить смещение ко всем координатам G-кода, так что положение маркера получит координату 0;0.
tr: Tüm G-Kodu koordinatlarına bir ofset uygulayın, böylece İşaretleyici konumu 0;0 koordinatını alır.
zh_cn: 对所有 G 代码坐标应用偏移，使标记位置获得坐标 0;0。

# offsetGraphicsMarkerPositionTolastToolPositionToolStripMenuItem.Text
source: Offset graphics -> Marker pos. to (last) tool pos.
ar: إزاحة الرسومات ← موضع العلامة إلى موضع الأداة (الأخير).
cs: Grafika odsazení -> Pozice značky na (poslední) pozici nástroje.
de_de: Grafik-Offset -> Markerposition auf (letzte) Werkzeugposition
es: Desplazamiento gráfico -> Posición del marcador a la (última) posición de la herramienta
fr: Décalage graphique -> Position du marqueur à la (dernière) position de l'outil
it: Offset grafico -> Posizione marcatore all'ultima posizione utensile
ja: グラフィックのオフセット -> マーカー位置を（最後の）ツール位置に
pl: Przesunięcie grafiki -> Poz. znacznika do (ostatniego) położenia narzędzia.
pt: Deslocamento de gráficos -> Posição do marcador para a (última) posição da ferramenta.
ru: Смещение графики -> Положение маркера на (последнюю) позицию инструмента.
tr: Ofset grafikleri -> İşaretleyici konumu (son) araç konumu.
zh_cn: 将图形偏移 -> 标记位置偏移至（最后一个）工具位置。

# offsetGraphicsMarkerPositionTolastToolPositionToolStripMenuItem.ToolTipText
source: Apply an offset to all G-Code coordinates, so that the Marker position will get the actual tool coordinate.
ar: طبّق إزاحة على جميع إحداثيات G-Code، بحيث يصبح موضع العلامة إحداثيًا للأداة.
cs: Použijte odsazení na všechny souřadnice G-kódu, aby pozice značky získala skutečnou souřadnici nástroje.
de_de: Verschiebt alle G-Code-Koordinaten, sodass die Markerposition die tatsächliche Werkzeugkoordinate erhält.
es: Aplica un desplazamiento a todas las coordenadas del código G para que la posición del marcador tenga la coordenada real de la herramienta.
fr: Appliquer un décalage à toutes les coordonnées du G-Code, afin que la position du marqueur obtienne les coordonnées réelles de l'outil.
it: Applica un offset a tutte le coordinate del G-Code, in modo che la posizione del marcatore ottenga la coordinata effettiva dell'utensile.
ja: すべての G コード座標にオフセットを適用し、マーカー位置が実際のツール座標になるようにします。
pl: Zastosuj przesunięcie do wszystkich współrzędnych kodu G, tak aby pozycja znacznika otrzymała rzeczywistą współrzędną narzędzia.
pt: Aplique um deslocamento a todas as coordenadas do G-Code, para que a posição do marcador obtenha a coordenada real da ferramenta.
ru: Применить смещение ко всем координатам G-кода, так что положение маркера получит фактическую координату инструмента.
tr: Tüm G-Kodu koordinatlarına bir ofset uygulayın, böylece İşaretleyici konumu gerçek araç koordinatını alır.
zh_cn: 对所有 G 代码坐标应用偏移，使标记位置获得实际工具坐标。

# moveBetweenLastPositionsToolStripMenuItem.Text
source: Move between last positions
ar: التنقل بين المواضع الأخيرة
cs: Pohyb mezi posledními pozicemi
de_de: Wechselt zwischen den letzten Positionen
es: Moverse entre las últimas posiciones
fr: Déplacement entre les dernières positions
it: Spostamento tra le ultime posizioni
ja: 最後の位置間を移動します
pl: Przesuń między ostatnimi pozycjami
pt: Movimentação entre as últimas posições
ru: Перемещение между последними позициями
tr: Son konumlar arasında hareket edin
zh_cn: 在最后位置之间移动

# directControlToolStripMenuItem.Text
source: Graphic tablet
ar: قرص الرسم
cs: Grafický tablet
de_de: Grafiktablett
es: Tableta grafica
fr: Peinture au stylet
it: Tavoletta grafica
ja: グラフィックタブレット
pl: Tablet graficzny
pt: Mesa digitalizadora
ru: Графический планшет
tr: Grafik tablet
zh_cn: 图形输入板

# logToolStripMenuItem.Text
source: Log
it: Tronco d'albero
tr: Kayıt

# cBMoveG0.Text
source: use G0
cs: použijte G0
it: usa G0
