Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# btnSimulateFaster.ToolTip
source: Double simulation speed
ar: سرعة محاكاة مزدوجة
cs: Dvojitá rychlost simulace
de_de: Doppelte Simulationsgeschwindigkeit
es: Doble velocidad de simulación
fr: Double vitesse de simulation
it: Doppia velocità di simulazione
ja: ダブルシミュレーション速度
pl: Podwójna prędkość symulacji
pt: Velocidade de simulação dupla
ru: Двойная скорость симуляции
tr: Çift simülasyon hızı
zh_cn: 双倍仿真速度

# btnSimulate.Text
source: Start path simulation
ar: بدء محاكاة المسار
cs: Spusťte simulaci cesty
de_de: Streckensimulation starten
es: Iniciar simulación de ruta
fr: Lancer la simulation de trajectoire
it: Avvia la simulazione del percorso
ja: パスシミュレーションを開始
pl: Rozpocznij symulację
pt: Iniciar simulação de caminho
ru: Начать симуляцию пути
tr: Yol simülasyonunu başlat
zh_cn: 开始路径模拟

# gBOverrideSSGB.Text
source: Spindle Speed
ar: سرعة المغزل
cs: Rychlost vřetena
de_de: Drehzahl
es: Revoluciones
fr: Revolutions
it: Velocità del mandrino
ja: 主軸速度
pl: Prędkość wrzeciona
pt: Velocidade do eixo
ru: скорость вращения шпинделя
tr: Mil Hızı
zh_cn: 主轴转速

# btnJogZeroA.ToolTip
source: Send G90 G0 A(or B,C)0
ar: أرسل G90 G0 A (أو B ، C) 0
cs: Pošlete G90 G0 A(nebo B,C)0
de_de: Sende G90 G0 A(or B,C)0
es: Enviar G90 G0 A (o B, C) 0
fr: Envoyer G90 G0 A (ou B, C) 0
it: Invia G90 G0 A(o B,C)0
ja: G90 G0 A（またはB、C）0を送信
pl: Wyślij G90 G0 A (lub B,C) 0
pt: Enviar G90 G0 A (ou B, C) 0
ru: Отправить G90 G0 A (или B, C) 0
tr: G90 G0 A(veya B,C)0 gönder
zh_cn: 发送G90 G0 A（或B，C）0

# btnJogZeroX.ToolTip
source: Send G90 G0 X0
ar: أرسل G90 G0 X0
cs: Pošlete G90 G0 X0
de_de: Sende G90 G0 X0
es: Enviar G90 G0 X0
fr: Envoyer G90 G0 X0
it: Invia G90 G0 X0
ja: G90 G0 X0を送信
pl: Wyślij G90 G0 X0
pt: Enviar G90 G0 X0
ru: Отправить G90 G0 X0
tr: G90 G0 X0 gönder
zh_cn: 发送G90 G0 X0

# btnJogZeroXY.ToolTip
source: Send G90 G0 X0 Y0
ar: أرسل G90 G0 X0 Y0
cs: Pošlete G90 G0 X0 Y0
de_de: Sende G90 G0 X0 Y0
es: Enviar G90 G0 X0 Y0
fr: Envoyer G90 G0 X0 Y0
it: Invia G90 G0 X0 Y0
ja: G90 G0 X0 Y0を送信
pl: Wyślij G90 G0 X0 Y0
pt: Enviar G90 G0 X0 Y0
ru: Отправить G90 G0 X0 Y0
tr: G90 G0 X0 Y0 gönder
zh_cn: 发送G90 G0 X0 Y0

# btnJogZeroY.ToolTip
source: Send G90 G0 Y0
ar: أرسل G90 G0 Y0
cs: Pošlete G90 G0 Y0
de_de: Sende G90 G0 Y0
es: Enviar G90 G0 Y0
fr: Envoyer G90 G0 Y0
it: Invia G90 G0 Y0
ja: G90 G0 Y0を送信
pl: Wyślij G90 G0 Y0
pt: Enviar G90 G0 Y0
ru: Отправить G90 G0 Y0
tr: G90 G0 Y0 gönder
zh_cn: 发送G90 G0 Y0

# btnJogZeroZ.ToolTip
source: Send G90 G0 Z0
ar: أرسل G90 G0 Z0
cs: Pošlete G90 G0 Z0
de_de: Sende G90 G0 Z0
es: Enviar G90 G0 Z0
fr: Envoyer G90 G0 Z0
it: Invia G90 G0 Z0
ja: G90 G0 Z0を送信
pl: Wyślij G90 G0 Z0
pt: Enviar G90 G0 Z0
ru: Отправить G90 G0 Z0
tr: G90 G0 Z0 gönder
zh_cn: 发送G90 G0 Z0

# btnHome.Text
source: Home
ar: الصفحة الرئيسية
cs: Domov
ja: ホーム
ru: Дом (аппаратный 0)
tr: Ev
zh_cn: 回零

# label13.Text
source: Set:
ar: جلس:
cs: Soubor:
ja: セット：
zh_cn: 设置：

# btnOverrideSpindle.Text
source: Spindle CW
ar: المغزل CW
cs: Vřeteno CW
it: Mandrino in senso orario
ja: スピンドルCW
pl: Wrzeciono CW
tr: Mil CW
zh_cn: 主轴顺时针切削

# btnOverrideMist.Text
source: Mist
ar: ضباب
cs: Mlha
it: Nebbia
ja: ミスト
zh_cn: 雾状冷却液

# btnOverrideFlood.Text
source: Flood
ar: فيضان
cs: Zaplavit
it: Alluvione
ja: 洪水
zh_cn: 冷却液

# label5.Text
source: Set:
ar: جلس:
cs: Soubor:
ja: セット：
zh_cn: 设置：

# label8.Text
source: Set:
ar: جلس:
cs: Soubor:
ja: セット：
zh_cn: 当前：

# toolStripViewDimension.Text
source: G-Code Dimension
ar: البعد G- كود
cs: Rozměr G-kódu
de_de: G-Code Dimensionen
es: Dimensión del código G
fr: Dimension G-Code
it: Dimensione codice G
ja: Gコード寸法
pl: Wymiar G-Code
pt: Dimensão do código G
ru: Размер G-кода
tr: G Kodu Boyutu
zh_cn: G代码尺寸(加工区域最大范围)

# startExtensionToolStripMenuItem.Text
source: Extensions
ar: ملحقات
cs: Rozšíření
de_de: Erweiterungen
es: Extensiones
it: Estensioni
ja: 拡張機能
pl: Rozszerzenia
pt: Extensões
ru: расширения
tr: Uzantılar
zh_cn: 扩展名

# cmsEditMode.Text
source: Toggle Edit Mode
ar: تبديل وضع التحرير
cs: Přepnout režim úprav
de_de: Bearbeitungsmodus umschalten
es: Alternar modo de edición
fr: Basculer le mode d'édition
it: Attiva/disattiva la modalità di modifica
ja: 編集モードを切り替え
pl: Przełącz tryb edycji
pt: Alternar modo de edição
ru: Переключить режим редактирования
tr: Düzenleme Modunu Değiştir
zh_cn: 切换到编辑模式

# cmsPicBoxMoveToMarkedPosition.Text
source: Move to marked position G0
ar: الانتقال إلى الموضع المميز G0
cs: Přesuňte se na označenou pozici G0
de_de: Zur markierten Position mit G0 fahren
es: Mover a la posición marcada G0
fr: Déplacer vers la position marquée G0
it: Spostarsi nella posizione contrassegnata G0
ja: マークされた位置に移動G0
pl: Przejście do zaznaczonej pozycji G0
pt: Mover para a posição marcada G0
ru: Переместиться в отмеченную позицию G0
tr: G0 işaretli konuma git
zh_cn: 使用G0移至标记的位置

# cmsPicBoxZeroXYAtMarkedPosition.Text
source: Zero XY work-pos at marked position G10 L20
ar: صفر XY في الموضع المميز G10 L20
cs: Nula XY na označené pozici G10 L20
de_de: Null XY an der markierten Position G10 L20
es: Cero XY en la posición marcada G10 L20
fr: Zéro XY à la position marquée G10 L20
it: Zero XY alla posizione contrassegnata G10 L20
ja: マーク位置G10 L20のゼロXY
pl: Zerowanie XY w zaznaczonym miejscu G10 L20
pt: Zero XY na posição marcada G10 L20
ru: Ноль XY в отмеченной позиции G10 L20
tr: İşaretli konumda sıfır XY G10 L20
zh_cn: 在标记位置G10 L20处清零XY

# cmsPicBoxMoveGraphicsOrigin.Text
source: Offset graphics -> Marker pos. to 0;0
ar: إزاحة الرسومات -> موضع العلامة إلى ٠:٠
cs: Offsetová grafika -> Poz. značky. na 0;0
de_de: Grafik-Offset -> Markerposition auf 0;0
es: Gráficos de desplazamiento -> Posición del marcador a 0;0
fr: Décalage graphique -> Position du marqueur à 0;0
it: Offset grafico -> Posizione marcatore a 0;0
ja: グラフィックスのオフセット -> マーカー位置を 0;0 に
pl: Przesunięcie grafiki -> Poz. znacznika do 0;0
pt: Deslocamento de gráficos -> Posição do marcador para 0;0
ru: Смещение графики -> Положение маркера на 0;0
tr: Ofset grafikleri -> İşaretleyici konumu 0;0'a
zh_cn: 偏移图形 -> 标记位置至 0;0

# cmsPicBoxResetZooming.Text
source: Reset Zooming
ar: إعادة تعيين التكبير
cs: Obnovit přiblížení
de_de: Zoomen zurücksetzen
es: Restablecer zoom
fr: Réinitialiser le zoom
it: Reimposta zoom
ja: ズームをリセット
pl: Resetuj powiększanie
pt: Redefinir o zoom
ru: Сброс масштабирования
tr: Yakınlaştırmayı Sıfırla
zh_cn: 重置缩放

# cmsPicBoxPasteFromClipboard.Text
source: Paste from Clipboard
ar: لصق من الحافظة
cs: Vložit ze schránky
de_de: Einfügen aus der Zwischenablage
es: Pegar desde el portapapeles
fr: Coller depuis le presse-papiers
it: Incolla dagli Appunti
ja: クリップボードから貼り付け
pl: Wklej ze schowka
pt: Colar da área de transferência
ru: Вставить из буфера обмена
tr: Panodan Yapıştır
zh_cn: 从剪贴板粘贴

# cmsPicBoxReloadFile.Text
source: Reload File
ar: إعادة تحميل الملف
cs: Znovu načíst soubor
de_de: Datei neu laden
es: Recargar archivo
fr: Recharger le fichier
it: Ricarica file
ja: ファイルを再読み込み
pl: Przeładuj plik
pt: Recarregar arquivo
ru: Перезагрузить файл
tr: Dosyayı Yeniden Yükle
zh_cn: 重新载入文件

# cmsPicBoxMarkFirstPos.Text
source: Mark first point of selected path
ar: ضع علامة على النقطة الأولى من المسار المحدد
cs: Označte první bod vybrané cesty
de_de: Markiert den ersten Punkt des ausgewählten Pfads
es: Marcar el primer punto de la ruta seleccionada
fr: Marquer le premier point du chemin sélectionné
it: Segna il primo punto del percorso selezionato
ja: 選択したパスの最初のポイントをマーク
pl: Zaznacz pierwszy punkt wybranej ścieżki
pt: Marcar o primeiro ponto do caminho selecionado
ru: Отметить первую точку выбранного пути
tr: Seçilen yolun ilk noktasını işaretle
zh_cn: 标记所选路径的第一点

# cmsPicBoxDeletePath.Text
source: Delete selected path
ar: حذف المسار المحدد
cs: Smazat vybranou cestu
de_de: Ausgewählten Pfad löschen
es: Eliminar ruta seleccionada
fr: Supprimer le chemin sélectionné
it: Elimina il percorso selezionato
ja: 選択したパスを削除
pl: Usuń wybraną scieżkę
pt: Excluir caminho selecionado
ru: Удалить выбранный путь
tr: Seçilen yolu sil
zh_cn: 删除所选路径

# cmsPicBoxDeletePath.ToolTipText
source: Delete selected figure or group
ar: حذف المسار المحدد
cs: Smazat vybranou cestu
de_de: Ausgewählten Pfad löschen
es: Eliminar ruta seleccionada
fr: Supprimer le chemin sélectionné
it: Elimina la figura o il gruppo selezionato
ja: 選択したパスを削除
pl: Usuń wybraną figurę lub grupę
pt: Excluir caminho selecionado
ru: Удалить выбранный путь
tr: Seçilen şekli veya grubu sil
zh_cn: 删除选中的图或组

# cmsPicBoxCropSelectedPath.Text
source: Crop selected path (cut out)
ar: قطع المسار المحدد
cs: Oříznout vybranou cestu (vyříznout)
de_de: Ausgewählten Pfad freistellen
es: Cortar la ruta seleccionada
fr: Découpez le chemin sélectionné
it: Ritaglia il percorso selezionato (ritaglia)
ja: 選択したパスを切り取ります
pl: Kadruj wybraną ścieżkę (wycinaj)
pt: Recorte o caminho selecionado
ru: Вырезать выбранный путь
tr: Seçilen yolu kırp (kesip çıkar)
zh_cn: 剪切选定路径（剪切）

# cmsPicBoxMoveSelectedPathInCode.Text
source: Apply offset to GCode
ar: تطبيق الإزاحة على GCode
cs: Použít offset na GCode
de_de: Versatz auf GCode anwenden
es: Aplicar desplazamiento a GCode
fr: Appliquer un décalage à GCode
it: Applica offset a GCode
ja: GCodeにオフセットを適用する
pl: Zastosuj offset do G-Code
pt: Aplicar deslocamento ao GCode
ru: Применить смещение к GCode
tr: GCode'a ofset uygula
zh_cn: 将偏移量应用于GCode

# cmsPicBoxSetGCodeAsBackground.Text
source: Set G-Code as Background
ar: قم بتعيين G-Code كخلفية
cs: Nastavte G-Code jako pozadí
de_de: Stellt den G-Code im Hintergrund dar
es: Establecer código G como fondo
fr: Définir le G-Code comme arrière-plan
it: Imposta il codice G come sfondo
ja: 背景としてGコードを設定
pl: Ustaw G-Code jako tło
pt: Definir código G como plano de fundo
ru: Установить G-код в качестве фона
tr: G-Code'u Arka Plan Olarak Ayarla
zh_cn: 将G代码设置为背景

# cmsPicBoxClearBackground.Text
source: Clear Background
ar: خلفية واضحة
cs: Jasné pozadí
de_de: Hintergrund löschen
es: Fondo claro
fr: Fond clair
it: Sfondo chiaro
ja: クリアな背景
pl: Wyczyść tło
pt: Fundo claro
ru: Очистить фон
tr: Arka Planı Temizle
zh_cn: 清除背景

# unDo3ToolStripMenuItem.Text
source: Undo last action
ar: التراجع عن الإجراء الأخير
cs: Vrátit zpět poslední akci
de_de: Letzte Aktion rückgängig machen
es: Deshacer la última acción
fr: Annuler la dernière action
it: Annulla l'ultima azione
ja: 最後のアクションを元に戻す
pl: Cofnij ostatnią akcję
pt: Desfazer a última ação
ru: Отменить последнее действие
tr: Son işlemi geri al
zh_cn: 撤消上一个动作

# cmsEditorHotkeys.AccessibleDescription
source: Show window with default hot-keys for the "Fast Colored Text Box"
ar: إظهار النافذة باستخدام مفاتيح التشغيل السريع الافتراضية لـ "مربع نص ملون سريع"
cs: Zobrazit okno s výchozími horkými klávesami pro "Rychle barevné textové pole"
de_de: Fenster mit Standard-Hotkeys für das "Fast Coloured Text Box" anzeigen
es: Mostrar ventana con teclas de acceso rápido predeterminadas para el "Cuadro de texto de color rápido"
fr: Afficher la fenêtre avec les raccourcis clavier par défaut pour la "zone de texte colorée rapide"
it: Mostra la finestra con i tasti di scelta rapida predefiniti per la "Casella di testo colorata veloce"
ja: 「高速カラーテキストボックス」のデフォルトのホットキーでウィンドウを表示する
pl: Pokaż okno z domyślnymi klawiszami skrótu dla "Szybkiego kolorowego pola tekstowego"
pt: Mostrar janela com teclas de atalho padrão para a "Caixa de texto colorida rápida"
ru: Показать окно с горячими клавишами по умолчанию для «быстрого цветного текстового поля»
tr: "Hızlı Renkli Metin Kutusu" için varsayılan kısayol tuşlarına sahip pencereyi göster
zh_cn: 显示窗口，带有“快速彩色文本框”的默认热键

# cmsCodeBlocksFold.AccessibleDescription
source: Code Blocks are G-Code surrounded by XML-Elements like "Group" of "Figure"
ar: كتل التعليمات البرمجية هي G- كود محاطة بعناصر XML مثل "مجموعة" من "الشكل"
cs: Kódové bloky jsou G-kód obklopený prvky XML, jako je „Skupina“ nebo „Obrázek“
de_de: Codeblöcke sind G-Code, umgeben von XML-Elementen wie "Gruppe" von "Abbildung"
es: Los bloques de código son código G rodeados de elementos XML como "Grupo" de "Figura"
fr: Les blocs de code sont du code G entouré d'éléments XML tels que "Groupe" de "Figure"
it: I blocchi di codice sono codici G circondati da elementi XML come "Gruppo" o "Figura"
ja: コードブロックは、「図」の「グループ」のようなXML要素で囲まれたGコードです。
pl: Bloki kodu G-Code są otoczone przez elementy XML, jak "Group", czy "Figure"
pt: Blocos de código são código G cercados por elementos XML como "Grupo" de "Figura"
ru: Блоки кода представляют собой G-код, окруженный XML-элементами, такими как «Группа» или «Рисунок».
tr: Kod Blokları, "Şekil" veya "Grup" gibi XML Öğeleri ile çevrelenmiş G Kodudur
zh_cn: 代码块是G代码，周围是XML元素，例如“ Figure”的“ Group”

# cmsCodeBlocksFold.Text
source: Fold Code Blocks
ar: أضعاف كتل رمز
cs: Skládací bloky kódu
de_de: Codeblöcke falten
es: Bloques de código plegado
fr: Plier les blocs de code
it: Piega i blocchi di codice
ja: コードブロックの折りたたみ
pl: Składanie bloków kodu
pt: Dobrar blocos de código
ru: Сложите кодовые блоки
tr: Kod Bloklarını Katla
zh_cn: 折叠代码块

# cmsCodeBlocksMove.AccessibleDescription
source: Code Blocks are G-Code surrounded by XML-Elements like "Group" of "Figure"
ar: كتل التعليمات البرمجية هي G- كود محاطة بعناصر XML مثل "مجموعة" من "الشكل"
cs: Kódové bloky jsou G-kód obklopený prvky XML, jako je „Skupina“ nebo „Obrázek“
de_de: Codeblöcke sind G-Code, umgeben von XML-Elementen wie "Gruppe" von "Abbildung"
es: Los bloques de código son código G rodeados de elementos XML como "Grupo" de "Figura"
fr: Les blocs de code sont du code G entouré d'éléments XML tels que "Groupe" de "Figure"
it: I blocchi di codice sono codici G circondati da elementi XML come "Gruppo" o "Figura"
ja: コードブロックは、「図」の「グループ」のようなXML要素で囲まれたGコードです。
pl: Bloki kodu G-Code są otoczone przez elementy XML, jak "Group", czy "Figure"
pt: Blocos de código são código G cercados por elementos XML como "Grupo" de "Figura"
ru: Блоки кода представляют собой G-код, окруженный XML-элементами, такими как «Группа» или «Рисунок».
tr: Kod Blokları, "Şekil" veya "Grup" gibi XML Öğeleri ile çevrelenmiş G Kodudur
zh_cn: 代码块是G代码，周围是XML元素，例如“ Figure”的“ Group”

# cmsFCTBMoveSelectedCodeBlockMostUp.Text
source: Move selected code block most up
ar: نقل كتلة التعليمات البرمجية المحددة لأعلى
cs: Přesuňte vybraný blok kódu nejvíce nahoru
de_de: Verschieben des ausgewählten Codeblock am weitesten nach oben
es: Mover el bloque de código seleccionado más arriba
fr: Déplacer le bloc de code sélectionné vers le haut
it: Sposta il blocco di codice selezionato più in alto
ja: 選択したコードブロックを一番上に移動
pl: Przesuń wybrany blok kodu na samą górę
pt: Mover o bloco de código selecionado mais para cima
ru: Переместить выбранный блок кода вверх
tr: Seçili kod bloğunu en yukarı taşı
zh_cn: 将所选代码块移至最上

# cmsFCTBMoveSelectedCodeBlockUp.Text
source: Move selected code block up
ar: نقل كتلة الرمز المحدد لأعلى
cs: Přesuňte vybraný blok kódu nahoru
de_de: Verschieben des ausgewählten Codeblock nach oben
es: Mover el bloque de código seleccionado hacia arriba
fr: Déplacer le bloc de code sélectionné vers le haut
it: Sposta in alto il blocco di codice selezionato
ja: 選択したコードブロックを上に移動
pl: Przesuń wybrany blok kodu do góry
pt: Mover o bloco de código selecionado para cima
ru: Переместить выбранный блок кода вверх
tr: Seçili kod bloğunu yukarı taşı
zh_cn: 向上移动所选代码块

# cmsFCTBMoveSelectedCodeBlockDown.Text
source: Move selected code block down
ar: نقل كتلة الرمز المحدد لأسفل
cs: Posuňte vybraný blok kódu dolů
de_de: Verschieben des ausgewählten Codeblock nach unten
es: Mover el bloque de código seleccionado hacia abajo
fr: Déplacer le bloc de code sélectionné vers le bas
it: Sposta il blocco di codice selezionato verso il basso
ja: 選択したコードブロックを下に移動
pl: Przesuń wybrany brok kodu w dół
pt: Mover o bloco de código selecionado para baixo
ru: Переместить выделенный блок кода вниз
tr: Seçili kod bloğunu aşağı taşı
zh_cn: 向下移动所选代码块

# cmsFCTBMoveSelectedCodeBlockMostDown.Text
source: Move selected code block most down
ar: نقل كتلة التعليمات البرمجية المحددة لأسفل
cs: Posuňte vybraný blok kódu nejvíce dolů
de_de: Verschieben des ausgewählten Codeblock am weitesten nach unten
es: Mueve el bloque de código seleccionado más abajo
fr: Déplacer le bloc de code sélectionné vers le bas
it: Sposta il blocco di codice selezionato più in basso
ja: 選択したコードブロックを一番下に移動
pl: Przesuń wybrany blok kodu na sam dół
pt: Mover o bloco de código selecionado mais para baixo
ru: Переместить выделенный блок кода вниз
tr: Seçili kod bloğunu en aşağı taşı
zh_cn: 将所选代码块移至最下

# cmsCodeBlocksMove.Text
source: Move Code Blocks
ar: نقل كتل التعليمات البرمجية
cs: Přesunout bloky kódu
de_de: Codeblöcke verschieben
es: Mover bloques de código
fr: Déplacer des blocs de code
it: Sposta blocchi di codice
ja: コードブロックの移動
pl: Przesuń bloki kodu
pt: Mover blocos de código
ru: Переместить блоки кода
tr: Kod Bloklarını Taşı
zh_cn: 移动代码块

# cmsCodeBlocksSortReverse.Text
source: Reverse sort order
ar: ترتيب فرز عكسي
cs: Opačné pořadí řazení
de_de: Sortierreihenfolge umkehren
es: Orden inverso
fr: Ordre de tri inversé
it: Ordinamento inverso
ja: 並べ替え順序を逆にする
pl: Odwróć sortowanie
pt: Ordem de classificação inversa
ru: Обратный порядок сортировки
tr: Ters sıralama düzeni
zh_cn: 反向排序

# cmsCodeBlocksSortById.Text
source: Sort by 'Id'
ar: فرز حسب 'Id'
cs: Seřadit podle 'ID'
de_de: Sortieren nach 'Id'
es: Ordenar por 'Id'
fr: Trier par 'Id'
it: Ordina per "ID"
ja: 「Id」で並べ替え
pl: Sortuj wg 'Id'
pt: Classificar por 'Id'
ru: Сортировать по "Id"
tr: 'Kimlik'e göre sırala
zh_cn: 按“ 编号”排序

# cmsCodeBlocksSortByGeometry.Text
source: Sort by 'Geometry'
ar: فرز حسب "الهندسة"
cs: Seřadit podle 'Geometrie'
de_de: Sortieren nach 'Geometrie'
es: Ordenar por 'Geometría'
fr: Trier par 'Géométrie'
it: Ordina per 'Geometria'
ja: 「ジオメトリ」で並べ替え
pl: Sortuj wg 'Geometry'
pt: Classificar por 'Geometria'
ru: Сортировать по 'Геометрии'
tr: 'Geometri'ye göre sırala
zh_cn: 按“几何形状”排序

# cmsCodeBlocksSortByToolNr.Text
source: Sort by 'ToolNr'
ar: فرز حسب "ToolNr"
cs: Seřadit podle 'ToolNr'
de_de: Sortieren nach 'ToolNr'
es: Ordenar por 'ToolNr'
fr: Trier par 'ToolNr'
it: Ordina per 'ToolNr'
ja: 「ToolNr」で並べ替え
pl: Sortuj wg 'ToolNr'
pt: Classificar por 'ToolNr'
ru: Сортировать по 'ToolNr'
tr: 'AraçNr'ye göre sırala
zh_cn: 按“工具编号”排序

# cmsCodeBlocksSortByToolName.Text
source: Sort by 'ToolName'
ar: فرز حسب "ToolName"
cs: Seřadit podle 'Název_nástroje'
de_de: Sortieren nach 'ToolName'
es: Ordenar por 'Nombre de herramienta'
fr: Trier par 'ToolName'
it: Ordina per "Nomestrumento"
ja: 「ToolName」で並べ替え
pl: Sortuj wg 'ToolName'
pt: Classificar por 'ToolName'
ru: Сортировать по 'ToolName'
tr: 'AraçAdı'na göre sırala
zh_cn: 按“工具名称”排序

# cmsCodeBlocksSortByColor.Text
source: Sort by 'Pen Color'
ar: فرز حسب "اللون"
cs: Seřadit podle 'Barva pera'
de_de: Sortieren nach 'Farbe'
es: Ordenar por 'Color'
fr: Trier par 'Couleur'
it: Ordina per 'Colore penna'
ja: 「色」で並べ替え
pl: Sortuj wg 'Pen Color'
pt: Classificar por 'Cor'
ru: Сортировать по цвету
tr: 'Kalem Rengi'ne göre sırala
zh_cn: 按“颜色”排序

# cmsCodeBlocksSortByCodeSize.Text
source: Sort by 'CodeSize'
ar: فرز حسب 'CodeSize'
cs: Seřadit podle 'CodeSize'
de_de: Sortieren nach 'CodeSize'
es: Ordenar por 'CodeSize'
fr: Trier par 'CodeSize'
it: Ordina per 'CodeSize'
ja: 「CodeSize」で並べ替え
pl: Sortuj wg 'CodeSize'
pt: Classificar por 'CodeSize'
ru: Сортировать по 'CodeSize'
tr: 'KodBoyutu'na göre sırala
zh_cn: 按“代码大小”排序

# cmsCodeBlocksSortByCodeArea.Text
source: Sort by 'CodeArea'
ar: فرز حسب 'CodeArea'
cs: Seřadit podle 'CodeArea'
de_de: Sortieren nach 'CodeArea'
es: Ordenar por 'CodeArea'
fr: Trier par 'CodeArea'
it: Ordina per 'CodeArea'
ja: 「CodeArea」で並べ替え
pl: Sortuj wg 'CodeArea'
pt: Classificar por 'CodeArea'
ru: Сортировать по 'CodeArea'
tr: 'KodAlanına' göre sırala
zh_cn: 按“面积”排序

# cmsCodeBlocksSort.Text
source: Sort Code Blocks
ar: فرز كتل الرمز
cs: Třídit bloky kódu
de_de: Codeblöcke sortieren
es: Ordenar bloques de código
fr: Trier les blocs de code
it: Ordina blocchi di codice
ja: コードブロックの並べ替え
pl: Sortuj bloki kodu
pt: Classificar blocos de código
ru: Сортировать блоки кода
tr: Kod Bloklarını Sırala
zh_cn: 排序代码块

# cmsCodeBlocksRemoveGroup.Text
source: Remove 'Group' XML-Tags
ar: إزالة علامات XML "المجموعة"
cs: Odstraňte značky XML 'Group'
de_de: 'Group' XML-Tags entfernen
es: Eliminar las etiquetas XML 'Grupo'
fr: Supprimer les balises XML «Groupe»
it: Rimuovere i tag XML di "Gruppo".
ja: 「グループ」XMLタグを削除
pl: Usuń tagi 'Groups' XML
pt: Remover tags XML do 'Grupo'
ru: Удалить XML-теги 'Group'
tr: 'Grup' XML Etiketlerini Kaldır
zh_cn: 删除“组” XML标签

# cmsCodeBlocksRemoveAll.Text
source: Remove All XML-Tags
ar: إزالة كافة علامات XML
cs: Odebrat všechny značky XML
de_de: Entferne alle XML-Tags
es: Eliminar todas las etiquetas XML
fr: Supprimer toutes les balises XML
it: Rimuovi tutti i tag XML
ja: すべてのXMLタグを削除
pl: Usuń wszystkie tagi XML
pt: Remover todas as tags XML
ru: Удалить все XML-теги
tr: Tüm XML Etiketlerini Kaldır
zh_cn: 删除所有XML标签

# cmsEditMode.AccessibleDescription
source: In Edit-Mode automatic selection of groups is disabled
ar: يتم تعطيل التحديد التلقائي للمجموعات في وضع التحرير
cs: V režimu úprav je automatický výběr skupin zakázán
de_de: Im Bearbeitungsmodus ist die automatische Auswahl von Gruppen deaktiviert
es: En el modo de edición, la selección automática de grupos está deshabilitada
fr: En mode édition, la sélection automatique des groupes est désactivée
it: In modalità di modifica la selezione automatica dei gruppi è disabilitata
ja: 編集モードでは、グループの自動選択は無効になっています
pl: Automatyczny wybór grup jest wyłączony w trybie edycji
pt: No modo de edição, a seleção automática de grupos é desativada
ru: В режиме редактирования автоматический выбор групп отключен
tr: Düzenleme Modunda otomatik grup seçimi devre dışı bırakılır
zh_cn: 在编辑模式下，组的自动选择被禁用

# cmsCodeSelect.AccessibleDescription
source: Select complete code
ar: حدد الرمز الكامل
cs: Vyberte úplný kód
de_de: Auswählen des gesammten Codes
es: Seleccionar código completo
fr: Sélectionnez le code complet
it: Seleziona il codice completo
ja: 完全なコードを選択
pl: Wybierz kompletny kod
pt: Selecionar código completo
ru: Выберите полный код
tr: Tam kodu seçin
zh_cn: 选择完整的代码

# cmsCodeCopy.AccessibleDescription
source: Copy selection to clipboard
ar: نسخ التحديد إلى الحافظة
cs: Zkopírujte výběr do schránky
de_de: Kopiert die Auswahl in die Zwischenablage
es: Copiar selección al portapapeles
fr: Copier la sélection dans le presse-papiers
it: Copia la selezione negli appunti
ja: 選択範囲をクリップボードにコピー
pl: Kopiuj zaznaczenie do schowka
pt: Copiar seleção para a área de transferência
ru: Скопировать выделенное в буфер обмена
tr: Seçimi panoya kopyala
zh_cn: 将选择内容复制到剪贴板

# cmsCodePaste.AccessibleDescription
source: Clear editor and paste from clipboard
ar: محرر واضح ولصق من الحافظة
cs: Vymazat editor a vložit ze schránky
de_de: Editor löschen und aus der Zwischenablage einfügen
es: Borrar editor y pegar desde el portapapeles
fr: Effacer l'éditeur et coller du presse-papiers
it: Cancella editor e incolla dagli appunti
ja: エディターをクリアしてクリップボードから貼り付け
pl: Wyczyść edytor i wklej ze schowka
pt: Limpar editor e colar da área de transferência
ru: Очистить редактор и вставить из буфера обмена
tr: Düzenleyiciyi temizle ve panodan yapıştır
zh_cn: 清除编辑器并从剪贴板粘贴

# cmsCodePasteSpecial1.AccessibleDescription
source: Insert "Pen up" G-Code in front of current line
ar: أدخل "Pen up" G-Code أمام السطر الحالي
cs: Vložte "Pen up" G-Code před aktuální řádek
de_de: Fügt den G-Code "Pen up" vor die aktuelle Zeile ein
es: Inserte el código G "Pen up" delante de la línea actual
fr: Insérez le G-Code "Pen up" devant la ligne actuelle
it: Inserisci il codice G "Pen up" davanti alla riga corrente
ja: 現在の行の前に「ペンアップ」Gコードを挿入します
pl: Wstaw G-Code 'Pen-Up' na początku bieżącej linii
pt: Insira o código G "Pen up" na frente da linha atual
ru: Вставьте G-код "Pen up" перед текущей строкой
tr: Geçerli satırın önüne "Pen up" G-Kodu ekleyin
zh_cn: 在当前行的前面插入“ 抬笔” G代码
