Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# btnReset.ToolTip
source: This is Grbl's soft reset command 'Ctrl-x'. It's real-time and can be sent at any time. As the name implies, it resets Grbl, but in a controlled way, retains your machine position, and all is done without powering down your Arduino. The only times a soft-reset could lose position is when problems arise and the steppers were killed while they were moving. If so, it will report if Grbl's tracking of the machine position has been lost. This is because an uncontrolled deceleration can lead to lost steps, and Grbl has no feedback to how much it lost (this is the problem with steppers in general). Otherwise, Grbl will just re-initialize, run the startup lines, and continue on its merry way.
ar: هذا هو أمر إعادة تعيين Grbl الناعم 'Ctrl-x'. إنه وقت حقيقي ويمكن إرساله في أي وقت. كما يوحي الاسم ، فإنه يعيد تعيين Grbl ، ولكن بطريقة محكومة ، يحتفظ بموضع جهازك ، ويتم كل ذلك دون التقليل من اردوينو الخاص بك. الأوقات الوحيدة التي يمكن إعادة تعيين لينة الموقف المفقود هو عندما تنشأ مشاكل وقتل السائر بينما كانوا يتحركون. إذا كان الأمر كذلك ، فستبلغ إذا كان تتبع Grbl لموضع الماكينة قد فقد. وذلك لأن التباطؤ غير المنضبط يمكن أن يؤدي إلى خطوات ضائعة ، وليس لدى Grbl أي ملاحظات إلى مقدار خسارتها (هذه هي المشكلة مع السائر بشكل عام). خلاف ذلك ، سوف Grbl مجرد إعادة تهيئة ، تشغيل خطوط بدء التشغيل ، والاستمرار في طريقها مرح.
cs: Toto je Grblův příkaz pro měkký reset 'Ctrl-x'. Je to v reálném čase a lze je odeslat kdykoli. Jak název napovídá, resetuje Grbl, ale kontrolovaným způsobem zachová polohu vašeho stroje, a vše se děje bez vypínání vašeho Arduina. Jediný případ, kdy mohl měkký reset ztráta pozice je, když nastanou problémy a steppery byly zabity, když se pohybovali. Pokud ano, ohlásí, zda se Grblovo sledování polohy stroje ztratilo. Nekontrolované zpomalení totiž může vést ke ztrátě kroků a Grbl nemá zpětnou vazbu na kolik ztratil (to je problém stepperů obecně). V opačném případě se Grbl pouze znovu inicializuje, spustit startovací linky a pokračovat ve své veselé cestě.
de_de: 0x18 (ctrl-x): Soft-Reset Stoppt sofort und setzt GRBL zurück ohne die Stromversorgung unterbrechen zu müssen. Akzeptiert und führt diesen Befehl zu jeder Zeit aus. Beim Rücksetzen während der Fahrt wird Grbl einen Alarm auslösen, um anzuzeigen, dass die aktuelle Position verloren gehen kann. Wenn das Rücksetzen nicht während der Bewegung erfolgt, wird die Position beibehalten und ein erneutes Referenzieren ist nicht erforderlich. Zur Verbindung einer Taste oder eines Schalters steht ein Eingangspin zur Verfügung.
es: Este es el comando de reinicio suave de Grbl 'Ctrl-x'. Es en tiempo real y se puede enviar en cualquier momento. Como su nombre lo indica, restablece Grbl, pero de forma controlada, conserva la posición de su máquina, y todo se hace sin apagar tu Arduino. Las únicas veces que un restablecimiento parcial podría perder posición es cuando surgen problemas y los steppers fueron asesinados mientras se movían. Si es así, informará si se ha perdido el seguimiento de Grbl de la posición de la máquina. Esto se debe a que una desaceleración incontrolada puede conducir a la pérdida de pasos, y Grbl no tiene comentarios. a cuánto perdió (este es el problema con los steppers en general). De lo contrario, Grbl simplemente se reiniciará, ejecuta las líneas de inicio y continúa alegremente.
fr: C'est la commande de réinitialisation logicielle de Grbl 'Ctrl-x'. C'est en temps réel et peut être envoyé à tout moment. Comme son nom l'indique, il réinitialise Grbl, mais conserve de manière contrôlée la position de votre machine. et tout est fait sans éteindre votre Arduino. Les seules fois où une réinitialisation logicielle pourrait perdre position est quand les problèmes surgissent et les steppers ont été tués pendant qu'ils se déplaçaient. Si tel est le cas, il signalera si le suivi de la position de la machine par Grbl a été perdu. En effet, une décélération incontrôlée peut entraîner la perte d'étapes et Grbl n'a pas de retour. à combien il a perdu (c'est le problème avec les steppers en général). Sinon, Grbl va simplement réinitialiser, lancez les lignes de démarrage et continuez sur sa lancée.
it: Questo è il comando di ripristino software di Grbl 'Ctrl-x'. È in tempo reale e può essere inviato in qualsiasi momento. Come suggerisce il nome, reimposta Grbl, ma in modo controllato, mantiene la posizione della tua macchina, e tutto è fatto senza spegnere il tuo Arduino. Le uniche volte in cui potrebbe essere eseguito un soft reset perdere la posizione è quando sorgono problemi e gli stepper vengono uccisi mentre si muovevano. In tal caso, segnalerà se il rilevamento della posizione della macchina da parte di Grbl è andato perso. Questo perché una decelerazione incontrollata può portare a passi persi e Grbl non ha feedback a quanto ha perso (questo è il problema con gli stepper in generale). In caso contrario, Grbl si reinizializzerà semplicemente, esegui le linee di avvio e continua per la sua strada allegra.
ja: これは、Grblのソフトリセットコマンド「Ctrl-x」です。 リアルタイムであり、いつでも送信できます。 名前が示すように、Grblをリセットしますが、制御された方法で、マシンの位置を保持し、 すべてがArduinoの電源を切らずに行われます。 ソフトリセットができるのは ポジションを失うとは、問題が発生し、移動中にステッパーが死亡した場合です。 その場合、Grblのマシン位置の追跡が失われたかどうかを報告します。 これは、制御されていない減速が失われたステップにつながる可能性があり、Grblにフィードバックがないためです。 それがどれだけ失われたか（これは一般的なステッパーの問題です）。 それ以外の場合、Grblは再初期化するだけです。 スタートアップラインを実行し、陽気な方法で続行します。
pl: Jest to polecenie miękkiego resetu GRBL'a 'Ctrl-x'. Jest ono wykonywane w czasie rzeczywistym i może być wysłana w każdej chwili. Jak sama nazwa wskazuje, resetuje GRBL, ale w kontrolowany sposób, zachowuje pozycję twojej maszyny, a wszystko to odbywa się bez wyłączania Arduino. Jedyne sytuacje, w których miękki reset mógłby stracić pozycję, to gdy pojawią się problemy i steppery zostaną zabite podczas ruchu. Jeśli tak, to zgłosi on, czy śledzenie pozycji maszyny przez GRBL zostało utracone. Dzieje się tak dlatego, że niekontrolowane zwalnianie może prowadzić do utraty kroków, a GRBL nie ma informacji zwrotnej ile stracił (to jest problem z stepperami w ogóle). W przeciwnym razie GRBL po prostu ponownie się zainicjalizuje, uruchomi linie startowe i będzie kontynuował swoją wesołą drogę.
pt: Este é o comando de redefinição suave do Grbl 'Ctrl-x'. É em tempo real e pode ser enviado a qualquer momento. Como o nome indica, ele redefine o Grbl, mas de maneira controlada, mantém a posição da sua máquina e tudo é feito sem desligar o seu Arduino. As únicas vezes em que uma reinicialização suave pode perder a posição é quando surgem problemas e os steppers foram mortos enquanto estavam em movimento. Nesse caso, ele informará se o rastreamento do Grbl da posição da máquina foi perdido. Isso ocorre porque uma desaceleração descontrolada pode levar a etapas perdidas, e o Grbl não tem feedback sobre o quanto perdeu (esse é o problema dos steppers em geral). Caso contrário, o Grbl irá apenas reinicializar, executar as linhas de inicialização e continuar em seu caminho alegre.
ru: Это команда мягкого сброса Grbl 'Ctrl-x'. Это в режиме реального времени и может быть отправлено в любое время. Как следует из названия, он сбрасывает Grbl, но контролируемым образом сохраняет положение вашей машины, и все делается без выключения вашего Arduino. Единственный раз, когда программный сброс мог Потеря позиции происходит, когда возникают проблемы, и степперы были убиты во время движения. Если это так, он сообщит, что отслеживание положения машины Grbl было потеряно. Это потому, что неконтролируемое замедление может привести к потерянным шагам, а Grbl не имеет обратной связи насколько это потеряно (это проблема со степперами в целом). В противном случае, Grbl просто переинициализируется, запустить линии запуска и продолжить свой веселый путь.
tr: Bu, Grbl'nin 'Ctrl-x' yazılım sıfırlama komutudur. Gerçek zamanlı ve herhangi bir zamanda gönderilebilir. Adından da anlaşılacağı gibi, Grbl'yi sıfırlar, ancak kontrollü bir şekilde makine konumunuzu korur, ve hepsi Arduino'nuzu kapatmadan yapılır. Yumuşak sıfırlamanın yapabileceği tek zamanlar Pozisyon kaybetmek, sorunların ortaya çıktığı ve adım atanların hareket ederken öldürüldüğü zamandır. Eğer öyleyse, Grbl'nin makine konumunu izlemesinin kaybolup kaybolmadığını bildirecektir. Bunun nedeni, kontrolsüz bir yavaşlamanın adımların kaybedilmesine yol açabilmesi ve Grbl'in geri bildiriminin olmamasıdır. ne kadar kaybettiğine göre (genel olarak steplerin sorunu budur). Aksi takdirde, Grbl yeniden başlatılacak, başlangıç ​​satırlarını çalıştırın ve neşeli yoluna devam edin.
zh_cn: 这是Grbl的软件重置命令“ Ctrl-x”。 它是实时的，可以随时发送。 顾名思义，它会重置Grbl，但会以受控方式保留您的机器位置， 并且无需关闭Arduino就可以完成所有操作。 在步进电机移动时进行软复位可能会导致丢步 如果发生这种情况，它将报告Grbl对机器位置的跟踪是否丢失。 丢步的出现是因为在停止电机时加速度不受控制，而Grbl没有反馈 损失多少（通常这是步进电机的问题）。 如果没有发生丢步，Grbl会重新初始化，并继续正常运行。

# btnZeroC.ToolTip
source: Set work C coordinate to zero
ar: ضبط العمل C إحداثي إلى صفر
cs: Nastavte pracovní souřadnici C na nulu
de_de: Setzt die C-Koordinate des Werkstücks auf Null
es: Establezca la coordenada C de trabajo en cero
fr: Mettre la coordonnée C à zéro
it: Impostare la coordinata C di lavoro su zero
ja: 作業C座標をゼロに設定します
pl: Ustaw współrzędną roboczą C na zero
pt: Defina a coordenada C do trabalho como zero
ru: Установить рабочую координату C на ноль
tr: İş C koordinatını sıfıra ayarla
zh_cn: 将工件C坐标设置为零

# btnZeroB.ToolTip
source: Set work B coordinate to zero
ar: تعيين العمل B إحداثي إلى الصفر
cs: Nastavte pracovní souřadnici B na nulu
de_de: Setzt die B-Koordinate des Werkstücks auf Null
es: Establezca la coordenada de trabajo B en cero
fr: Mettre la coordonnée B à zéro
it: Impostare la coordinata B di lavoro su zero
ja: 作業B座標をゼロに設定します
pl: Ustaw współrzędną roboczą B na zero
pt: Defina a coordenada do trabalho B como zero
ru: Установить рабочую координату B на ноль
tr: İş B koordinatını sıfıra ayarla
zh_cn: 将工件B坐标设置为零

# btnZeroA.ToolTip
source: Set work coordinate to zero
ar: ضبط تنسيق العمل على الصفر
cs: Nastavte pracovní souřadnice na nulu
de_de: Setze Work Koordinate auf Null
es: Establecer coordenada de trabajo a cero
fr: Définir la coordonnée de travail à zéro
it: Imposta la coordinata di lavoro su zero
ja: 作業座標をゼロに設定します
pl: Ustaw współrzędną roboczą na zero
pt: Definir coordenada de trabalho como zero
ru: Установить рабочую координату на ноль
tr: İş koordinatını sıfıra ayarla
zh_cn: 将工作坐标设置为零

# btnHome.ToolTip
source: Start Homing (if enabled in GRBL)
ar: بدء صاروخ موجه (إذا تم تمكين GRBL)
cs: Spustit navádění (pokud je povoleno v GRBL)
de_de: Referenzfahrt starten (falls in GRBL aktiviert)
es: Iniciar referenciación (si está habilitado en GRBL)
fr: Démarrer Homing (si activé dans GRBL)
it: Avvia Homing (se abilitato in GRBL)
ja: ホーミングの開始（GRBLで有効になっている場合）
pl: Rozpocznij Homing (jeśli włączony w GRBL)
pt: Iniciar Homing (se ativado no GRBL)
ru: Запустите Homing (если включен в GRBL)
tr: Hedef Aramayı Başlat (GRBL'de etkinleştirilmişse)
zh_cn: 启动归位（如果在GRBL中启用）

# btnZeroXYZ.ToolTip
source: Set work X,Y,Z coordinate to zero
ar: تعيين العمل X ، Y ، Z تنسيق إلى الصفر
cs: Nastavte pracovní souřadnice X,Y,Z na nulu
de_de: Setze Work Koordinate X,Y,Z auf Null
es: Establezca la coordenada de trabajo X, Y, Z en cero
fr: Mettre les coordonnées de travail X, Y, Z à zéro
it: Imposta le coordinate X,Y,Z di lavoro su zero
ja: 作業X、Y、Z座標をゼロに設定します
pl: Ustaw współrzędne robocze X, Y, Z na zero
pt: Defina as coordenadas X, Y, Z do trabalho como zero
ru: Установить координаты X, Y, Z на ноль
tr: İş X,Y,Z koordinatını sıfıra ayarla
zh_cn: 将工件X，Y，Z坐标设置为零

# btnZeroXY.ToolTip
source: Set work X,Y coordinate to zero
ar: تعيين العمل X ، Y تنسيق إلى الصفر
cs: Nastavte pracovní souřadnice X,Y na nulu
de_de: Setze Work Koordinate X,Y auf Null
es: Establezca la coordenada X, Y del trabajo en cero
fr: Définir les coordonnées X et Y de travail à zéro
it: Imposta le coordinate X,Y di lavoro su zero
ja: 作業X、Y座標をゼロに設定します
pl: Ustaw współrzędne robocze X, Y na zero
pt: Defina a coordenada X, Y do trabalho como zero
ru: Установить координаты X, Y на ноль
tr: İş X,Y koordinatını sıfıra ayarla
zh_cn: 将工件X，Y坐标设置为零

# btnZeroZ.ToolTip
source: Set work Z coordinate to zero
ar: اضبط إحداثي Z إلى صفر
cs: Nastavte pracovní Z souřadnici na nulu
de_de: Setze Work Koordinate X auf Null
es: Establecer la coordenada Z de trabajo en cero
fr: Mettre la coordonnée Z de travail à zéro
it: Impostare la coordinata Z di lavoro su zero
ja: 作業Z座標をゼロに設定します
pl: Ustaw współrzędną roboczą Z na zero
pt: Defina a coordenada Z de trabalho como zero
ru: Установить рабочую координату Z на ноль
tr: İş Z koordinatını sıfıra ayarla
zh_cn: 将工作Z坐标设置为零

# btnZeroY.ToolTip
source: Set work Y coordinate to zero
ar: تعيين العمل Y إحداثي إلى الصفر
cs: Nastavte pracovní souřadnici Y na nulu
de_de: Setze Work Koordinate Y auf Null
es: Establezca la coordenada Y de trabajo en cero
fr: Définit la coordonnée Y du travail à zéro
it: Impostare la coordinata Y di lavoro su zero
ja: 作業Y座標をゼロに設定します
pl: Ustaw wspłrzedną roboczą Y na zero
pt: Defina a coordenada Y do trabalho como zero
ru: Установить координату Y работы на ноль
tr: İş Y koordinatını sıfıra ayarla
zh_cn: 将工作Y坐标设置为零

# btnZeroX.ToolTip
source: Set work X coordinate to zero
ar: تعيين العمل X تنسيق إلى الصفر
cs: Nastavte pracovní X souřadnici na nulu
de_de: Setze Work Koordinate X auf Null
es: Establecer la coordenada X del trabajo en cero
fr: Mettre la coordonnée X de travail à zéro
it: Impostare la coordinata X di lavoro su zero
ja: 作業X座標をゼロに設定します
pl: Ustaw współrzędną roboczą X na zero
pt: Defina a coordenada X do trabalho como zero
ru: Установить рабочую координату X на ноль
tr: İş X koordinatını sıfıra ayarla
zh_cn: 将工件X坐标设置为零

# controlStreamingToolStripMenuItem.Text
source: Control Streaming
ar: التحكم في التدفق
cs: Ovládání streamování
de_de: Steuerung des Streamings
es: Control de transmisión
fr: Contrôle du streaming
it: Controllo dello streaming
ja: ストリーミングの制御
pl: Sterowanie strumieniowaniem
pt: Controlar Transmissão
ru: Контроль потоковой передачи
tr: Kontrol Akışı
zh_cn: 速度控制

# controlStreamingToolStripMenuItem.ToolTipText
source: Override Feed rate and Spindle speed
ar: تجاوز معدل التغذية وسرعة المغزل
cs: Přepsání rychlosti posuvu a rychlosti vřetena
de_de: Überschreibe Fahrgeschwindigkeit (Feed rate) und Drehzahl (Spindle speed)
es: Anular la velocidad de avance y la velocidad del husillo
fr: Ignorer la vitesse d'alimentation et la vitesse de rotation
it: Escludi velocità di avanzamento e velocità del mandrino
ja: 送り速度とスピンドル速度をオーバーライドする
pl: Zastąp prędkość posuwu i prędkość wrzeciona
pt: Substituir taxa de alimentação e velocidade do eixo
ru: Отменить скорость подачи и скорость шпинделя
tr: İlerleme hızını ve İş Mili hızını geçersiz kıl
zh_cn: 覆盖进给速度和主轴速度

# control2ndGRBLToolStripMenuItem.Text
source: Control 2nd GRBL
ar: السيطرة 2nd GRBL
cs: Ovládání 2. GRBL
de_de: Steuerung 2ter GRBL
es: Control 2º GRBL
fr: Contrôle 2ème GRBL
it: Controllo 2° GRBL
ja: 2番目のGRBLを制御する
pl: Kontrola drugiego GRBL
ru: Контрольная 2-я ГРБЛ
tr: Kontrol 2. GRBL
zh_cn: 控制第二个GRBL

# aboutToolStripMenuItem.Text
source: &About
ar: حول
cs: &O
de_de: Über...
es: Acerca de
fr: À propos
it: &Di
ja: ＆約
pl: O programie
pt: Sobre
ru: Спарвка
tr: &Hakkında
zh_cn: 关于

# control2ndGRBLToolStripMenuItem.ToolTipText
source: Opens a simple window to control a second GRBL controller
ar: يفتح نافذة بسيطة للتحكم في وحدة تحكم GRBL ثانية
cs: Otevře jednoduché okno pro ovládání druhého ovladače GRBL
de_de: Öffnet eine einfaches Fenster zur Steuerung eines zweiten GRBL-Controllers
es: Abre una ventana simple para controlar un segundo controlador GRBL
fr: Ouvre une simple fenêtre pour contrôler un deuxième contrôleur GRBL
it: Apre una semplice finestra per controllare un secondo controller GRBL
ja: シンプルなウィンドウを開いて、2番目のGRBLコントローラーを制御します
pl: Otwiera proste okno do sterowania drugim kontrolerem GRBL
pt: Abre uma janela simples para controlar um segundo controlador GRBL
ru: Открывает простое окно для управления вторым контроллером GRBL
tr: İkinci bir GRBL denetleyicisini kontrol etmek için basit bir pencere açar
zh_cn: 打开一个简单的窗口来控制第二个GRBL控制器

# cmsEditorHotkeys.Text
source: Show Editor hotkeys
ar: إظهار مفاتيح الاختصار للمحرر
cs: Zobrazit klávesové zkratky editoru
de_de: Editor-Hotkeys anzeigen
es: Mostrar teclas de acceso rápido del editor
fr: Afficher les raccourcis clavier de l'éditeur
it: Mostra i tasti di scelta rapida dell'editor
ja: エディターのホットキーを表示
pl: Pokaż klawisze skrótu edytora
pt: Mostrar teclas de atalho do Editor
ru: Показать редактор горячих клавиш
tr: Düzenleyici kısayol tuşlarını göster
zh_cn: 显示快捷键

# fCTBCode.Text
source: (Paste G-Code or load file)
ar: (لصق رمز G أو ملف التحميل)
cs: (Vložte G-Code nebo načtěte soubor)
de_de: (Paste G-Code hier oder lade eine Datei)
es: (Pegar G-Code o cargar archivo)
fr: (Coller G-Code ou charger le fichier)
it: (Incolla il codice G o carica il file)
ja: （Gコードの貼り付けまたはファイルのロード）
pl: (Wklej G-Code lub wczytaj plik)
pt: (Cole o código G ou carregue o arquivo)
ru: (Вставьте G-Code или загрузите файл)
tr: (G-Code yapıştırın veya dosya yükleyin)
zh_cn: (粘贴G代码或加载文件)

# lbInfo.Text
source: Message
ar: رسالة
cs: Zpráva
de_de: Nachricht
es: Mensaje
it: Messaggio
ja: メッセージ
pl: Wiadomość
pt: mensagem
ru: Сообщение
tr: İleti
zh_cn: 信息

# lblElapsed.Text
source: Time
ar: زمن
cs: Čas
de_de: Dauer
es: Duración
fr: Durée
it: Volta
ja: 時間
pl: Czas
pt: Tempo
ru: продолжительность
tr: Zaman
zh_cn: 持续时间

# lblFileProgress.Text
source: Progress
ar: تقدم
cs: Pokrok
de_de: Fortschritt
es: Progreso
fr: Progrès
it: Progresso
ja: 進捗
pl: Postęp
pt: Progresso
ru: прогресс
tr: İlerlemek
zh_cn: 进度

# gBoxStream.Text
source: G-Code Streaming
ar: G- كود الجري
cs: Streamování G-Code
de_de: G-Code übertragen
es: Transmisión de G-Code
fr: G-Code en streaming
it: Streaming codice G
ja: Gコードストリーミング
pl: Przesyłanie G-Code
pt: Streaming de código G
ru: G-код потоковой передачи
tr: G Kodu Akışı
zh_cn: G代码流

# lbDimension.Text
source: Dimensions
ar: الأبعاد
de_de: Abmessungen
es: Dimensiones
it: Dimensioni
ja: 寸法
pl: Wymiary
pt: Dimensões
ru: Размеры
tr: boyutlar
zh_cn: 位置信息

# gBoxDimension.Text
source: G-Code Dimension
ar: G- كود البعد
cs: Rozměr G-kódu
es: Dimensiones G-Code
fr: Dimension G-code
it: Dimensione codice G
ja: Gコード寸法
pl: Wymiary G-Code
pt: Dimensão do código G
ru: Размер G-кода
tr: G Kodu Boyutu
zh_cn: G代码位置

# lblStatusFeed.ToolTip
source: Actual feed rate in mm/min or inch/min (depending on $13)
ar: معدل التغذية الفعلي بالملليمتر / دقيقة أو البوصة / الدقيقة (اعتمادًا على 13 دولارًا)
cs: Skutečná rychlost posuvu v mm/min nebo palcích/min (v závislosti na $13)
de_de: Tatsächliche Vorschubgeschwindigkeit in mm / min oder Zoll / min (abhängig von 13 USD)
es: Velocidad de alimentación real en mm / min o pulgadas / min (dependiendo de $ 13)
fr: Débit réel en mm / min ou pouce / min (selon 13 $)
it: Avanzamento effettivo in mm/min o pollici/min (a seconda di $ 13)
ja: mm / minまたはinch / minの実際の送り速度（$ 13に依存）
pl: Rzeczywista prędkość posuwu w mm/min lub calach/min (w zależności od $13)
pt: Taxa de alimentação real em mm / min ou polegada / min (dependendo de US $ 13)
ru: Фактическая скорость подачи в мм / мин или дюйм / мин (в зависимости от $ 13)
tr: Mm/dak veya inç/dak cinsinden gerçek ilerleme hızı (13 $'a bağlı olarak)
zh_cn: 实际进给速度，单位：mm / min或inch / min（取决于$ 13）

# lblStatusSpeed.ToolTip
source: Actual spindle speed in RPM
ar: سرعة المغزل الفعلية في دورة في الدقيقة
cs: Skutečné otáčky vřetena v ot./min
de_de: Tatsächliche Spindeldrehzahl in U / min
es: Velocidad real del husillo en RPM
fr: Vitesse réelle de la broche en tours / minute
it: Velocità effettiva del mandrino in RPM
ja: RPMでの実際のスピンドル速度
pl: Rzeczywista prędkość wrzeciona obr / min
pt: Velocidade real do fuso em RPM
ru: Фактическая скорость шпинделя в об / мин
tr: RPM cinsinden gerçek iş mili hızı
zh_cn: 实际主轴转速（RPM）

# deletenotMarkToolStripMenuItem.Text
source: Mark code (no delete)
ar: تعليم الكود (بدون حذف)
cs: Označit kód (bez smazání)
de_de: Code markieren (kein Löschen)
es: Marcar código (sin borrar)
fr: Marquer le code (pas supprimer)
it: Codice di contrassegno (nessuna cancellazione)
ja: コードをマーク（削除なし）
pl: Kod znaku (bez usuwania)
pt: Código de marca (sem exclusão)
ru: Отметить код (без удаления)
tr: İşaret kodu (silme yok)
zh_cn: 标记代码（不删除）

# deletenotMarkToolStripMenuItem.ToolTipText
source: Click to toggle
ar: انقر للتبديل
cs: Kliknutím přepnete
de_de: Zum Umschalten klicken
es: Haga clic para alternar
fr: Cliquer pour basculer
it: Fare clic per passare
ja: クリックして切り替え
pl: Kliknij, aby przełączyć
pt: Clique para alternar
ru: Нажмите, чтобы переключиться
tr: Geçiş yapmak için tıklayın
zh_cn: 点击切换

# groupBox5.Text
source: Custom Buttons
ar: أزرار مخصصة
cs: Vlastní tlačítka
de_de: Benutzerdefinierte Buttons
es: Botones personalizados
fr: Boutons personnalisés
it: Pulsanti personalizzati
ja: カスタムボタン
pl: Własne przyciski
pt: Botões personalizados
ru: Пользовательские кнопки
tr: Özel Düğmeler
zh_cn: 自定义按键

# lblCurrentG.ToolTip
source: Default coordinate system = G54 Camera coordinate system = G59 Add 'G54;' to G-Code header to switch back automatically to G54 before streaming G-Code
ar: نظام الإحداثيات الافتراضي = G54 نظام إحداثيات الكاميرا = G59 أضف "G54 ؛" إلى رأس G-Code للتبديل تلقائيًا إلى G54 قبل دفق G-Code
cs: Výchozí souřadnicový systém = G54 Souřadnicový systém kamery = G59 Přidat 'G54;' do hlavičky G-Code, aby se před streamováním G-Code automaticky přepnul zpět na G54
de_de: Standardkoordinatensystem = G54 Kamerakoordinatensystem = G59 Fügen Sie 'G54;' to G-Code-Header, um vor dem Streaming von G-Code automatisch zu G54 zurückzukehren
es: Sistema de coordenadas predeterminado = G54 Sistema de coordenadas de cámara = G59 Añadir 'G54;' al encabezado G-Code para volver automáticamente a G54 antes de transmitir G-Code
fr: Système de coordonnées par défaut = G54 Système de coordonnées de la caméra = G59 Ajouter 'G54;' to G-Code header pour revenir automatiquement à G54 avant de diffuser G-Code
it: Sistema di coordinate predefinito = G54 Sistema di coordinate della telecamera = G59 Aggiungi 'G54;' all'intestazione G-Code per tornare automaticamente a G54 prima dello streaming di G-Code
ja: デフォルトの座標系= G54 カメラ座標系= G59 「G54;」を追加 Gコードをストリーミングする前に自動的にG54に戻すためのGコードヘッダー
pl: Domyślny układ współrzędnych = G54 Układ współrzędnych kamery = G59 Dodaj 'G54;' do nagłówka G-Code aby automatycznie przełączyć się z powrotem na G54 przed strumieniem G-Code
pt: Sistema de coordenadas padrão = G54 Sistema de coordenadas da câmera = G59 Adicione 'G54;' ao cabeçalho do código G para retornar automaticamente ao G54 antes de transmitir o código G
ru: Система координат по умолчанию = G54 Система координат камеры = G59 Добавьте «G54;» в заголовок G-Code для автоматического переключения на G54 перед потоковой передачей G-Code
tr: Varsayılan koordinat sistemi = G54 Kamera koordinat sistemi = G59 'G54;' ekleyin G-Code akışından önce otomatik olarak G54'e geri dönmek için G-Code başlığına
zh_cn: 默认坐标系= G54 相机坐标系= G59 添加“ G54;” 到G-Code标头以在流传输G-Code之前自动切换回G54

# label_status0.Text
source: Status:
ar: الحالة:
cs: Postavení:
es: Estado
fr: Statut
it: Stato:
ja: 状態：
pt: Estado:
ru: Статус
tr: Durum:
zh_cn: 状态:

# label_status.Text
source: Status
ar: الحالة
cs: Postavení
es: Estado
fr: Statut
it: Stato
ja: 状態
ru: Статус
tr: Durum
zh_cn: 状态

# loadToolStripMenuItem.Text
source: &Open File
ar: فتح الملف
cs: &Otevřít soubor
de_de: &Datei öffnen
es: Abrir archivo
fr: Fichier ouvert
it: &Apri il file
ja: ファイルを開く
pl: Otwórz plik
pt: Abrir arquivo
ru: Открыть файл
tr: &Açık dosya
zh_cn: 打开文件

# loadToolStripMenuItem.ToolTipText
source: Open G-Code or SVG file
ar: افتح ملف G-Code أو SVG
cs: Otevřete soubor G-Code nebo SVG
de_de: Öffne G-Code oder SVG Datei
es: Abra el archivo G-Code o SVG
fr: Ouvrez le fichier G-Code ou SVG
it: Apri il file G-Code o SVG
ja: GコードまたはSVGファイルを開く
pl: Otwórz plik G-Code lub SVG
pt: Abrir arquivo G-Code ou SVG
ru: Откройте файл G-Code или SVG
tr: G-Code veya SVG dosyasını açın
zh_cn: 打开G代码或SVG文件
