Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# loadMachineParametersToolStripMenuItem.Text
source: &Import Machine Settings
ar: واستيراد إعدادات الجهاز
cs: &Importovat nastavení stroje
de_de: &Importiere Maschinen Einstellungen
es: Importar configuraciones de máquina
fr: Importer les paramètres de la machine
it: &Importa impostazioni macchina
ja: マシン設定のインポート
pl: Importuj ustawienia maszyny
pt: Importar configurações da máquina
ru: Импорт настроек машины
tr: &Makine Ayarlarını İçe Aktar
zh_cn: 导入机器设置

# loadMachineParametersToolStripMenuItem.ToolTipText
source: Import GUI-Settings (Button definitions, Joystick parameters) from an INI-file
ar: استيراد إعدادات واجهة المستخدم الرسومية (تعريفات الزر ، معلمات جويستيك) من ملف INI
cs: Importujte nastavení GUI (definice tlačítek, parametry joysticku) ze souboru INI
de_de: Importiere Programmeinstellungen (Button Definitionen, Joystick Parameter) aus einer INI-Datei
es: Importar configuraciones de GUI (definiciones de botones, parámetros de Joystick) desde un archivo INI
fr: Importer des paramètres d'interface graphique (définitions de boutons, paramètres de manette de jeu) à partir d'un fichier INI
it: Importa le impostazioni della GUI (definizioni dei pulsanti, parametri del joystick) da un file INI
ja: INIファイルからGUI設定（ボタン定義、ジョイスティックパラメーター）をインポートする
pl: Import ustawień GUI (definicje przycisków, parametry joysticka) z pliku INI
pt: Importar configurações da GUI (definições de botões, parâmetros do joystick) de um arquivo INI
ru: Импорт настроек GUI (определения кнопок, параметры джойстика) из INI-файла
tr: Bir INI dosyasından GUI Ayarlarını (Düğme tanımları, Joystick parametreleri) içe aktarın
zh_cn: 从INI文件导入GUI设置（按钮定义，操纵杆参数）

# fileToolStripMenuItem.Text
source: &File
ar: ملف
cs: &Soubor
de_de: &Datei
es: Archivo
fr: Fichier
ja: ＆ファイル
pl: Plik
pt: Arquivo
ru: файл
tr: &Dosya
zh_cn: 文件

# imageToolStripMenuItem.Text
source: Convert &Image
ar: تحويل والصورة
cs: Převést &obrázek
de_de: &Bild umwandeln
es: Convertir imagen
fr: Convertir une image
it: Converti &immagine
ja: 変換と画像
pl: Konwertuj obraz
pt: Converter e imagem
ru: Конвертировать изображение
tr: &Görüntüyü Dönüştür
zh_cn: 图片转Gcode

# createSimpleShapesToolStripMenuItem.Text
source: Create Simple Sh&apes
ar: إنشاء بسيط القرود والقرود
cs: Vytvořte jednoduché Sh&apes
de_de: Erzeuge einfache &Formen
es: Crear formas simples
fr: Créer des formes simples
it: Crea semplici pasticcini
ja: シンプルなSh＆apesを作成する
pl: Utwórz proste kształty
pt: Criar Sh macacos simples
ru: Создать простые фигуры
tr: Basit Şe&killer Yaratın
zh_cn: 创建简单的形状

# createGCodeToolStripMenuItem.Text
source: G-Code &Creation
ar: G- كود و الخلق
cs: &Vytvoření G-kódu
de_de: G-Code &erzeugen
es: Crear G-Code
fr: Créer un G-Code
it: Codice G e creazione
ja: Gコードと作成
pl: Tworzenie G-Code
pt: Gerar Código G
ru: Создать G-Code
tr: G Kodu &Oluşturma
zh_cn: 生成Gcode

# mirrorXToolStripMenuItem.Text
source: Mirror X (&horizontal)
ar: المرآة X (والأفقية)
cs: Zrcadlo X (&horizontální)
de_de: Spiegeln X (&horizontal)
es: Espejo X (horizontal)
fr: Miroir X (horizontal)
it: Specchio X (&orizzontale)
ja: ミラーX（＆水平）
pl: Odbij X (poziomo)
pt: Espelho X (e horizontal)
ru: Зеркало X (горизонтальное)
tr: Ayna X (&yatay)
zh_cn: 镜像X (水平)

# mirrorYToolStripMenuItem.Text
source: Mirror Y (&vertical)
ar: المرآة Y (والرأسي)
cs: Zrcadlo Y (&vertikální)
de_de: Spiegeln Y (&vertikal)
es: Espejo Y (vertical)
fr: Miroir Y (vertical)
it: Specchia Y (&verticale)
ja: ミラーY（＆垂直）
pl: Odbij Y (pionowo)
pt: Espelho Y (e vertical)
ru: Зеркало Y (вертикальное)
tr: Y Aynalama (&dikey)
zh_cn: 镜像Y (垂直)

# mirrorRotaryToolStripMenuItem.Text
source: Mirror Rotary axis
ar: مرآة محور الدوران
cs: Zrcadlo Rotační osa
de_de: Drehachse spiegeln
es: Eje giratorio espejo
fr: Axe Rotatif Miroir
it: Specchio Asse rotante
ja: ミラー回転軸
pl: Oś obrotu lustra
pt: Espelho eixo rotativo
ru: Поворотная ось зеркала
tr: Ayna Döner ekseni
zh_cn: 镜像旋转轴

# ersetzteG23DurchLinienToolStripMenuItem.Text
source: Replace G2/3 by lines
ar: استبدل G2 / 3 بخطوط
cs: Nahraďte G2/3 řádky
de_de: Ersetzte G2/3 durch Linien
es: Reemplazar G2 / 3 por líneas
fr: Remplacer G2 / 3 par des lignes
it: Sostituisci G2/3 con linee
ja: G2 / 3をラインで置き換える
pl: Zastąp G2/3 liniami
pt: Substitua G2 / 3 por linhas
ru: Заменить G2 / 3 на линии
tr: G2/3'ü satırlarla değiştirin
zh_cn: 用直线替换G2 / 3

# convertZToSspindleSpeedToolStripMenuItem.Text
source: Convert Z to S (spindle speed)
ar: تحويل Z إلى S (سرعة الدوران)
cs: Převést Z na S (otáčky vřetena)
de_de: Konvertiere Z zu S (Spindle Speed)
es: Convertir Z a S (velocidad del husillo)
fr: Convertir Z en S (vitesse de broche)
it: Converti Z in S (velocità del mandrino)
ja: ZからSへの変換（スピンドル速度）
pl: Konwertuj Z do S (prędkośc obrotowa wrzeciona)
pt: Converter Z em S (velocidade do fuso)
ru: Конвертировать Z в S (скорость шпинделя)
tr: Z'yi S'ye dönüştür (iş mili hızı)
zh_cn: 将Z转换为S（主轴速度）

# convertZToSspindleSpeedToolStripMenuItem.ToolTipText
source: Set maximum Spindle speed for minimum Z in [Setup - Graphics import - G-Code modification]
ar: اضبط أقصى سرعة للمغزل لأدنى Z في [الإعداد - استيراد الرسومات - تعديل G-Code]
cs: Nastavte maximální otáčky vřetena na minimální Z in [Nastavení - Import grafiky - Úprava G-Code]
de_de: Setze maximale Spindle speed für minimum Z in [Einstellungen - Grafik Import - G-Code Modifikation]
es: Ajuste la velocidad máxima del husillo para un mínimo de Z en [Configuración - Importación de gráficos - Modificación del código G]
fr: Régler la vitesse maximale de broche pour un Z in minimal [Configuration - Importation graphique - Modification du code G]
it: Impostare la velocità massima del mandrino per il minimo Z in[Impostazioni - Importazione grafica - Modifica codice G]
ja: 最小Zの最大スピンドル速度を設定します [セットアップ-グラフィックのインポート-Gコードの変更]
pl: Ustaw maksymalną prędkość obrotową wrzeciona dla minimalnego Z w [Ustawienia - Import grafiki - Transformacje G-Code]
pt: Defina a velocidade máxima do eixo para o Z mínimo em [Configuração - Importação de gráficos - Modificação do código G]
ru: Установите максимальную скорость шпинделя для минимального Z в [Настройка - Импорт графики - Модификация G-кода]
tr: Minimum Z inç için maksimum İş Mili hızını ayarlayın [Kurulum - Grafikleri içe aktarma - G Kodu değişikliği]
zh_cn: 将最大主轴转速设置为最小Z 在 [设置-图形导入-G代码修改]里设置

# heightMapToolStripMenuItem.Text
source: Surface scan
ar: مسح السطح
cs: Skenování povrchu
de_de: Höhenprofil aufnehmen
es: Escaneo de superficie
fr: Balayage de surface
it: Scansione di superficie
ja: 表面スキャン
pl: Skanowanie powierzchni
pt: Digitalização de superfície
ru: Сканирование поверхности
tr: Yüzey taraması
zh_cn: 表面扫描

# coordinateSystemsToolStripMenuItem.Text
source: Coordinate Systems
ar: نظم الإحداثيات
cs: Souřadnicové systémy
de_de: Koordinatensysteme
es: Sistema de coordenadas
fr: Systèmes de coordonnées
it: Sistemi di coordinate
ja: 座標系
pl: Układy współrzędnych
pt: Sistemas coordenados
ru: Системы координат
tr: Koordinat sistemleri
zh_cn: 坐标系

# createSimpleShapesToolStripMenuItem.ToolTipText
source: Circle or rectangle, optionally with rounded corners, optionally as a bag
ar: دائرة أو مستطيل ، اختياريا مع زوايا مدورة ، اختياريا كحقيبة
cs: Kruh nebo obdélník, volitelně se zaoblenými rohy, volitelně jako taška
de_de: Kreis oder Rechteck, optional mit abgerundenten Ecken, optional als Tasche
es: Círculo o rectángulo, opcionalmente con esquinas redondeadas, opcionalmente como una bolsa
fr: Cercle ou rectangle, éventuellement avec coins arrondis, éventuellement en sachet
it: Cerchio o rettangolo, a scelta con angoli arrotondati, a scelta come borsa
ja: 円形または長方形、オプションで丸い角、オプションでバッグとして
pl: Koło lub prostokąt, opcjonalnie z zaokrąglonymi rogami, opcjonalnie jako kieszeń
pt: Círculo ou retângulo, opcionalmente com cantos arredondados, opcionalmente como saco
ru: Круг или прямоугольник, опционально с закругленными углами, опционально как сумка
tr: Daire veya dikdörtgen, isteğe göre köşeleri yuvarlatılmış, isteğe bağlı olarak çanta olarak
zh_cn: 圆形或矩形，可选带圆角，可选作为袋

# saveToolStripMenuItem.Text
source: &Save G-Code
ar: حفظ G- كود
cs: &Uložit G-Code
de_de: &Speichere G-Code
es: Guardar G-Code
fr: Enregistrer le G-Code
it: &Salva codice G
ja: Gコードを保存
pl: Zapisz G-Code
pt: Salvar código G
ru: Сохранить G-Code
tr: &G Kodunu Kaydet
zh_cn: 保存G代码

# saveToolStripMenuItem.ToolTipText
source: Save displayed G-Code to a file
ar: احفظ G-Code المعروض في ملف
cs: Uložte zobrazený G-kód do souboru
de_de: Speichere G-Code aus dem Editor in eine Datei
es: Guardar el G-Code mostrado en un archivo
fr: Enregistrer le G-Code affiché dans un fichier
it: Salva il codice G visualizzato in un file
ja: 表示されたGコードをファイルに保存する
pl: Zapisz wyświetlony G-Code do pliku
pt: Salve o código G exibido em um arquivo
ru: Сохранить отображаемый G-Code в файл
tr: Görüntülenen G-Kodunu bir dosyaya kaydedin
zh_cn: 将显示的G代码保存到文件中

# setupToolStripMenuItem1.Text
source: Setup
ar: اقامة
cs: Založit
de_de: Einstellungen
es: Ajustes
fr: Installer
it: Impostare
ja: セットアップ
pl: Ustawienia
pt: Configuração
ru: Настроить
tr: Kurmak
zh_cn: 设置

# saveMachineParametersToolStripMenuItem.Text
source: &Export Machine Settings
ar: تصدير إعدادات الجهاز
cs: &Exportovat nastavení stroje
de_de: &Exportiere Maschinen Einstellungen
es: Exportar configuraciones de máquina
fr: Exporter les paramètres de la machine
it: &Esporta impostazioni macchina
ja: マシン設定のエクスポート
pl: Eksportuj ustawienia maszyny
pt: Exportar configurações da máquina
ru: Экспорт настроек машины
tr: &Makine Ayarlarını Dışa Aktar
zh_cn: 导出机器设置

# saveMachineParametersToolStripMenuItem.ToolTipText
source: Export GUI-Settings (Button definitions, Joystick parameters) to an INI-file
ar: تصدير إعدادات واجهة المستخدم الرسومية (تعريفات الزر ، معلمات عصا التحكم) إلى ملف INI
cs: Exportujte nastavení GUI (definice tlačítek, parametry joysticku) do souboru INI
de_de: Exportiere Programmeinstellungen (Button Definitionen, Joystick Parameter) in eine INI-Datei
es: Exportar configuraciones de programa (Definiciones de botones, Parámetros de joystick) a un archivo INI
fr: Exporter les paramètres du programme (Définitions des boutons, Paramètres du joystick) dans un fichier INI
it: Esporta le impostazioni della GUI (definizioni dei pulsanti, parametri del joystick) in un file INI
ja: GUI設定（ボタン定義、ジョイスティックパラメーター）をINIファイルにエクスポート
pl: Eksport ustawień GUI (definicje przycisków, parametry joysticka) do pliku INI
pt: Exportar configurações da GUI (definições de botões, parâmetros do joystick) para um arquivo INI
ru: Экспорт настроек программы (определения кнопок, параметр джойстика) в INI-файл
tr: GUI Ayarlarını (Düğme tanımları, Joystick parametreleri) bir INI dosyasına aktarın
zh_cn: 将程序设置（按钮定义，操纵杆参数）导出到INI文件

# rotate90ToolStripMenuItem.Text
source: Rotate +90° (ccw)
ar: تدوير + 90 درجة (ccw)
cs: Otočit o +90° (ccw)
de_de: Drehen um +90° (gegen Uhrzeiger)
es: Girar + 90 ° (en sentido antihorario)
fr: Rotation de + 90 ° (dans le sens antihoraire)
it: Ruota +90° (antiorario)
ja: + 90°回転（ccw）
pl: Obróć 90° w prawo
pt: Girar + 90 ° (ccw)
ru: Повернуть на + 90 ° (против часовой стрелки)
tr: +90° döndür (ccw)
zh_cn: 旋转+ 90°（逆时针）

# rotate90ToolStripMenuItem1.Text
source: Rotate -90° (cw)
ar: تدوير -90 درجة (cw)
cs: Otočit -90° (cw)
de_de: Drehen um -90° (Uhrzeiger)
es: Girar -90 ° (en sentido horario)
fr: Tourner de -90 ° (dans le sens des aiguilles d'une montre)
it: Ruota -90° (cw)
ja: -90°回転（cw）
pl: Obróć 90° w lewo
pt: Girar -90 ° (cw)
ru: Поворот на -90 ° (по часовой стрелке)
tr: -90° döndür (cw)
zh_cn: 旋转-90°（顺时针）

# rotate180ToolStripMenuItem.Text
source: Rotate 180°
ar: تدوير 180 درجة
cs: Otočit o 180°
de_de: 180 ° drehen
es: Girar 180 °
fr: Tourner à 180 °
it: Ruota di 180°
ja: 180°回転
pl: Obróć 180°
pt: Girar 180 °
ru: Повернуть на 180 °
tr: 180° döndür
zh_cn: 旋转180°

# rotateFreeToolStripMenuItem.Text
source: Rotate by ...°
ar: تدوير بواسطة ... °
cs: Otočit o ...°
de_de: Drehen um ...°
es: Rotar ... °
fr: Faire pivoter de ... °
it: Ruota di ...°
ja: ...°回転
pl: Dowolny obrót ...°
pt: Rodar em ... °
ru: Повернуть на ... °
tr: ...° döndür
zh_cn: 旋转...°

# rotaryDimaeterToolStripMenuItem.Text
source: Rotary diameter
ar: القطر الدوار
cs: Rotační průměr
de_de: Durchmesser der Drehachse
es: Diámetro eje rotativo
fr: Diamètre rotatif
it: Diametro rotativo
ja: 回転径
pl: Średnica obrotu
pt: Diâmetro rotativo
ru: Диаметр вращения
tr: Döner çap
zh_cn: 旋转直径

# rotaryDimaeterToolStripMenuItem.ToolTipText
source: Set Diameter of part for rotary axis
ar: تعيين قطر جزء للمحور الدوار
cs: Nastavte Průměr součásti pro rotační osu
de_de: Gebe den Durchmesser des Drehachsenwerkstücks an
es: Establecer diámetro de pieza para eje rotativo
fr: Définir le diamètre de la pièce pour l'axe rotatif
it: Impostare il diametro della parte per l'asse rotante
ja: 回転軸のパーツの直径を設定
pl: Ustawianie średnicy części dla osi obrotowej
pt: Definir diâmetro da peça para o eixo rotativo
ru: Задать диаметр детали для круговой оси
tr: Döner eksen için parça Çapını ayarlayın
zh_cn: 设置旋转轴零件直径

# removeAnyZMoveToolStripMenuItem.Text
source: Remove any Z move
ar: إزالة أي خطوة Z
cs: Odstraňte jakýkoli pohyb Z
de_de: Entferne jede Z Bewegung
es: Eliminar cualquier movimiento Z
fr: Supprimer tout mouvement Z
it: Rimuovi qualsiasi mossa Z
ja: Z移動を削除する
pl: Usuń wszystkie ruchy Z
pt: Remova qualquer movimento Z
ru: Удалить любое движение Z
tr: Herhangi bir Z hareketini kaldırın
zh_cn: 删除所有Z轴移动

# setupToolStripMenuItem.Text
source: DIY control
ar: السيطرة DIY
cs: DIY ovládání
de_de: DIY Steuerung
es: Control DIY
fr: Contrôle de bricolage
it: Controllo fai da te
ja: DIY制御
pl: Kontrolaf DIY
pt: Controle DIY
ru: DIY контроль
tr: kendin yap kontrolü
zh_cn: DIY控制

# setupToolStripMenuItem.ToolTipText
source: Setup GUI and import parameters
ar: إعداد واجهة المستخدم الرسومية واستيراد المعلمات
cs: Nastavení GUI a import parametrů
de_de: Öffne serielles Fenster für DIY Steuerung
es: Configurar GUI e importar parámetros
fr: Configurer l'interface graphique et les paramètres d'importation
it: Imposta la GUI e importa i parametri
ja: GUIのセットアップとパラメーターのインポート
pl: Ustawienie GUI i parametrów importu
pt: Configuração da GUI e parâmetros de importação
ru: Настройка графического интерфейса и параметров импорта
tr: GUI'yi kurun ve parametreleri içe aktarın
zh_cn: 设置GUI和导入参数

# machineToolStripMenuItem.Text
source: &Machine control
ar: و آلة التحكم
cs: &Ovládání stroje
de_de: &Maschine
es: Control de maquina
fr: Contrôle de la machine
it: &Controllo macchina
ja: 機械制御
pl: Maszyna
pt: Controle da máquina
ru: Управление машиной
tr: &Makine kontrolü
zh_cn: 机器控制

# virtualJoystickA.ToolTip
source: Jog 4th axis
ar: هرول المحور الرابع
cs: Jog 4. osa
de_de: 4. Achse bewegen
es: Jog 4to eje
fr: Jog 4ème axe
it: Jog 4° asse
ja: ジョグ4軸
pl: Posuw 4 osi
ru: Бег трусцой 4-й оси
tr: 4. ekseni hareket ettir
zh_cn: 点动第4轴

# virtualJoystickXY.ToolTip
source: Jog X and Y axis
ar: محور Jog X و Y
cs: Jog X a Y osa
de_de: Jog-XY-Achse
es: Jog eje X e Y
fr: Jogging des axes X et Y
it: Jog l'asse X e Y
ja: ジョグXおよびY軸
pl: Posuw osi X i Y
pt: Jog X e Y eixos
ru: Jog X и Y ось
tr: X ve Y eksenini hareket ettirin
zh_cn: 点动X和Y轴

# virtualJoystickZ.ToolTip
source: Jog Z axis
ar: هرول Z المحور
cs: Jog Z osa
de_de: Jog-Z-Achse
es: Jog eje Z
fr: Jog Z axe
it: Jog l'asse Z
ja: ジョグZ軸
pl: Posuw osi Z
tr: Z eksenini hareket ettir
zh_cn: 点动Z轴

# virtualJoystickB.ToolTip
source: Jog 4th axis
ar: هرول المحور الرابع
cs: Jog 4. osa
de_de: 4. Achse bewegen
es: Jog 4to eje
fr: Jog 4ème axe
it: Jog 4° asse
ja: ジョグ4軸
pl: Posuw 4 osi
ru: Бег трусцой 4-й оси
tr: 4. ekseni hareket ettir
zh_cn: 点动第4轴

# virtualJoystickC.ToolTip
source: Jog 4th axis
ar: هرول المحور الرابع
cs: Jog 4. osa
de_de: 4. Achse bewegen
es: Jog 4to eje
fr: Jog 4ème axe
it: Jog 4° asse
ja: ジョグ4軸
pl: Posuw 4 osi
ru: Бег трусцой 4-й оси
tr: 4. ekseni hareket ettir
zh_cn: 点动第4轴

# unDo2ToolStripMenuItem.Text
source: Undo last action
ar: التراجع عن آخر إجراء
cs: Vrátit zpět poslední akci
de_de: Letzte Aktion rückgängig machen
es: Deshacer la última acción
fr: Отменить последнее действие...
it: Annulla l'ultima azione
ja: 最後のアクションを元に戻す
pl: Cofnij ostatnią akcję
pt: Desfazer a última ação
ru: Отменить последнее действие
tr: Son işlemi geri al
zh_cn: 撤消上一个动作

# tBURL.Text
source: Paste URL of SVG / DXF file here
ar: لصق عنوان URL لملف SVG / DXF هنا
cs: Sem vložte adresu URL souboru SVG / DXF
de_de: Füge hier die URL der SVG-/DXF-Datei ein
es: Pegue la URL del archivo SVG / DXF aquí
fr: Collez l'URL du fichier SVG / DXF ici
it: Incolla qui l'URL del file SVG/DXF
ja: SVG / DXFファイルのURLをここに貼り付けてください
pl: Wklej tu URL pliku SVG / DXF
pt: Cole aqui o URL do arquivo SVG / DXF
ru: Вставьте URL файла SVG / DXF сюда
tr: SVG / DXF dosyasının URL'sini buraya yapıştırın
zh_cn: 在此处粘贴SVG / DXF文件的URL

# toolStripMenuItem2.Text
source: Open Recent File
ar: افتح الملف الأخير
cs: Otevřete Nedávný soubor
de_de: Zuletzt geöffnete Dateien
es: Abrir archivo reciente
fr: Ouvrir un fichier récent
it: Apri file recenti
ja: 最近使用したファイルを開く
pl: Otwórz ostatni plik
pt: Abrir arquivo recente
ru: Открыть недавний файл
tr: Son Dosyayı Aç
zh_cn: 打开最近的文件

# textWizzardToolStripMenuItem.Text
source: Create &Text
ar: إنشاء والنص
cs: Vytvořit &Text
de_de: Erzeuge &Text
es: Crear texto
fr: Créer du texte
it: Crea &testo
ja: テキストを作成
pl: Utwórz tekst
pt: Criar e texto
ru: Создать текст
tr: &Metin Oluştur
zh_cn: 创建文字

# unDoToolStripMenuItem.Text
source: Undo last action
ar: التراجع عن آخر إجراء
cs: Vrátit zpět poslední akci
de_de: Letzte Aktion rückgängig machen
es: Deshacer la última acción
fr: Отменить последнее действие...
it: Annulla l'ultima azione
ja: 最後のアクションを元に戻す
pl: Cofnij ostatnią akcję
pt: Desfazer a última ação
ru: Отменить последнее действие
tr: Son işlemi geri al
zh_cn: 撤消上一个动作

# sToolStripMenuItem.Text
source: Scale XY by ...%
ar: مقياس XY بواسطة ...٪
cs: Měřítko XY o...%
de_de: Skaliere XY um ...%
es: Escalar XY en ...%
fr: Échelle XY de ...%
it: Scala XY di ...%
ja: XYを...％スケーリング
pl: Skaluj XY o ...%
pt: Escala XY em ...%
ru: Масштаб XY на ...%
tr: XY'yi ...% oranında ölçeklendirin
zh_cn: XY缩放...％

# skalierenXYToolStripMenuItem.Text
source: Scale XY set X=... units
ar: تعيين مقياس XY X = ... وحدات
cs: Měřítko XY sada X=... jednotek
de_de: Skaliere XY auf X=... units
es: Escala XY set X = ... unidades
fr: Échelle XY définie X = ... unités
it: Scala XY imposta X=... unità
ja: スケールXYセットX = ...単位
pl: Skaluj XY ustaw X=... jednostek
pt: Escala XY configurada X = ... unidades
ru: Шкала XY установлена X = ... единиц
tr: Ölçek XY set X=... birimler
zh_cn: XY比例尺X = ...单位

# skalierenXYUmXUnitsZuErreichenToolStripMenuItem.Text
source: Scale XY set Y=... units
ar: تعيين مقياس XY Y = ... وحدات
cs: Měřítko XY nastaveno Y=... jednotek
de_de: Skaliere XY auf Y=... units
es: Escala XY set Y = ... unidades
fr: Échelle XY définie Y = ... unités
it: Scala XY imposta Y=... unità
ja: スケールXYセットY = ...単位
pl: Skaluj XY ustaw Y=... jednostek
pt: Escala XY definida Y = ... unidades
ru: Шкала XY установлена Y = ... единиц
tr: Ölçek XY set Y=... birimler
zh_cn: 比例尺XY设定Y = ...单位

# skaliereXUmToolStripMenuItem.Text
source: Scale X by ...%
ar: المقياس X بنسبة ...٪
cs: Měřítko X o ... %
de_de: Skaliere X um ...%
es: Escala X en ...%
fr: Échelle X de ...%
it: Scala X di ...%
ja: Xを...％スケーリング
pl: Skaluj X o ...%
pt: Escala X em ...%
ru: Масштаб X на ...%
tr: X'i ...% oranında ölçeklendirin
zh_cn: X缩放...％

# skaliereXUmToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# skaliereAufXUnitsToolStripMenuItem.Text
source: Scale X set X=... units
ar: مقياس X مجموعة X = ... وحدات
cs: Měřítko X sada X=... jednotek
de_de: Skaliere X auf X=... units
es: Escala X conjunto X = ... unidades
fr: Échelle X définie X = ... unités
it: Scala X set X=... unità
ja: スケールXセットX = ...単位
pl: Skaluj X ustaw X=... jednostek
pt: Escala X definir X = ... unidades
ru: Шкала X установлена X = ... единиц
tr: Ölçek X set X=... birimler
zh_cn: 比例尺X设定X = ...单位

# skaliereAufXUnitsToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# skaliereYUmToolStripMenuItem.Text
source: Scale Y by ...%
ar: مقياس Y بواسطة ...٪
cs: Měřítko Y o ... %
de_de: Skaliere Y um ...%
es: Escala Y en ...%
fr: Échelle Y de ...%
it: Scala Y di ...%
ja: Yを...％スケーリング
pl: Skaluj Y o ...%
pt: Escala Y em ...%
ru: Масштаб Y на ...%
tr: Y'yi ...% oranında ölçeklendirin
zh_cn: Y缩放...％

# skaliereYUmToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# skaliereAufYUnitsToolStripMenuItem.Text
source: Scale Y set Y=... units
ar: مقياس Y تعيين Y = ... وحدات
cs: Měřítko Y nastaveno Y=... jednotek
de_de: Skaliere Y auf Y= ... units
es: Escala Y set Y = ... unidades
fr: Échelle Y définie Y = ... unités
it: Scala Y imposta Y=... unità
ja: スケールYセットY = ...単位
pl: Skaluj Y ustaw Y=... jednostek
pt: Escala Y definida Y = ... unidades
ru: Шкала Y установлена Y = ... единиц
tr: Ölçek Y set Y=... birimler
zh_cn: 比例尺Y设定Y = ...单位

# skaliereAufYUnitsToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# skaliereXAufDrehachseToolStripMenuItem.Text
source: Scale X to ...° (Rotary axis)
ar: المقياس X إلى ... ° (المحور الدوار)
cs: Měřítko X na ...° (rotační osa)
de_de: Skaliere X auf ...° (Drehachse)
es: Escala X a ... ° (eje giratorio)
fr: Échelle de X à ... ° (axe rotatif)
it: Scala da X a ...° (Asse rotante)
ja: Xを...°にスケーリング（回転軸）
pl: Skaluj X do ...° (oś obrotowa)
pt: Escala X a ... ° (eixo rotativo)
ru: Шкала от Х до ... ° (круговая ось)
tr: X'i ...°'ye ölçeklendirin (Döner eksen)
zh_cn: X缩放至...°（旋转轴）

# skaliereXAufDrehachseToolStripMenuItem.ToolTipText
source: G2 / G3 are not supported
ar: G2 / G3 غير مدعوم
cs: G2 / G3 nejsou podporovány
de_de: G2 / G3 werden nicht unterstützt
es: G2 / G3 no son compatibles
fr: G2 / G3 ne sont pas supportés
it: G2 / G3 non sono supportati
ja: G2 / G3はサポートされていません
pl: G2 / G3 nie wspierane
pt: G2 / G3 não são suportados
ru: G2 / G3 не поддерживаются
tr: G2 / G3 desteklenmiyor
zh_cn: 不支持G2 / G3

# skaliereYAufDrehachseToolStripMenuItem.Text
source: Scale Y to ...° (Rotary axis)
ar: مقياس Y إلى ... ° (محور دوار)
cs: Měřítko Y na ...° (rotační osa)
de_de: Skaliere Y auf ...° (Drehachse)
es: Escala Y a ... ° (eje giratorio)
fr: Échelle Y à ... ° (axe rotatif)
it: Scala Y a ...° (Asse rotante)
ja: Yを...°にスケーリング（回転軸）
pl: Skaluj Y do ...° (oś obrotowa)
pt: Escale Y a ... ° (eixo rotativo)
ru: Шкала от Y до ... ° (круговая ось)
tr: Y'yi ...°'ye ölçeklendirin (Döner eksen)
zh_cn: 将Y缩放为...°（旋转轴）
