Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# cmsCodePasteSpecial2.AccessibleDescription
source: Insert "Pen down" G-Code in front of current line
ar: أدخل "Pen down" G-Code أمام السطر الحالي
cs: Před aktuální řádek vložte G-kód „Per down“.
de_de: Fügt den G-Code "Pen down" vor die aktuelle Zeile ein
es: Inserte el código G "Pen down" delante de la línea actual
fr: Insérez le G-Code "Pen down" devant la ligne actuelle
it: Inserisci il codice G "Pen down" davanti alla riga corrente
ja: 現在の行の前に「ペンダウン」Gコードを挿入します
pl: Wstaw 'Pen-Down' na początku bieżacej linii
pt: Insira o código G "Pen down" na frente da linha atual
ru: Вставьте G-код "Pen down" перед текущей строкой
tr: Geçerli satırın önüne "Kalem aşağı" G-Kodunu ekleyin
zh_cn: 在当前行的前面插入“落笔” G代码

# cmsFindDialog.AccessibleDescription
source: Open "Find Dialog" from "Fast Colored Text Box"
ar: افتح "مربع حوار البحث" من "مربع نص ملون سريع"
cs: Otevřete „Dialog Najít“ z „Rychle barevné textové pole“
de_de: Öffnet "Dialogfeld suchen"
es: Abra "Buscar diálogo" desde "Cuadro de texto de color rápido"
fr: Ouvrez "Find Dialog" dans "Fast Colored Text Box"
it: Apri "Finestra di dialogo Trova" da "Casella di testo colorata veloce"
ja: 「高速カラーテキストボックス」から「検索ダイアログ」を開く
pl: Otwóz dialog wyszukiwania z "Szybkiego kolorowego pola tekstowego"
pt: Abra "Localizar caixa de diálogo" em "Caixa de texto colorida rápida"
ru: Откройте «Найти диалог» из «Быстро окрашенного текстового поля»
tr: "Hızlı Renkli Metin Kutusu"ndan "Bul Diyalogu"nu açın
zh_cn: 从“快速彩色文本框”中打开“查找对话框”

# cmsReplaceDialog.AccessibleDescription
source: Open "Replace Dialog" from "Fast Colored Text Box"
ar: فتح "استبدال مربع حوار" من "مربع نص ملون سريع"
cs: Otevřete "Nahradit dialog" z "Rychle barevné textové pole"
de_de: Öffnt "Dialogfeld ersetzen"
es: Abra "Reemplazar cuadro de diálogo"
fr: Ouvrez "Remplacer la boîte de dialogue"
it: Apri "Finestra di dialogo Sostituisci" da "Casella di testo colorata veloce"
ja: 「高速カラーテキストボックス」から「置換ダイアログ」を開く
pl: Otwóz dialog wyszukiwania i zmiany z "Szybkiego kolorowego pola tekstowego"
pt: Abra "Substituir caixa de diálogo"
ru: Откройте «Заменить диалог» из «Быстро окрашенного текстового поля»
tr: "Hızlı Renkli Metin Kutusu"ndan "Değiştir İletişim Kutusunu" açın
zh_cn: 从“彩色文本框”打开“替换对话框”

# cmsUpdate2DView.AccessibleDescription
source: Process G-Code from editor to update 2D-View
ar: معالجة G-Code من المحرر لتحديث 2D-View
cs: Zpracujte G-Code z editoru a aktualizujte 2D-View
de_de: G-Code neu vom Editor einlesen, um die 2D-Ansicht zu aktualisieren
es: Lea el código G nuevamente desde el editor para actualizar la vista 2D
fr: Relisez le code G depuis l'éditeur pour mettre à jour la vue 2D
it: Elabora il codice G dall'editor per aggiornare 2D-View
ja: エディターから再度Gコードを読み取り、2Dビューを更新します
pl: Przetwórz G-Code z edytora, aby zaktualizować widok 2D
pt: Leia o código G novamente no editor para atualizar a visualização 2D
ru: Снова прочитайте G-код из редактора, чтобы обновить 2D-вид.
tr: 2D-View'u güncellemek için editörden G-Code'u işleyin
zh_cn: 再次从编辑器中读取G代码以更新2D视图

# toolStripStatusLabel0.Text
source: [ Load file via drag and drop to 2D-view or select 'Reload File' (right click on 2D-view) to open last used file. ]
ar: [تحميل الملف عن طريق السحب والإفلات أو فتح ملف الحوار. أو حدد "إعادة تحميل الملف" لفتح آخر ملف مستخدم. ]
cs: [ Načtěte soubor přetažením do 2D zobrazení nebo vyberte 'Znovu načíst soubor' (klikněte pravým tlačítkem na 2D zobrazení) a otevřete naposledy použitý soubor. ]
de_de: [Datei per Drag & Drop laden oder Datei öffnen. Oder wählen Sie 'Datei neu laden', um die zuletzt verwendete Datei zu öffnen. ]
es: [Cargar archivo mediante arrastrar y soltar o abrir el cuadro de diálogo. O seleccione 'Recargar archivo' para abrir el último archivo utilizado. ]
fr: [Charger le fichier par glisser-déposer ou boîte de dialogue d'ouverture de fichier. Ou sélectionnez «Recharger le fichier» pour ouvrir le dernier fichier utilisé. ]
it: [ Carica il file trascinandolo nella vista 2D o seleziona 'Ricarica file' (fai clic con il pulsante destro del mouse sulla vista 2D) per aprire l'ultimo file utilizzato. ]
ja: [ドラッグアンドドロップまたはファイルを開くダイアログでファイルをロードします。 または、「ファイルの再読み込み」を選択して、最後に使用したファイルを開きます。 ]
pl: [Załaduj plik metodą "przeciągnij i upuść" do widoku 2D lub wybierz "Przeładuj plik" (kliknij prawym przyciskiem myszy na widoku 2D), aby otworzyć ostatnio używany plik.]
pt: [Carregar arquivo via arrastar e soltar ou caixa de diálogo de abertura de arquivo. Ou selecione 'Recarregar arquivo' para abrir o último arquivo usado. ]
ru: Загрузить файл с помощью перетаскивания или открытия файла. Или выберите «Перезагрузить файл», чтобы открыть последний использованный файл. ]
tr: [ Dosyayı sürükleyip bırakarak 2B görünüme yükleyin veya son kullanılan dosyayı açmak için 'Dosyayı Yeniden Yükle'yi seçin (2B görünüme sağ tıklayın). ]
zh_cn: [通过拖放或文件打开对话框加载文件。 或选择“重新加载文件”以打开上次使用的文件。 ]

# copyContentTroClipboardToolStripMenuItem.Text
source: Copy content to Clipboard
ar: نسخ المحتوى إلى الحافظة
cs: Zkopírujte obsah do schránky
de_de: Kopiert den Inhalt in die Zwischenablage
es: Copiar contenido al portapapeles
fr: Copier le contenu dans le presse-papiers
it: Copia il contenuto negli Appunti
ja: コンテンツをクリップボードにコピー
pl: Kopiuj zawartość do schowka
pt: Copiar conteúdo para a área de transferência
ru: Скопируйте содержимое в буфер обмена
tr: İçeriği Panoya kopyala
zh_cn: 将内容复制到剪贴板

# createBarcodeToolStripMenuItem.Text
source: Create Barcode
ar: إنشاء الباركود
cs: Vytvořte čárový kód
de_de: Barcode erstellen
es: Crear código de barras
fr: Créer un code-barres
it: Crea codice a barre
ja: バーコードを作成
pl: Utwórz kod kreskowy
pt: Criar código de barras
ru: Создать штрих-код
tr: Barkod Oluştur
zh_cn: 创建条形码/二维码

# cmsCodeBlocksSortByDistance.Text
source: Sort by Distance
ar: فرز حسب المسافة
cs: Seřadit podle Vzdálenost
de_de: Nach Entfernung sortieren
es: Ordenar por distancia
fr: Trier par distance
it: Ordina per distanza
ja: 距離で並べ替え
pl: Sortuj wg dystansu
pt: Classificar por distância
ru: Сортировать по расстоянию
tr: Mesafeye Göre Sırala
zh_cn: 按距离排序

# cmsPicBoxReverseSelectedPath.Text
source: Reverse selected path
ar: عكس / تدوير المسار المحدد
cs: Obrátit vybranou cestu
de_de: Ausgewählten Pfad umkehren / drehen
es: Invertir / Girar la ruta seleccionada
fr: Inverser / faire pivoter le chemin sélectionné
it: Inverti il ​​percorso selezionato
ja: 選択したパスを反転/回転
pl: Odwróć wybraną ścieżkę
pt: Inverter / girar o caminho selecionado
ru: Обратить / повернуть выбранный путь
tr: Seçilen yolu ters çevir
zh_cn: 反转/旋转所选路径

# sortByPenWidthToolStripMenuItem.Text
source: Sort by 'Pen Width'
ar: فرز حسب "عرض القلم"
cs: Seřadit podle 'Šířka pera'
de_de: Sortieren nach 'Stiftbreite'
es: Ordenar por 'Ancho de la pluma'
fr: Trier par "Largeur du stylo"
it: Ordina per "Larghezza penna"
ja: 「ペン幅」で並べ替え
pl: Sortuj wg 'Pen width'
pt: Classificar por 'largura da caneta'
ru: Сортировать по ширине пера
tr: 'Kalem Genişliği'ne göre sırala
zh_cn: 按“笔宽”排序

# sortByLayerToolStripMenuItem.Text
source: Sort by 'Layer'
ar: الترتيب حسب "الطبقة"
cs: Seřadit podle 'Vrstva'
de_de: Sortieren nach 'Ebene'
es: Ordenar por 'capa'
fr: Trier par «couche»
it: Ordina per "Livello"
ja: 「レイヤー」で並べ替え
pl: Sortuj wg 'Layer'
pt: Classificar por 'Camada'
ru: Сортировать по слою
tr: 'Katman'a göre sırala
zh_cn: 按“图层”排序

# sortByTypeToolStripMenuItem.Text
source: Sort by 'Type'
ar: فرز حسب "النوع"
cs: Seřadit podle 'Typ'
de_de: Sortieren nach 'Typ'
es: Ordenar por 'Tipo'
fr: Trier par 'Type'
it: Ordina per 'Tipo'
ja: 「タイプ」で並べ替え
pl: Sortuj wg 'Type'
pt: Classificar por 'Tipo'
ru: Сортировать по типу
tr: 'Tür'e göre sırala
zh_cn: 按“线型”排序

# exitToolStripMenuItem.Text
source: Exit
ar: خروج
cs: Výstup
de_de: Beenden
es: Salida
fr: Sortie
it: Uscita
ja: 出口
pl: Wyjście
pt: Saída
ru: Выход
tr: çıkış
zh_cn: 退出

# BtnOverrideD3.ToolTip
source: Shows status of D3 pin (grbl-Mega-5X), on click send 'M64 P3 (on)' or 'M65 P3 (off)' depending on status
ar: يعرض حالة D3 pin (grbl-Mega-5X) ، عند النقر فوق إرسال "M64 P3 (تشغيل)" أو "M65 P3 (إيقاف)" اعتمادًا على الحالة
cs: Zobrazuje stav pinu D3 (grbl-Mega-5X), kliknutím odešlete „M64 P3 (on)“ nebo „M65 P3 (off)“ v závislosti na stavu
de_de: Zeigt den Status des D3-Pins (grbl-Mega-5X), beim Klicken senden Sie 'M64 P3 (on)' oder 'M65 P3 (off)' je nach Status
es: Muestra el estado del pin D3 (grbl-Mega-5X), al hacer clic en enviar 'M64 P3 (encendido)' o 'M65 P3 (apagado)' según el estado
fr: Affiche l'état de la broche D3 (grbl-Mega-5X), en cliquant sur envoyer 'M64 P3 (on)' ou 'M65 P3 (off)' selon l'état
it: Mostra lo stato del pin D3 (grbl-Mega-5X), facendo clic su invia 'M64 P3 (on)' o 'M65 P3 (off)' a seconda dello stato
ja: D3ピン（grbl-Mega-5X）のステータスを表示します。クリックすると、ステータスに応じて「M64 P3（オン）」または「M65P3（オフ）」を送信します。
pl: Pokazuje stan pinu D3 (grbl-Mega-5X), po kliknięciu wysyła 'M64 P3 (on)' lub 'M65 P3 (off)' w zależności od stanu
pt: Mostra o status do pino D3 (grbl-Mega-5X), ao clicar em enviar 'M64 P3 (ligado)' ou 'M65 P3 (desligado)' dependendo do status
ru: Показывает состояние контакта D3 (grbl-Mega-5X), при нажатии отправляется 'M64 P3 (on)' или 'M65 P3 (off)' в зависимости от статуса
tr: D3 pininin (grbl-Mega-5X) durumunu gösterir, duruma göre 'M64 P3 (açık)' veya 'M65 P3 (kapalı)' gönder seçeneğine tıklayın
zh_cn: 显示 D3 引脚 (grbl-Mega-5X) 的状态，根据状态点击发送“M64 P3（开）”或“M65 P3（关）”

# BtnOverrideD2.ToolTip
source: Shows status of D2 pin (grbl-Mega-5X), on click send 'M64 P2 (on)' or 'M65 P2 (off)' depending on status
ar: يعرض حالة D2 pin (grbl-Mega-5X) ، عند النقر فوق إرسال "M64 P2 (تشغيل)" أو "M65 P2 (إيقاف)" اعتمادًا على الحالة
cs: Zobrazuje stav pinu D2 (grbl-Mega-5X), kliknutím odešlete „M64 P2 (on)“ nebo „M65 P2 (off)“ v závislosti na stavu
de_de: Zeigt den Status des D2-Pins (grbl-Mega-5X), beim Klicken senden Sie 'M64 P2 (on)' oder 'M65 P2 (off)' je nach Status
es: Muestra el estado del pin D2 (grbl-Mega-5X), al hacer clic en enviar 'M64 P2 (encendido)' o 'M65 P2 (apagado)' según el estado
fr: Affiche l'état de la broche D2 (grbl-Mega-5X), en cliquant sur envoyer 'M64 P2 (on)' ou 'M65 P2 (off)' selon l'état
it: Mostra lo stato del pin D2 (grbl-Mega-5X), facendo clic su invia 'M64 P2 (on)' o 'M65 P2 (off)' a seconda dello stato
ja: D2ピン（grbl-Mega-5X）のステータスを表示します。クリックすると、ステータスに応じて「M64 P2（オン）」または「M65P2（オフ）」を送信します。
pl: Pokazuje stan pinu D2 (grbl-Mega-5X), po kliknięciu wysyła 'M64 P2 (on)' lub 'M65 P2 (off)' w zależności od stanu
pt: Mostra o status do pino D2 (grbl-Mega-5X), ao clicar em enviar 'M64 P2 (ligado)' ou 'M65 P2 (desligado)' dependendo do status
ru: Показывает состояние контакта D2 (grbl-Mega-5X), при нажатии отправляется «M64 P2 (вкл.)» Или «M65 P2 (выкл.)» В зависимости от статуса
tr: D2 pininin (grbl-Mega-5X) durumunu gösterir, duruma bağlı olarak 'M64 P2 (açık)' veya 'M65 P2 (kapalı)' gönder üzerine tıklayın
zh_cn: 显示 D2 引脚 (grbl-Mega-5X) 的状态，根据状态点击发送“M64 P2（开）”或“M65 P2（关）”

# BtnOverrideD1.ToolTip
source: Shows status of D1 pin (grbl-Mega-5X), on click send 'M64 P1 (on)' or 'M65 P1 (off)' depending on status
ar: يعرض حالة D1 pin (grbl-Mega-5X) ، عند النقر فوق إرسال "M64 P1 (تشغيل)" أو "M65 P1 (إيقاف)" اعتمادًا على الحالة
cs: Zobrazuje stav pinu D1 (grbl-Mega-5X), kliknutím odešlete „M64 P1 (on)“ nebo „M65 P1 (off)“ v závislosti na stavu
de_de: Zeigt den Status des D1-Pins (grbl-Mega-5X), beim Klicken senden Sie 'M64 P1 (on)' oder 'M65 P1 (off)' je nach Status
es: Muestra el estado del pin D1 (grbl-Mega-5X), al hacer clic en enviar 'M64 P1 (encendido)' o 'M65 P1 (apagado)' según el estado
fr: Affiche l'état de la broche D1 (grbl-Mega-5X), en cliquant sur envoyer 'M64 P1 (on)' ou 'M65 P1 (off)' selon l'état
it: Mostra lo stato del pin D1 (grbl-Mega-5X), facendo clic su invia 'M64 P1 (on)' o 'M65 P1 (off)' a seconda dello stato
ja: D1ピン（grbl-Mega-5X）のステータスを表示します。クリックすると、ステータスに応じて「M64 P1（オン）」または「M65P1（オフ）」を送信します。
pl: Pokazuje stan pinu D1 (grbl-Mega-5X), po kliknięciu wysyła 'M64 P1 (on)' lub 'M65 P1 (off)' w zależności od stanu
pt: Mostra o status do pino D1 (grbl-Mega-5X), ao clicar em enviar 'M64 P1 (ligado)' ou 'M65 P1 (desligado)' dependendo do status
ru: Показывает состояние вывода D1 (grbl-Mega-5X), при нажатии отправляется 'M64 P1 (on)' или 'M65 P1 (off)' в зависимости от статуса
tr: D1 pininin (grbl-Mega-5X) durumunu gösterir, duruma göre 'M64 P1 (açık)' veya 'M65 P1 (kapalı)' gönder seçeneğine tıklayın
zh_cn: 显示 D1 引脚 (grbl-Mega-5X) 的状态，根据状态点击发送“M64 P1（开）”或“M65 P1（关）”

# BtnOverrideD0.ToolTip
source: Shows status of D0 pin (grbl-Mega-5X), on click send 'M64 P0 (on)' or 'M65 P0 (off)' depending on status
ar: يعرض حالة D0 pin (grbl-Mega-5X) ، عند النقر فوق إرسال "M64 P0 (on)" أو "M65 P0 (off)" اعتمادًا على الحالة
cs: Zobrazuje stav kolíku D0 (grbl-Mega-5X), kliknutím odešlete „M64 P0 (zapnuto)“ nebo „M65 P0 (vypnuto)“ v závislosti na stavu
de_de: Zeigt den Status des D0-Pins (grbl-Mega-5X), beim Klicken senden Sie 'M64 P0 (on)' oder 'M65 P0 (off)' je nach Status
es: Muestra el estado del pin D0 (grbl-Mega-5X), al hacer clic en enviar 'M64 P0 (encendido)' o 'M65 P0 (apagado)' según el estado
fr: Affiche l'état de la broche D0 (grbl-Mega-5X), en cliquant sur envoyer 'M64 P0 (on)' ou 'M65 P0 (off)' selon l'état
it: Mostra lo stato del pin D0 (grbl-Mega-5X), facendo clic su invia 'M64 P0 (on)' o 'M65 P0 (off)' a seconda dello stato
ja: D0ピン（grbl-Mega-5X）のステータスを表示します。クリックすると、ステータスに応じて「M64 P0（オン）」または「M65P0（オフ）」を送信します。
pl: Pokazuje stan pinu D0 (grbl-Mega-5X), po kliknięciu wysyła 'M64 P0 (on)' lub 'M65 P0 (off)' w zależności od stanu
pt: Mostra o status do pino D0 (grbl-Mega-5X), ao clicar em enviar 'M64 P0 (ligado)' ou 'M65 P0 (desligado)' dependendo do status
ru: Показывает состояние вывода D0 (grbl-Mega-5X), при нажатии отправляется 'M64 P0 (on)' или 'M65 P0 (off)' в зависимости от статуса
tr: D0 pininin (grbl-Mega-5X) durumunu gösterir, duruma göre 'M64 P0 (açık)' veya 'M65 P0 (kapalı)' gönder seçeneğine tıklayın
zh_cn: 显示 D0 引脚 (grbl-Mega-5X) 的状态，根据状态点击发送“M64 P0（开）”或“M65 P0（关）”

# cmsPicBoxRotateSelectedPath.Text
source: Rotate selected path
ar: تدوير المسار المحدد
cs: Otočit vybranou cestu
de_de: Ausgewählten Pfad drehen
es: Girar la ruta seleccionada
fr: Faire pivoter le chemin sélectionné
it: Ruota il percorso selezionato
ja: 選択したパスを回転します
pl: Obróć wybraną ścieżkę
pt: Girar caminho selecionado
ru: Повернуть выбранный путь
tr: Seçilen yolu döndür
zh_cn: 旋转所选路径

# jogPathCreatorToolStripMenuItem.Text
source: Jog path creator
ar: الخالق مسار الركض
cs: Tvůrce běžecké cesty
de_de: Jog-Pfad-Ersteller
es: Creador de Jog Path
fr: Créateur de parcours de jogging
it: Creatore di percorsi di jogging
ja: ジョグパスクリエーター
pl: Kreator ścieżki posuwu
pt: Criador de jog path
ru: Создатель пути для бега трусцой
tr: Yürüyüş yolu yaratıcısı
zh_cn: 点动路径创建器

# LanguageToolStripMenuItem3.Text
source: Language
ar: لغة
cs: Jazyk
de_de: Sprache
es: Idioma
fr: Idioma
ja: 言語
pl: Język
pt: Língua
ru: Язык
tr: Dil
zh_cn: 语言

# cBMoveG0.ToolTip
source: Use G0 rappid move command - STOP jogging will not work
ar: استخدم أمر النقل السريع G0 - لن يعمل إيقاف الركض
cs: Použijte příkaz rychlého pohybu G0 - STOP jogging nebude fungovat
de_de: Verwendet den G0-Schnellbewegungsbefehl - STOP-Joggen funktioniert nicht
es: Use el comando de movimiento rápido G0 - STOP jogging no funcionará
fr: Utilisez la commande de déplacement rapide G0 - STOP jogging ne fonctionnera pas
it: Utilizzare il comando di spostamento rapido G0 - STOP jogging non funzionerà
ja: G0 rappidmoveコマンドを使用します-STOPジョギングは機能しません
pl: Użyj polecenia G0 rapid move - 'ZATRZYMAJ bieg' nie będzie działać
pt: Use o comando de movimento rápido G0 - STOP jogging não funcionará
ru: Используйте команду быстрого перемещения G0 — толчковый режим STOP не будет работать.
tr: G0 hızlı hareket komutunu kullanın - hızlı hareket DURDUR çalışmaz
zh_cn: 使用 G0 快速移动命令执行按钮内的命令 - STOP jogging 将不起作用

# CbSpindle.Text
source: Spindle On
ar: المغزل CW
cs: Vřeteno CW
it: Mandrino acceso
ja: スピンドルCW
pl: Wrzec. wł.
ru: Шпиндель
tr: Mil Açık
zh_cn: 主轴启动

# CbCoolant.Text
source: Coolant
ar: المبرد
cs: Chladicí kapalina
de_de: Kühlmittel
es: Refrigerante
it: Liquido di raffreddamento
ja: クーラント
pl: Chłodziwo
pt: Ativar Refrigerante
tr: soğutma sıvısı
zh_cn: 冷却液

# CbTool.Text
source: Tool is in Spindle
ar: الأداة في المغزل
cs: Nástroj je ve vřetenu
es: Herr. en husillo
it: L'utensile è nel mandrino
ja: ツールはスピンドルにあります
pl: Narz. we wrzec.
pt: Ferramenta no Eixo
ru: Инструмент в шпинделе
tr: Takım Milde
zh_cn: 刀具在主轴中

# BtnPenUp.Text
source: Pen Up
ar: قلم لأعلى
it: Penna su
ja: ペンアップ
tr: Kalem Yukarı
zh_cn: 抬笔

# BtnPenUp.ToolTip
source: Use settings from Setup-Servo-PWM
ar: استخدم الإعدادات من Setup-Servo-PWM
cs: Použijte nastavení z Setup-Servo-PWM
de_de: Verwendung der Einstellungen von Setup-Servo-PWM
es: Use la configuración de Setup-Servo-PWM
fr: Utiliser les paramètres de Setup-Servo-PWM
it: Utilizzare le impostazioni da Setup-Servo-PWM
ja: Setup-Servo-PWMの設定を使用する
pl: Użyj ustawień z Setup-Servo-PWM
pt: Use as configurações do Setup-Servo-PWM
ru: Используйте настройки из Setup-Servo-PWM
tr: Setup-Servo-PWM'deki ayarları kullanın
zh_cn: 使用Setup-Servo-PWM中的设置

# BtnPenDown.Text
source: Pen Down
ar: القلم لأسفل
it: Penna giù
ja: ペンダウン
tr: Kalem Aşağı
zh_cn: 落笔

# BtnPenDown.ToolTip
source: Use settings from Setup-Servo-PWM
ar: استخدم الإعدادات من Setup-Servo-PWM
cs: Použijte nastavení z Setup-Servo-PWM
de_de: Verwendung der Einstellungen von Setup-Servo-PWM
es: Use la configuración de Setup-Servo-PWM
fr: Utiliser les paramètres de Setup-Servo-PWM
it: Utilizzare le impostazioni da Setup-Servo-PWM
ja: Setup-Servo-PWMの設定を使用する
pl: Użyj ustawień z Setup-Servo-PWM
pt: Use as configurações do Setup-Servo-PWM
ru: Используйте настройки из Setup-Servo-PWM
tr: Setup-Servo-PWM'deki ayarları kullanın
zh_cn: 使用Setup-Servo-PWM中的设置

# tabPage1.Text
source: Router
ar: جهاز التوجيه
cs: Směrovač
es: enrutador
fr: Routeur
ja: ルーター
pt: Roteador
ru: Маршрутизатор
tr: Yönlendirici
zh_cn: 雕刻

# label9.Text
source: Applies values of enabled Pen -up/ -down translation for Z and PWM
ar: يطبق قيم ترجمة Pen -up / -down الممكّنة لـ Z و PWM
cs: Použije hodnoty povoleného překladu perem nahoru / dolů pro Z a PWM
de_de: Wendet Werte der aktivierten Pen-Up/-Down-Übersetzung für Z und PWM an
es: Aplica valores de traducción de Pen-up/-down habilitada para Z y PWM
fr: Applique les valeurs de la traduction Pen -up / -down activée pour Z et PWM
it: Applica i valori della conversione Pen -up/ -down abilitata per Z e PWM
ja: ZおよびPWMに対して有効なペンアップ/ダウン変換の値を適用します
pl: Stosuje wartości włączonej translacji 'Pen-Up/-Down' dla Z i PWM
pt: Aplica valores de tradução Pen-up/-down habilitada para Z e PWM
ru: Применяет значения включенного перевода пера вверх/вниз для Z и ШИМ.
tr: Z ve PWM için etkin Pen -up/ -down çevirisinin değerlerini uygular
zh_cn: 为 Z 和 PWM 应用启用的笔向上/向下转换的值

# BtnPenZero.Text
source: Pen Zero
ar: القلم صفر
it: Penna Zero
ja: ペンゼロ
tr: Kalem Sıfır
zh_cn: 回零

# tabPage2.Text
source: Plotter
ar: متآمر
es: Trazador
fr: Traceur
ja: プロッタ
pl: Ploter
pt: Plotadora
ru: Плоттер
tr: çizici
zh_cn: 绘图

# CbLasermode.Text
source: Laser mode
ar: وضع الليزر
cs: Laserový režim
de_de: Lasermodus
es: Modo láser
fr: Mode laser
it: Modalità laser
ja: レーザーモード
pl: Tryb lasera
pt: Modo laser
ru: Лазерный режим
tr: lazer modu
zh_cn: 激光模式

# RbLaserM4.Text
source: M4 Dynamic pwr.
ar: M4 ديناميكي PWR.
de_de: M4 Dynamisch
es: M4 Potencia dinámica.
fr: Alimentation dynamique M4
it: M4 Dinamica pwr.
ja: M4動的電源。
pl: M4 Dynamiczna moc
pt: M4 Dinâmico Pwr.
ru: M4 Динамическая мощность.
tr: M4 Dinamik güç
zh_cn: M4 动态电源

# RbLaserM3.Text
source: M3 Constant pwr.
ar: M3 ثابت pwr.
cs: M3 Konstantní pwr.
de_de: M3 Konstant
es: M3 Potencia constante
fr: M3 Puissance constante
it: M3 pwr.
ja: M3定数電源。
pl: M3 Stała moc
pt: M3 constante pwr.
ru: M3 Постоянная мощность.
tr: M3 Sabit güç
zh_cn: M3 恒定功率

# CbLaser.Text
source: Laser On
ar: الليزر في
cs: Laser zapnutý
de_de: Laser an
es: láser encendido
fr: Laser activé
it: Laser acceso
ja: レーザーオン
pl: Laser wł.
pt: Laser ligado
ru: Лазер включен
tr: Lazer Açık
zh_cn: 激光开启

# tabPage3.Text
source: Laser
ar: الليزر
es: Láser
ja: レーザ
ru: Лазер
tr: Lazer
zh_cn: 激光

# control3rdGRBLToolStripMenuItem.Text
source: Control 3rd serial COM
ar: التحكم الثالث المسلسل COM
it: Controllo 3a COM seriale
ja: 3番目のシリアルCOMを制御する
pl: Kontrola trzeciego portu szeregowego COM
ru: Управление 3-м серийным COM
tr: 3. seri COM'u kontrol edin
zh_cn: 控制第 3 个COM口

# gB_Jog0.Text
source: Move to
ar: الانتقال إلى
cs: Přesunout do
es: Mover a
fr: Déménager à
it: Sposta a
ja: へ引っ越す
pl: Idź do
pt: Mover para
ru: Перейти к
tr: Taşınmak
zh_cn: 移动到

# btnResume.Text
source: Resume
ar: استئنف
cs: Životopis
es: Continuar
ja: 履歴書
pl: Wznów
pt: Continua
ru: Резюме
tr: Sürdürmek
zh_cn: 恢复

# btnFeedHold.Text
source: Feed Hold
ar: تغذية تعليق
cs: Zastavení podávání
es: Pausa
ja: フィードホールド
pl: Wstrzymaj posuw
pt: Pause
ru: Остановить подачу
tr: Besleme Bekletme
zh_cn: 进给保持

# btnKillAlarm.Text
source: Kill Alarm
ar: اقتل المنبه
ja: キルアラーム
pt: Destrava
ru: Снять тревогу
tr: Alarmı Kapat
zh_cn: 清除警报

# btnReset.Text
source: RESET
ar: إعادة تعيين
cs: RESETOVAT
ja: リセット
ru: СБРОС
zh_cn: 重置

# CbAddGraphic.Text
source: Add imported graphic to 2D-view
ar: أضف الرسم الذي تم استيراده إلى طريقة العرض ثنائية الأبعاد
cs: Přidejte importovanou grafiku do 2D zobrazení
de_de: Importierte Grafik zur 2D-Ansicht hinzufügen
es: Agregar gráfico importado a la vista 2D
fr: Ajouter un graphique importé à la vue 2D
it: Aggiungi grafica importata alla vista 2D
ja: インポートしたグラフィックを2Dビューに追加
pl: Dodaj zaimportowaną grafikę do widoku 2D
pt: Adicionar gráfico importado à visualização 2D
ru: Добавить импортированную графику в 2D-просмотр
tr: 2B görünüme içe aktarılan grafiği ekleyin
zh_cn: 将导入的图形添加到 2D 视图

# createJogPathToolStripMenuItem.Text
source: Create Jog path
ar: قم بإنشاء مسار للركض
cs: Vytvořte Jog cestu
de_de: Jog-Pfad erstellen
es: Crear ruta de desplazamiento
fr: Créer un chemin Jog
it: Crea percorso Jog
ja: ジョグパスを作成する
pl: Utwórz ścieżkę posuwu
pt: Criar caminho de jog
ru: Создать беговую дорожку
tr: Yürüyüş yolu oluştur
zh_cn: 创建Jog路径

# laserToolsToolStripMenuItem.ToolTipText
source: Tool to find best laser settings
ar: أداة للعثور على أفضل إعدادات الليزر
cs: Nástroj pro nalezení nejlepšího nastavení laseru
de_de: Tool zum Finden der besten Lasereinstellungen
es: Herramienta para encontrar la mejor configuración de láser
fr: Outil pour trouver les meilleurs réglages laser
it: Strumento per trovare le migliori impostazioni del laser
ja: 最適なレーザー設定を見つけるためのツール
pl: Narzędzie do wyszukiwania najlepszych ustawień lasera
pt: Ferramenta para encontrar as melhores configurações de laser
ru: Инструмент для поиска лучших настроек лазера
tr: En iyi lazer ayarlarını bulmak için araç
zh_cn: 寻找最佳激光设置的工具

# coordinateSystemsToolStripMenuItem.ToolTipText
source: Check and control all grbl coordinates
ar: فحص جميع إحداثيات grbl والتحكم فيها
cs: Zkontrolujte a kontrolujte všechny grbl souřadnice
de_de: Überprüfen und kontrollieren aller grbl-Koordinaten
es: Comprueba y controla todas las coordenadas grbl
fr: Vérifier et contrôler toutes les coordonnées grbl
it: Controlla e controlla tutte le coordinate grbl
ja: すべてのgrbl座標を確認および制御します
pl: Sprawdź i skontroluj wszystkie współrzędne GRBL
pt: Verifique e controle todas as coordenadas grbl
ru: Проверяйте и контролируйте все координаты grbl
tr: Tüm grbl koordinatlarını kontrol edin ve kontrol edin
zh_cn: 检查和控制所有 grbl 坐标
