Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GUI/MainForm.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# btnFeedHold.ToolTip
source: The feed hold command '!' will bring the active cycle to a stop via a controlled deceleration, so as not to lose position. It is also real-time and may be activated at any time. Once finished or paused, Grbl will wait until a cycle start command is issued to resume the program. Feed hold can only pause a cycle and will not affect homing or any other process. If you need to stop a cycle mid-program and can't afford losing position, perform a feed hold to have Grbl bring everything to a controlled stop. Once finished, you can then issue a reset. Always try to execute a feed hold whenever the machine is running before hitting reset, except of course if there is some emergency situation.
ar: أمر تعليق التغذية '!' سيؤدي إلى توقف الدورة النشطة عن طريق التباطؤ المتحكم به ، حتى لا تفقد مركزك. إنه أيضًا وقت حقيقي ويمكن تنشيطه في أي وقت. بمجرد الانتهاء أو الإيقاف المؤقت ، سوف ينتظر Grbl حتى أمر بدء دورة صدر لاستئناف البرنامج. تعليق الخلاصة يمكن أن يوقف دورة فقط ولن يؤثر على صاروخ موجه أو أي عملية أخرى. إذا كنت بحاجة إلى إيقاف دورة منتصف البرنامج ولا يمكنك تحمل خسارة المركز ، فقم بإجراء تعليق لتلقي Grbl كل شيء إلى توقف تسيطر عليها. بمجرد الانتهاء ، يمكنك حينئذ إصدار إعادة تعيين. حاول دائمًا تنفيذ تعليق تغذية متى يتم تشغيل الجهاز قبل الضغط على إعادة التعيين ، إلا إذا كان هناك بعض حالات الطوارئ.
cs: Příkaz podržení kanálu '!' řízeným zpomalením zastaví aktivní cyklus, aby nedošlo ke ztrátě polohy. Je také v reálném čase a může být kdykoli aktivován. Po dokončení nebo pozastavení bude Grbl čekat na příkaz ke spuštění cyklu je vydáno k obnovení programu. Zastavení podávání může pouze pozastavit cyklus a neovlivní navádění nebo jakýkoli jiný proces. Pokud potřebujete zastavit cyklus uprostřed programu a nemůžete si dovolit ztrátu pozice, proveďte pozastavení posuvu, aby Grbl přinesl vše řízeně zastavit. Po dokončení můžete provést reset. Vždy se pokuste provést pozastavení kanálu, kdykoli stroj je v chodu, než dojde k resetování, samozřejmě kromě případu, kdy dojde k nějaké nouzové situaci.
de_de: ! Feed Hold Setzt Grbl in einen Suspend- oder HOLD-Zustand. Bei Bewegung bewegt sich die Maschine bis zum Stillstand und wird dann ausgesetzt. Befehl wird ausgeführt, wenn Grbl in einem IDLE-, RUN- oder JOG-Zustand ist. Andernfalls wird er ignoriert. Beim Joggen wird die Jogbewegung abgebrochen und alle verbleibenden Jogbewegungen im Planerpuffer gelöscht. Der Zustand kehrt von JOG zu IDLE oder DOOR zurück, wenn er während des aktiven Haltes als scharf erkannt wurde. 'Feed Hold' deaktiviert die Spindel oder das Kühlmittel nicht. Nur Bewegung. Zur Verbindung einer Taste oder eines Schalters steht ein Eingangspin zur Verfügung.
es: El comando de retención de alimentación '!' detendrá el ciclo activo mediante una desaceleración controlada, para no perder la posición. También es en tiempo real y puede activarse en cualquier momento. Una vez terminado o en pausa, Grbl esperará hasta que se inicie un comando de ciclo. se emite para reanudar el programa. La retención de alimentación solo puede pausar un ciclo y no afectará el recorrido de referencia ni ningún otro proceso. Si necesita detener un ciclo a mitad del programa y no puede permitirse perder la posición, realice una retención de alimentación para que Grbl traiga todo a una parada controlada. Una vez terminado, puede emitir un reinicio. Siempre trate de ejecutar una retención de alimentación siempre que la máquina está funcionando antes de presionar restablecer, excepto, por supuesto, si hay alguna situación de emergencia.
fr: La commande de mise en attente '!' arrêtera le cycle actif via une décélération contrôlée, afin de ne pas perdre de position. Il est également en temps réel et peut être activé à tout moment. Une fois terminé ou en pause, Grbl attendra jusqu'à ce qu'une commande de démarrage de cycle est délivré pour reprendre le programme. L'alimentation en attente ne peut que suspendre un cycle et ne pas affecter le référencement ou tout autre processus. Si vous avez besoin d'arrêter un cycle en cours de programme et que vous ne pouvez pas vous permettre de perdre une position, effectuez une mise en attente pour que Grbl apporte tout à un arrêt contrôlé. Une fois terminé, vous pouvez alors émettre une réinitialisation. Toujours essayer d'exécuter un blocage du flux chaque fois que la machine est en marche avant la remise à zéro, sauf bien sûr en cas d'urgence.
it: Il comando di attesa feed '!' arresterà il ciclo attivo tramite una decelerazione controllata, per non perdere posizione. È anche in tempo reale e può essere attivato in qualsiasi momento. Una volta terminato o messo in pausa, Grbl attenderà un comando di avvio del ciclo viene rilasciato per riprendere il programma. Feed hold può solo mettere in pausa un ciclo e non influirà sull'homing o su qualsiasi altro processo. Se hai bisogno di interrompere un ciclo a metà programma e non puoi permetterti di perdere posizione, esegui un feed hold per far portare Grbl tutto ad un arresto controllato. Una volta terminato, è quindi possibile eseguire un ripristino. Cerca sempre di eseguire una sospensione del feed ogni volta la macchina è in funzione prima di premere il reset, tranne ovviamente in situazioni di emergenza.
ja: フィード保留コマンド「！」 位置を失わないように、制御された減速によってアクティブサイクルを停止します。 また、リアルタイムであり、いつでもアクティブにできます。 終了または一時停止すると、Grblはサイクル開始コマンドまで待機します プログラムを再開するために発行されます。 フィードホールドはサイクルを一時停止するだけで、ホーミングやその他のプロセスには影響しません。 プログラムの途中でサイクルを停止する必要があり、ポジションを失う余裕がない場合は、フィードホールドを実行してGrblを持ってくる 制御された停止へのすべて。 終了したら、リセットを発行できます。 常にフィードホールドを実行してみてください 緊急事態が発生した場合を除き、リセットを押す前にマシンが実行されています。
pl: Polecenie wstrzymania posuwu "!" spowoduje zatrzymanie aktywnego cyklu poprzez kontrolowane spowolnienie, aby nie utracić pozycji. Jest ono również wykonywana w czasie rzeczywistym i może być aktywowane w dowolnym momencie. Po zakończeniu lub wstrzymaniu GRBL będzie czekał, aż zostanie wydane polecenie rozpoczęcia cyklu, aby wznowić program. Zatrzymanie posuwu może jedynie wstrzymać cykl i nie będzie miało wpływu na naprowadzanie lub jakikolwiek inny proces. Jeżeli musisz zatrzymać cykl w połowie programu i nie możesz sobie pozwolić na utratę pozycji, wykonaj zatrzymanie posuwu, aby GRBL doprowadził wszystko do kontrolowanego zatrzymania. Po zakończeniu, możesz wydać polecenie reset. Zawsze staraj się wykonać zatrzymanie posuwu, gdy maszyna pracuje, zanim wykonasz reset, oczywiście z wyjątkiem sytuacji awaryjnej.
pt: O comando de retenção de feed '!' interromperá o ciclo ativo por meio de uma desaceleração controlada, para não perder a posição. Também é em tempo real e pode ser ativado a qualquer momento. Uma vez terminado ou pausado, o Grbl aguardará até que um comando de início do ciclo seja emitido para retomar o programa. A retenção de alimentação pode pausar apenas um ciclo e não afetará a homing ou qualquer outro processo. Se você precisar interromper um ciclo no meio do programa e não puder perder a posição, realize uma espera de alimentação para que o Grbl leve tudo a uma parada controlada. Depois de concluído, você poderá emitir uma redefinição. Sempre tente executar uma retenção de alimentação sempre que a máquina estiver funcionando antes de reiniciar, exceto, é claro, se houver alguma situação de emergência.
ru: Команда удержания подачи '!' остановит активный цикл с помощью управляемого замедления, чтобы не потерять позицию. Это также в режиме реального времени и может быть активировано в любое время. После завершения или приостановки Grbl будет ждать, пока команда запуска цикла выдается для возобновления программы. Удержание подачи может только приостановить цикл и не повлияет на возвращение в исходное положение или любой другой процесс. Если вам нужно остановить среднюю программу цикла и вы не можете позволить себе потерять позицию, выполните удержание подачи, чтобы Grbl принес все до контролируемой остановки. После завершения вы можете выполнить сброс. Всегда пытайтесь выполнить удержание подачи всякий раз, когда машина работает до сброса, за исключением, конечно, чрезвычайной ситуации.
tr: Besleme tutma komutu '!' konumu kaybetmemek için kontrollü bir yavaşlama yoluyla aktif çevrimi durduracaktır. Aynı zamanda gerçek zamanlı ve herhangi bir zamanda etkinleştirilebilir. Bittiğinde veya duraklatıldığında, Grbl bir döngü başlatma komutu gelene kadar bekleyecektir. programı devam ettirmek için verilir. Besleme tutma yalnızca bir döngüyü duraklatabilir ve hedef aramayı veya başka herhangi bir işlemi etkilemez. Programın ortasında bir döngüyü durdurmanız gerekiyorsa ve konum kaybetmeyi göze alamıyorsanız, Grbl'nin her şey kontrollü bir şekilde durdurulur. Bittiğinde, bir sıfırlama düzenleyebilirsiniz. Her zaman bir besleme bekletmeyi yürütmeye çalışın. Makine, elbette bazı acil durumlar dışında, sıfırlamaya basmadan önce çalışıyor.
zh_cn: 进给保持命令'！' 将通过受控制的减速使主动循环停止，以免丢失位置。 它也是实时的，可以随时激活。 完成或暂停后，Grbl将等待直到循环启动命令 发出以恢复程序。 进给保持只能暂停一个周期，不会影响归位或任何其他过程。 如果您需要停止一个循环中间程序而又不能承受失去位置的麻烦，请执行Feed暂停以将Grbl带入 一切都受控停止。 完成后，您可以发出重置。 始终尝试执行Feed暂停 机器在达到复位状态之前正在运行，除非有紧急情况。

# btnKillAlarm.ToolTip
source: Grbl's alarm mode is a state when something has gone critically wrong, such as a hard limit or an abort during a cycle, or if Grbl doesn't know its position. By default, if you have homing enabled and power-up the Arduino, Grbl enters the alarm state, because it does not know its position. The alarm mode will lock all G-code commands until the '$H' homing cycle has been performed. Or if a user needs to override the alarm lock to move their axes off their limit switches, for example, '$X' kill alarm lock will override the locks and allow G-code functions to work again.
ar: وضع التنبيه Grbl هو حالة عندما يكون هناك شيء خاطئ بشكل خطير ، مثل الحد الصلب أو الإجهاض أثناء الدورة ، أو إذا كان Grbl لا يعرف موقعه. افتراضيًا ، إذا قمت بتمكين صاروخ موجه وإدخال Arduino ، يدخل Grbl حالة الإنذار ، لأنها لا تعرف موقفها. وضع المنبه قفل كل شيء أوامر G-code حتى يتم تنفيذ دورة التوجيه "$ H". أو إذا كان يحتاج المستخدم لتجاوز قفل المنبه لتحريك محاورهم عن مفاتيح الحد الخاصة بهم ، على سبيل المثال ، قفل المنبه "$ X" سيتجاوز الأقفال ويسمح لوظائف G-code بالعمل مرة أخرى.
cs: Grblův alarmový režim je stav, kdy se něco kriticky pokazilo, jako je pevný limit nebo přerušení během cyklu, nebo pokud Grbl nezná svou pozici. Ve výchozím nastavení, pokud máte povoleno navádění a zapnete Arduino, vstoupí Grbl stav alarmu, protože nezná svou polohu. Režim budíku vše uzamkne Příkazy G-kódu, dokud nebude proveden cyklus navádění „$H“. Nebo pokud uživatel potřebuje přepsat zámek alarmu a přesunout jejich osy mimo jejich koncové spínače, například '$X' kill alarm lock přepíše zámky a umožní, aby funkce G-kódu znovu fungovaly.
de_de: $X - Kill alarm lock Grbl's Alarm-Modus ist ein Zustand, wenn etwas kritisch falsch gegangen ist, wie eine harte Grenze oder ein Abbruch während eines Zyklus, oder wenn Grbl seine Position nicht kennt. Wenn Sie Homing aktiviert haben und den Arduino einschalten, tritt Grbl in den Alarmzustand ein, da es seine Position nicht kennt. Im Alarmmodus werden alle G-Code-Befehle gesperrt, bis der Referenzzyklus '$ H' ausgeführt wurde. Oder wenn ein Benutzer die Alarmsperre außer Kraft setzen muss, um ihre Achsen von ihren Endschaltern zu verschieben, wird die '$ X' - Kill alarm lock die Sperren außer Kraft setzen und die G-Code-Funktionen wieder aktivieren. Aber vorsichtig! Dies sollte nur in Notfallsituationen angewendet werden. Die Position ist wahrscheinlich verloren gegangen, und Grbl ist nicht dort wo Sie denken, dass es ist. Es wird empfohlen den G91 Inkremental-Modus zu wählen, um kleine Fahrbewegungen zu machen. Führen Sie danach einen Referenzzyklus aus oder restten sie GRBL.
es: El modo de alarma de Grbl es un estado en el que algo salió mal críticamente, como un límite duro o un aborto durante un ciclo, o si Grbl no conoce su posición. De manera predeterminada, si tiene habilitado el inicio y enciende el Arduino, Grbl ingresa El estado de alarma, porque no conoce su posición. El modo de alarma bloqueará todo Comandos de código G hasta que se haya realizado el ciclo de referencia '$ H'. O si un usuario necesita para anular el bloqueo de alarma para mover sus ejes fuera de sus interruptores de límite, por ejemplo, '$ X' matar bloqueo de alarma anulará los bloqueos y permitirá que las funciones del código G funcionen nuevamente.
fr: Le mode d'alarme de Grbl est un état où quelque chose a mal tourné, comme une limite dure ou un abandon pendant un cycle, ou si Grbl ne connaît pas sa position. Par défaut, si le référencement est activé et que vous allumez l’Arduino, Grbl entre l'état d'alarme, car il ne connaît pas sa position. Le mode d’alarme verrouille tout Les commandes de code G jusqu'à ce que le cycle de référencement '$ H' ait été effectué. Ou si un utilisateur a besoin pour annuler le verrouillage d'alarme afin de déplacer leurs axes des fins de course, par exemple, le verrou d'alarme de désactivation '$ X' annulera les verrous et permettra aux fonctions de code G de fonctionner à nouveau.
it: La modalità di allarme di Grbl è uno stato in cui qualcosa è andato storto in modo critico, come un limite rigido o un'interruzione durante un ciclo, o se Grbl non conosce la sua posizione. Per impostazione predefinita, se hai abilitato l'homing e accendi Arduino, Grbl entra nello stato di allarme, perché non conosce la sua posizione. La modalità di allarme bloccherà tutti i comandi del codice G fino a quando non sarà stato eseguito il ciclo di homing '$H'. O se un utente ha bisogno per ignorare il blocco dell'allarme per spostare loro assi fuori dai loro interruttori di finecorsa, ad esempio, il blocco dell'allarme "$X" annullerà i blocchi e consentirà alle funzioni del codice G di funzionare di nuovo.
ja: Grblのアラームモードは、重大な問題が発生した状態です。 サイクル中のハードリミットやアボートなど、またはGrblがその位置を知らない場合。 デフォルトでは、ホーミングを有効にしてArduinoの電源を入れた場合、Grblは アラーム状態。位置がわからないため。 アラームモードはすべてをロックします '$ H'ホーミングサイクルが実行されるまでGコードコマンド。 または、ユーザーが必要な場合 アラームロックを無効にして、軸をリミットスイッチから移動するには、たとえば、 '$ X'アラームロックを解除します。 ロックをオーバーライドし、Gコード機能が再び機能できるようにします。
pl: Tryb alarmowy GRBL'a jest stanem, kiedy coś poszło krytycznie źle, na przykład osiągnięto twardy limit lub wystąpiło przerwanie cyklu, lub też gdy GRBL nie zna swojej pozycji. Domyślnie, jeśli masz włączony homing i włączasz Arduino, GRBL wchodzi w stan alarmu, ponieważ nie zna swojej pozycji. Tryb alarmowy zablokuje wszystkie polecenia G-code do momentu wykonania cyklu naprowadzania '$H'. Lub jeśli użytkownik potrzebuje obejść blokadę alarmu, aby przesunąć swoje osie poza ich wyłączniki krańcowe, na przykład, '$X' kill alarm lock spowoduje unieważnienie blokad i umożliwi ponowne działanie funkcji G-code.
pt: O modo de alarme do Grbl é um estado em que algo deu errado, como um limite rígido ou um aborto durante um ciclo, ou se o Grbl não souber sua posição. Por padrão, se você tiver o retorno à posição inicial ativado e inicializar o Arduino, o Grbl entra no estado de alarme, porque não conhece sua posição. O modo de alarme bloqueará todos os comandos do código G até que o ciclo de retorno '$ H' seja executado. Ou, se um usuário precisar substituir a trava de alarme para mover seus eixos para fora de suas chaves fim de curso, por exemplo, a trava de alarme matança '$ X' substituirá as travas e permitirá que as funções do código G funcionem novamente.
ru: Режим тревоги Grbl - это состояние, когда что-то пошло не так, например, жесткий лимит или прерывание во время цикла, или если Grbl не знает свою позицию. По умолчанию, если у вас включен самонаведения и включения Arduino, Grbl вводит состояние тревоги, потому что он не знает свою позицию. Режим тревоги заблокирует все Команды G-кода до тех пор, пока не будет выполнен цикл возврата $ H. Или если пользователю нужно переопределить блокировку сигнализации, чтобы переместить их оси от концевых выключателей, например, '$ X' kill lock alarm переопределит блокировки и позволит функциям G-кода снова работать.
tr: Grbl'ın alarm modu, bir şeylerin kritik derecede yanlış gittiği bir durumdur. bir döngü sırasında sabit limit veya iptal gibi veya Grbl konumunu bilmiyorsa. Varsayılan olarak, hedef aramayı etkinleştirdiyseniz ve Arduino'yu açtıysanız, Grbl girer alarm durumu, çünkü konumunu bilmiyor. Alarm modu tümünü kilitleyecektir. '$H' hedef arama döngüsü gerçekleştirilene kadar G kodu komutları. Veya bir kullanıcının ihtiyacı varsa eksenlerini limit anahtarlarından çıkarmak için alarm kilidini geçersiz kılmak için, örneğin '$X' alarm kilidini öldür kilitleri geçersiz kılacak ve G kodu işlevlerinin tekrar çalışmasına izin verecektir.
zh_cn: Grbl的警报模式是发生严重错误的状态， 例如硬限位或程序在循环中中止，或者Grbl不知道其当前位置。 默认情况下，如果您启用了归位并打开Arduino的电源，Grbl将进入 警报状态，因为它不知道其位置。 警报模式将锁定所有 G代码命令，直到执行了'$H'归位循环。 或者如果用户需要 覆盖警报锁以将轴移出限位开关，例如，“ $X”取消警报锁 将覆盖锁定并允许G代码功能再次运行。
