Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlSerialForm.*.resx
Languages: ar, de_de, es, pt, zh_cn

# cbPort.ToolTip
source: Select free serial port
ar: حدد منفذ تسلسلي مجاني
de_de: Wählen Sie eine freie serielle Schnittstelle
es: Seleccione un puerto serie libre
pt: Selecione porta serial livre
zh_cn: 选择一个可用的串行端口

# cbBaud.ToolTip
source: Select speed
ar: اختر السرعة
de_de: Geschwindigkeit auswählen
es: Seleccionar velocidad
pt: Selecionar velocidade
zh_cn: 选择速度

# btnScanPort.Text
source: Scan Ports
ar: مسح المنافذ
es: Escanear puertos
pt: Procurar
zh_cn: 扫描端口

# btnScanPort.ToolTip
source: Scan for free ports
ar: البحث عن منافذ مجانية
de_de: Suche nach freien COM Ports
es: Escanear en busca de puertos libres
pt: Procure portas gratuitas
zh_cn: 扫描空闲端口

# btnClear.Text
source: Clear Log
ar: سجل نظيف
es: Borrar registro
pt: Limpa
zh_cn: 清除日志

# btnClear.ToolTip
source: Clear list above
ar: مسح القائمة أعلاه
de_de: Lösche Historie
es: Eliminar historial
pt: Limpar lista acima
zh_cn: 删除记录

# btnSend.Text
source: Send
ar: إرسال
es: enviar
pt: Executar
zh_cn: 发送

# btnSend.ToolTip
source: Press to send command
ar: اضغط لإرسال الأوامر
de_de: Sende Befehl (geht auch mit 'Enter')
es: Presione para enviar el comando
pt: Pressione para enviar o comando
zh_cn: 按下即可发送命令

# btnGRBLCommand0.ToolTip
source: Help: Get list of all GRBL commands
ar: مساعدة: الحصول على قائمة بجميع أوامر GRBL
de_de: Listet alle GRBL Befehle
es: Ayuda: obtenga una lista de todos los comandos GRBL
pt: Ajuda: Obter lista de todos os comandos do GRBL
zh_cn: 帮助：获取所有GRBL命令的列表

# btnGRBLCommand1.ToolTip
source: View Grbl settings
ar: عرض إعدادات Grbl
de_de: Listet die Grbl Settings
es: Ver configuración de Grbl
pt: Visualizar configurações do Grbl
zh_cn: 查看Grbl设置

# btnGRBLCommand2.ToolTip
source: View g-code parameters
ar: عرض معلمات g-code
de_de: Anzeigen von G-code-Parametern
es: Ver los parámetros de g-code
pt: Visualizar parâmetros do código g
zh_cn: 查看g代码参数

# btnGRBLCommand3.ToolTip
source: View startup blocks
ar: عرض كتل بدء التشغيل
de_de: Listet die Startup Blocks
es: Ver bloques de inicio
pt: Exibir blocos de inicialização
zh_cn: 查看启动块

# btnGRBLCommand4.ToolTip
source: Kill alarm lock
ar: قتل قفل المنبه
de_de: Alarmsperre aufheben
es: Matar bloqueo de alarma
pt: Matar bloqueio de alarme
zh_cn: 杀死警报锁

# lblSrPos.ToolTip
source: Work Position
ar: موقف العمل
de_de: Koordinaten der 'Work Position'
es: Posición de trabajo
pt: Posição de trabalho
zh_cn: 工作岗位

# label2.ToolTip
source: Buffer State (needs to be enabled via $10=2)
ar: حالة التخزين المؤقت (يحتاج إلى تمكين عبر 10 دولارات = 2)
de_de: Pufferstatus (muss über $ 10 = 2 aktiviert werden)
es: Estado del búfer (debe habilitarse mediante $ 10 = 2)
pt: Estado do buffer (precisa ser ativado via $ 10 = 2)
zh_cn: 缓冲区状态（需要通过$ 10 = 2启用）

# lblSrBf.ToolTip
source: Buffer State (needs to be enabled via $10=2)
ar: حالة التخزين المؤقت (يحتاج إلى تمكين عبر 10 دولارات = 2)
de_de: Pufferstatus (muss über $ 10 = 2 aktiviert werden)
es: Estado del búfer (debe habilitarse mediante $ 10 = 2)
pt: Estado do buffer (precisa ser ativado via $ 10 = 2)
zh_cn: 缓冲区状态（需要通过$ 10 = 2启用）

# label4.ToolTip
source: Current Feed (mm/min) and Speed (RPM)
ar: التغذية الحالية (مم / دقيقة) والسرعة (RPM)
de_de: Aktueller Vorschub (mm / min) und Geschwindigkeit (U / min)
es: Alimentación actual (mm / min) y velocidad (RPM)
pt: Alimentação atual (mm / min) e velocidade (RPM)
zh_cn: 当前进给（mm / min）和速度（RPM）

# lblSrFS.ToolTip
source: Current Feed (mm/min) and Speed (RPM)
ar: التغذية الحالية (مم / دقيقة) والسرعة (RPM)
de_de: Aktueller Vorschub (mm / min) und Geschwindigkeit (U / min)
es: Alimentación actual (mm / min) y velocidad (RPM)
pt: Alimentação atual (mm / min) e velocidade (RPM)
zh_cn: 当前进给（mm / min）和速度（RPM）

# lblSrPn.ToolTip
source: Input Pin State for XYZ, Probe, Door, Hold, soft-Reset, cycle-Start
ar: حالة إدخال الدبوس لـ XYZ ، دقق ، باب ، تعليق ، إعادة ضبط لينة ، دورة البدء
de_de: Eingangs-Pin-Status für XYZ, Sonde, Tür, Halten, Soft-Reset, Zyklusstart
es: Estado del pin de entrada para XYZ, sonda, puerta, retención, restablecimiento parcial, inicio de ciclo
pt: Estado do pino de entrada para XYZ, sonda, porta, retenção, reinicialização suave, início do ciclo
zh_cn: XYZ，探针，门，保持，软复位，循环启动的输入引脚状态

# label7.ToolTip
source: Input Pin State for XYZ, Probe, Door, Hold, soft-Reset, cycle-Start
ar: حالة إدخال الدبوس لـ XYZ ، دقق ، باب ، تعليق ، إعادة ضبط لينة ، دورة البدء
de_de: Eingangs-Pin-Status für XYZ, Sonde, Tür, Halten, Soft-Reset, Zyklusstart
es: Estado del pin de entrada para XYZ, sonda, puerta, retención, restablecimiento parcial, inicio de ciclo
pt: Estado do pino de entrada para XYZ, sonda, porta, retenção, reinicialização suave, início do ciclo
zh_cn: XYZ，探针，门，保持，软复位，循环启动的输入引脚状态

# lblSrOv.ToolTip
source: Override Values for feed, rapids and speed in %
ar: تجاوز قيم الخلاصة ، والسرعة في النسبة المئوية
de_de: Werte für Vorschub und Geschwindigkeit in % überschreiben
es: Valores de anulación para avance, rápidos y velocidad en%
pt: Substituir valores para alimentação, corredeiras e velocidade em%
zh_cn: 进给，急流和速度的替代值，以％为单位

# label9.ToolTip
source: Override Values for feed, rapids and speed in %
ar: تجاوز قيم الخلاصة ، والسرعة في النسبة المئوية
de_de: Werte für Vorschub und Geschwindigkeit in % überschreiben
es: Valores de anulación para avance, rápidos y velocidad en%
pt: Substituir valores para alimentação, corredeiras e velocidade em%
zh_cn: 进给，急流和速度的替代值，以％为单位

# lblSrA.ToolTip
source: Accessory State S=spindle CW, C=spindle CCW, F=floot colant, M=mist coolant
ar: حالة الملحقات S = محور الدوران CW ، C = محور الدوران CCW ، F = عمود الدوران ، M = ضباب التبريد
es: Estado del accesorio S = husillo CW, C = husillo CCW, F = colant floot, M = refrigerante por neblina
pt: Estado do acessório S = eixo CW, C = eixo CCW, F = corante flutuante, M = líquido refrigerante
zh_cn: 附件状态 S =主轴CW， C =主轴CCW， F =防洪线， M =冷却液

# lblSrLn.ToolTip
source: Line Number (needs to be enabled in config.h)
ar: رقم السطر (يحتاج إلى التمكين في config.h)
de_de: Zeilennummer (muss in config.h aktiviert sein)
es: Número de línea (debe habilitarse en config.h)
pt: Número da linha (precisa ser ativado em config.h)
zh_cn: 行号（需要在config.h中启用）

# label13.ToolTip
source: Line Number (needs to be enabled in config.h)
ar: رقم السطر (يحتاج إلى التمكين في config.h)
de_de: Zeilennummer (muss in config.h aktiviert sein)
es: Número de línea (debe habilitarse en config.h)
pt: Número da linha (precisa ser ativado em config.h)
zh_cn: 行号（需要在config.h中启用）

# btnCheckGRBL.Text
source: Check GRBL
ar: تحقق GRBL
es: Comprobar GRBL
pt: Verificar GRBL
zh_cn: 检查GRBL

# btnCheckGRBL.ToolTip
source: Check GRBL setup for maximum and minimum limits Not for GRBL Vers. < 1.0
ar: تحقق من إعداد GRBL لمعرفة الحد الأقصى والحد الأدنى ليس ل GRBL Vers. <1.0
de_de: Überprüfen Sie das GRBL-Setup auf Höchst- und Mindestwerte Nicht für GRBL Vers. <1,0
es: Verifique la configuración de GRBL para conocer los límites máximos y mínimos No para GRBL Vers. <1.0
pt: Verifique a configuração do GRBL para obter os limites máximos e mínimos
zh_cn: 检查GRBL设置的最大和最小限制 不适用于GRBL Vers。 <1.0

# btnGRBLReset.ToolTip
source: Soft Reset via CTRL-X
ar: إعادة التعيين الناعم عبر CTRL-X
de_de: Soft Reset über STRG-X
es: Soft Reset a través de CTRL-X
pt: Redefinição suave via CTRL-X
zh_cn: 通过CTRL-X进行软重置

# btnGRBLHardReset.ToolTip
source: Try hard Reset via DTR / RTS Success depends on used hardware (DTR, RTS wired?)
ar: جرب إعادة الضبط الثابت عبر DTR / RTS يعتمد النجاح على الأجهزة المستخدمة (DTR ، RTS سلكي؟)
de_de: Versuchen Sie es mit einem harten Reset über DTR / RTS Erfolg hängt von der Hardware ab (DTR, RTS verkabelt?)
es: Intente reiniciar por DTR / RTS El éxito depende del hardware (¿DTR, RTS cableado?)
pt: Tente redefinir por DTR / RTS O
zh_cn: 尝试通过DTR / RTS进行硬重置 成功取决于所使用的硬件（DTR，RTS有线？）

# btnGRBLCmndParser.ToolTip
source: View g-code parser state
ar: عرض حالة محلل g-code
de_de: Zeigen Sie den Status des G-code-Parsers an
es: Ver el estado del analizador g-code
pt: Exibir estado do analisador de código g
zh_cn: 查看g代码解析器状态

# btnGRBLCmndBuild.ToolTip
source: View build info
ar: عرض معلومات البناء
de_de: Build-Informationen anzeigen
es: Ver información de compilación
pt: Exibir informações de compilação
zh_cn: 查看版本信息

# cBStatus.Text
source: Show Real-time Status Report
ar: عرض تقرير الحالة في الوقت الحقيقي
de_de: Zeige den Echtzeit Status Report
es: Mostrar informe de estado
pt: Mostrar relatório de status em tempo real
zh_cn: 显示实时状态报告

# cBStatus.ToolTip
source: Show the original received GRBL status reports
ar: عرض تقارير حالة GRBL الأصلية المستلمة
de_de: Zeige die original empfangenen GRBL Status Reports
es: Mostrar los informes de estado GRBL recibidos originales
pt: Mostrar os relatórios de status GRBL originais recebidos
zh_cn: 显示原始收到的GRBL状态报告

# lblSrState.Text
source: Status
ar: الحالة
es: Estado
zh_cn: 状态

# cBStatus1.ToolTip
source: Show sent and processed commands during streaming
ar: إظهار الأوامر المرسلة والمعالجة أثناء التدفق
de_de: Gesendete und verarbeitete Befehle beim Streaming anzeigen
es: Mostrar comandos enviados y procesados durante la transmisión
pt: Mostrar comandos enviados e processados ​​durante a transmissão
zh_cn: 在流式传输期间显示已发送和已处理的命令

# groupBox1.Text
source: Real-time Status Report
ar: في الوقت الحقيقي تقرير الحالة
de_de: Echtzeit Status Report
es: Informe de estado en tiempo real
pt: Relatório de status em tempo real
zh_cn: 实时状态报告

# pasteCodeFromClipboardToolStripMenuItem.Text
source: Paste Code from clipboard
ar: الصق الكود من الحافظة
zh_cn: 从剪贴板粘贴代码

# copySelectionToClipboardToolStripMenuItem.Text
source: Copy selection to clipboard
ar: نسخ التحديد إلى الحافظة
zh_cn: 将选择复制到剪贴板

# selectAllToolStripMenuItem.Text
source: Select all
ar: اختر الكل
zh_cn: 全选

# LblAccessoryState.ToolTip
source: Accessory State S=spindle CW, C=spindle CCW, F=floot colant, M=mist coolant
ar: حالة الملحقات S = محور الدوران CW ، C = محور الدوران CCW ، F = عمود الدوران ، M = ضباب التبريد
pt: Estado do acessório S = eixo CW, C = eixo CCW, F = corante flutuante, M = líquido refrigerante
zh_cn: 附件状态 S =主轴CW， C =主轴CCW， F =防洪线， M =冷却液

# btnOpenPort.Text
source: Open
de_de: Öffnen
es: Conectar

# btnOpenPort.ToolTip
source: Open selected COM port with selected speed
de_de: Öffne den ausgewählten COM Port mit ausgewählter Geschwindigkeit Oder schließt den offenen COM Port
es: Abra el puerto COM seleccionado con la velocidad seleccionada. O cierre el puerto COM abierto
