Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlLaser.*.resx
Languages: cs

# label1.Text
source: Move X from 0 to
cs: Přesuňte X z 0 na

# label7.Text
source: Before start, delay
cs: Před startem, zpoždění

# label15.Text
source: sec. at S
cs: sek. v S

# label9.Text
source: move Y by
cs: posunout Y o

# groupBox1.Text
source: Motion during scan
cs: Pohyb během skenování

# lblText.Text
source: Setup: set $30 to a value which result to 100% laser power when setting S100.
cs: Nastavení: nastavte 30 $ na hodnotu, která má za následek 100% výkon laseru při nastavení S100.

# btnScanZ.Text
source: Start scan
cs: Začni skenovat

# label2.Text
source: Z from plus to minus
cs: Z od plus do mínus

# label12.Text
source: at feed rate F
cs: při rychlosti posuvu F

# label8.Text
source: at laser power S
cs: při výkonu laseru S

# groupBox2.Text
source: Scan Z to find focus on constant speed and power
cs: Naskenujte Z, abyste se zaměřili na konstantní rychlost a výkon

# btnScanSpeed.Text
source: Start scan
cs: Začni skenovat

# label3.Text
source: From F
cs: Od F

# label4.Text
source: to F
cs: k F

# label13.Text
source: step
cs: krok

# label10.Text
source: at laser power S
cs: při výkonu laseru S

# groupBox3.Text
source: Scan X speed on constant power (without Z axis)
cs: Skenování rychlosti X při konstantním výkonu (bez osy Z)

# btnScanPower.Text
source: Start scan
cs: Začni skenovat

# label6.Text
source: From S
cs: Od S

# label5.Text
source: to S
cs: do S

# label14.Text
source: step
cs: krok

# label11.Text
source: at feed rate F
cs: při rychlosti posuvu F

# groupBox4.Text
source: Scan laser power on constant speed (without Z axis)
cs: Skenování výkonu laseru při konstantní rychlosti (bez osy Z)

# groupBox5.Text
source: Laser settings to use below
cs: Nastavení laseru k použití níže

# btnToolUpdate.Text
source: Update tool table
cs: Aktualizujte tabulku nástrojů

# lblToolProp.Text
source: XY-Feed (F) and l power (S) from tt
cs: XY-Feed (F) a l výkon (S) od tt

# btnScanTool.Text
source: Start scan
cs: Začni skenovat

# groupBox6.Text
source: Use values from tool table
cs: Použijte hodnoty z tabulky nástrojů

# $this.Text
source: Laser alignment
cs: Laserové vyrovnání
