Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlCameraForm.*.resx
Languages: ar, cs, de_de, es, fr, ja, pt, ru, zh_cn

# TbRealPoints.Text
source: Assigned coordinats:
ar: المنسقين المعينين:
cs: Přidělené souřadnice:
de_de: Zugewiesene Koordinaten:
es: Coordinaciones asignadas:
fr: Coordonnées assignées :
ja: 割り当てられたコーディネーター：
pt: Coordenadas atribuídas:
ru: Назначенные координаторы:
zh_cn: 指定坐标：

# TbRealPoints.ToolTip
source: Assigned coordinats: Collect points manually: Shift-Click to add point, Shift -"c" to clear list
ar: المنسقين المعينين: اجمع النقاط يدويًا: انقر مع الضغط على مفتاح Shift لإضافة نقطة ، التحول - "ج" لمسح القائمة
cs: Přidělené souřadnice: Sbírejte body ručně: Shift-Klikněte pro přidání bodu, Shift - "c" pro vymazání seznamu
de_de: Zugewiesene Koordinaten: Punkte manuell sammeln: Umschalt-Klicken, um Punkt hinzuzufügen, Umschalt -"c" zum Löschen der Liste
es: Coordinaciones asignadas: Recoge puntos manualmente: Mayús-clic para agregar un punto, Mayús - "c" para borrar la lista
fr: Coordonnées assignées : Collectez des points manuellement : Maj-Clic pour ajouter un point, Maj - "c" pour effacer la liste
ja: 割り当てられたコーディネーター： 手動でポイントを収集します。 Shiftキーを押しながらクリックしてポイントを追加し、 Shift- "c"でリストをクリア
pt: Coordenadas atribuídas: Acumule pontos manualmente: Clique com a tecla Shift para adicionar um ponto, Shift - "c" para limpar a lista
ru: Назначенные координаторы: Набирать баллы вручную: Shift-щелчок, чтобы добавить точку, Shift - «c», чтобы очистить список
zh_cn: 指定坐标： 手动收集积分： Shift-单击添加点， Shift -"c" 清除列表

# btnAutoCenter.ToolTip
source: Add position to "Assigned points" and move tool
ar: أضف موضعًا إلى "النقاط المخصصة" وأداة النقل
cs: Přidejte pozici do "Assigned points" a pohybujte nástrojem
de_de: Position zu "Zugewiesene Punkte" hinzufügen und Werkzeug verschieben
es: Agregar posición a "Puntos asignados" y mover herramienta
fr: Ajouter une position aux "Points assignés" et déplacer l'outil
ja: 「割り当てられたポイント」に位置を追加し、ツールを移動します
pt: Adicione a posição aos "Pontos atribuídos" e mova a ferramenta
ru: Добавьте позицию в «Назначенные точки» и переместите инструмент
zh_cn: 将位置添加到“指定点”并移动工具

# GbZoom.Text
source: Camera
ar: الة تصوير
cs: Fotoaparát
de_de: Kamera
es: Cámara
fr: Caméra
ja: カメラ
pt: Câmera
ru: Камера
zh_cn: 相机

# BtnSetOffsetZero.Text
source: Set XY = 0;0
ar: تعيين XY = 0 ؛ 0
cs: Nastavte XY = 0;0
es: Establecer XY = 0; 0
fr: Définir XY = 0;0
ja: XY = 0; 0に設定します
pt: Defina XY = 0; 0
ru: Установите XY = 0; 0
zh_cn: 设置 XY = 0;0

# BtnSetOffsetMarker.Text
source: Set XY = Marker
ar: تعيين XY = علامة
cs: Nastavte XY = Marker
es: Establecer XY = Marcador
fr: Définir XY = Marqueur
ja: XY =マーカーを設定します
pt: Definir XY = Marcador
ru: Установить XY = маркер
zh_cn: 设置 XY = 标记

# GbOffset.Text
source: Camera Offset / Movement
ar: حركة / إزاحة الكاميرا
cs: Offset / Pohyb kamery
de_de: Kamera-Offset / Bewegung
es: Desplazamiento / movimiento de la cámara
fr: Décalage/Mouvement de la caméra
ja: カメラのオフセット/動き
pt: Deslocamento / movimento da câmera
ru: Смещение / перемещение камеры
zh_cn: 相机偏移/移动

# label6.Text
source: Rigth click for rotation point, keep pressed, release at desired angle
ar: انقر Rigth للحصول على نقطة الدوران ، واستمر في الضغط ، ثم حرر الزاوية المرغوبة
cs: Klikněte pravým tlačítkem pro bod otáčení, držte stisknuté a uvolněte v požadovaném úhlu
de_de: Rechtsklick für Drehpunkt, gedrückt halten, bei gewünschtem Winkel loslassen
es: Haga clic derecho para el punto de rotación, mantenga presionado, suelte en el ángulo deseado
fr: Cliquez à droite pour le point de rotation, maintenez enfoncé, relâchez à l'angle souhaité
ja: 回転点を右クリックし、押し続け、希望の角度で放します
pt: Clique com o botão direito para ver o ponto de rotação, mantenha pressionado, solte no ângulo desejado
ru: Щелкните правой кнопкой мыши для точки поворота, удерживайте нажатой, отпустите под нужным углом
zh_cn: 右键单击旋转点，按住，在所需角度释放

# CbScale.Text
source: Also scale
ar: مقياس أيضا
cs: Také měřítko
de_de: Auch skalieren
es: También escala
fr: Echelle aussi
ja: また、スケール
pt: Também escala
ru: Также масштабировать
zh_cn: 也规模

# GbMeasure.Text
source: Measure angle
ar: قياس الزاوية
cs: Změřte úhel
de_de: Winkel messen
es: Medir el ángulo
fr: Mesurer l'angle
ja: 角度を測定する
pt: Ângulo de medição
ru: Угол измерения
zh_cn: 测量角度

# BtnStartAutomatic.Text
source: Start automatic fiducial correction
ar: ابدأ التصحيح الإيماني التلقائي
cs: Spusťte automatickou korekci základny
de_de: Automatische Passermarkenkorrektur starten
es: Iniciar la corrección fiducial automática
fr: Démarrer la correction automatique des repères
ja: 自動基準修正を開始します
pt: Iniciar correção fiducial automática
ru: Начать автоматическую коррекцию реперных точек
zh_cn: 启动自动基准校正

# cBShapeShowFilter.Text
source: Show applied filters
ar: إظهار عوامل التصفية المطبقة
cs: Zobrazit použité filtry
de_de: Angewandte Filter anzeigen
es: Mostrar filtros aplicados
fr: Afficher les filtres appliqués
ja: 適用されたフィルターを表示する
pt: Mostrar filtros aplicados
ru: Показать примененные фильтры
zh_cn: 显示应用的过滤器

# checkBox1.Text
source: Also scale on rotation
ar: مقياس أيضًا عند الدوران
cs: Také měřítko při otáčení
de_de: Auch skalieren bei Drehung
es: También escala en rotación
fr: Également à l'échelle sur la rotation
ja: また、回転に合わせて拡大縮小します
pt: Também escala na rotação
ru: Также масштабируется при вращении
zh_cn: 也在旋转时缩放

# CbUseShapeRecognition.Text
source: Use shape recognition
ar: استخدم التعرف على الشكل
cs: Použijte rozpoznávání tvarů
de_de: Formerkennung verwenden
es: Usar el reconocimiento de formas
fr: Utiliser la reconnaissance de forme
ja: 形状認識を使用する
pt: Use o reconhecimento de forma
ru: Распознавание формы
zh_cn: 使用形状识别

# tabPage1.Text
source: Automatic mode
ar: الوضع التلقائي
cs: Automatický režim
es: Modo automatico
fr: Mode automatique
ja: 自動モード
pt: Modo automático
ru: Автоматический режим
zh_cn: 自动模式

# label5.Text
source: Shape close to marker is red
ar: الشكل القريب من العلامة أحمر
cs: Tvar blízko značky je červený
de_de: Form in der Nähe der Markierung ist rot
es: La forma cercana al marcador es roja
fr: La forme près du marqueur est rouge
ja: マーカーに近い形状は赤
pt: A forma próxima ao marcador é vermelha
ru: Форма рядом с маркером красная
zh_cn: 靠近标记的形状是红色的

# label4.Text
source: Filters can be setup in [Setup - Program behavior - Camera]
ar: يمكن إعداد المرشحات في [الإعداد - سلوك البرنامج - الكاميرا]
cs: Filtry lze nastavit v [Nastavení - Chování programu - Fotoaparát]
de_de: Filter können in [Setup – Programmverhalten – Kamera] eingerichtet werden.
es: Los filtros se pueden configurar en [Configuración - Comportamiento del programa - Cámara]
fr: Les filtres peuvent être configurés dans [Configuration - Comportement du programme - Appareil photo]
ja: フィルタは[設定-プログラムの動作-カメラ]で設定できます
pt: Os filtros podem ser configurados em [Configuração - Comportamento do programa - Câmera]
ru: Фильтры можно настроить в [Настройка - Поведение программы - Камера].
zh_cn: 过滤器可以在[设置-程序行为-相机]中设置

# tabPage2.Text
source: Shape recognition
ar: التعرف على الشكل
cs: Rozpoznávání tvaru
de_de: Formerkennung
es: Reconocimiento de formas
fr: Reconnaissance de forme
ja: 形状認識
pt: Reconhecimento de forma
ru: Распознавание формы
zh_cn: 形状识别

# tabPage3.Text
source: Manual mode
ar: الوضع اليدوي
cs: Manuální režim
de_de: Manueller Modus
es: Modo manual
fr: Mode manuel
ja: 手動モード
pt: Modo manual
ru: Ручной режим
zh_cn: 手动模式

# tabPage4.Text
source: Set offsets
ar: مقاصة تعويضات
cs: Nastavte offsety
de_de: Offsets einstellen
es: Establecer compensaciones
fr: Définir les décalages
ja: オフセットを設定する
pt: Definir compensações
ru: Установить смещения
zh_cn: 设置偏移量

# setWork00ToHereToolStripMenuItem.Text
source: Set work coordinate 0;0 here
ar: اضبط تنسيق العمل 0 ؛ 0 هنا
cs: Zde nastavte pracovní souřadnice 0;0
de_de: Arbeitskoordinate 0,0 hier einstellen
es: Establezca aquí la coordenada de trabajo 0; 0
fr: Définir la coordonnée de travail 0;0 ici
ja: ここで作業座標0; 0を設定します
pt: Defina a coordenada de trabalho 0; 0 aqui
ru: Задайте здесь рабочую координату 0; 0
zh_cn: 在这里设置工作坐标 0;0

# FiducialAddCoordinateIn2DViewToolStripMenuItem.Text
source: Add fiducial coordinate from 2D view to fiducial list
ar: إضافة تنسيق إيماني من عرض ثنائي الأبعاد إلى قائمة إيمانية
cs: Přidejte základní souřadnice z 2D zobrazení do základního seznamu
de_de: Passmarkenkoordinaten aus 2D-Ansicht zur Passmarkenliste hinzufügen
es: Agregar coordenada fiducial de la vista 2D a la lista de fiduciales
fr: Ajouter des coordonnées de repère de la vue 2D à la liste de repères
ja: 2Dビューから基準リストに基準座標を追加します
pt: Adicionar coordenada fiducial da vista 2D à lista fiducial
ru: Добавить реперные координаты из 2D-вида в список реперных точек
zh_cn: 将 2D 视图中的基准坐标添加到基准列表

# FiducialRemoveLastToolStripMenuItem.Text
source: Remove last fiducial
ar: إزالة إيمانية الماضي
cs: Odstraňte poslední referenční číslo
de_de: Letzte Passmarke entfernen
es: Eliminar último fiducial
fr: Supprimer le dernier repère
ja: 最後の基準を削除します
pt: Remova o último fiducial
ru: Удалить последний реперный знак
zh_cn: 删除最后一个基准

# FiducialListClearToolStripMenuItem.Text
source: Clear fiducial list
ar: قائمة إيمانية واضحة
cs: Přehledný základní seznam
de_de: Passmarkenliste löschen
es: Lista fiducial clara
fr: Effacer la liste fiduciaire
ja: 基準リストをクリアする
pt: Limpar lista fiducial
ru: Очистить список реперных точек
zh_cn: 清除基准列表

# ReferenceAddPointInImageToolStripMenuItem.Text
source: Add reference point from image to assigned list
ar: أضف نقطة مرجعية من الصورة إلى القائمة المعينة
cs: Přidejte referenční bod z obrázku do přiřazeného seznamu
de_de: Referenzpunkt aus Bild zur zugewiesenen Liste hinzufügen
es: Agregar punto de referencia de la imagen a la lista asignada
fr: Ajouter un point de référence de l'image à la liste attribuée
ja: 画像から割り当てられたリストに参照点を追加します
pt: Adicionar ponto de referência da imagem à lista atribuída
ru: Добавить контрольную точку из изображения в назначенный список
zh_cn: 将图像中的参考点添加到指定列表

# ReferenceRemoveLastPointToolStripMenuItem.Text
source: Remove last reference point
ar: إزالة آخر نقطة مرجعية
cs: Odstraňte poslední referenční bod
de_de: Letzten Referenzpunkt entfernen
es: Eliminar el último punto de referencia
fr: Supprimer le dernier point de référence
ja: 最後の参照点を削除します
pt: Remover o último ponto de referência
ru: Удалить последнюю контрольную точку
zh_cn: 删除最后一个参考点

# ReferenceClearListToolStripMenuItem.Text
source: Clear reference point (assigned) list
ar: مسح قائمة النقاط المرجعية (المعينة)
cs: Vymazat seznam referenčních bodů (přiřazených).
de_de: Liste der Referenzpunkte (zugewiesen) löschen
es: Lista clara de puntos de referencia (asignados)
fr: Effacer la liste des points de référence (attribués)
ja: 基準点（割り当て済み）リストをクリアする
pt: Limpar lista de pontos de referência (atribuídos)
ru: Очистить список контрольных точек (назначенных)
zh_cn: 清除参考点（已分配）列表

# setWork00ToHereToolStripMenuItem.ToolTipText
source: Sets the origin of the work coordinate to the clicked position in the 2D view
ar: يضبط أصل تنسيق العمل إلى الموضع الذي تم النقر فوقه في العرض ثنائي الأبعاد
cs: Nastaví počátek pracovní souřadnice na klepnutou pozici ve 2D pohledu
de_de: Setzt den Ursprung der Arbeitskoordinate auf die angeklickte Position in der 2D-Ansicht
es: Establece el origen de la coordenada de trabajo en la posición en la que se hizo clic en la vista 2D
fr: Définit l'origine de la coordonnée de travail à la position cliquée dans la vue 2D
ja: 作業座標の原点を2Dビューでクリックした位置に設定します
pt: Define a origem da coordenada de trabalho para a posição clicada na vista 2D
ru: Устанавливает начало координат заготовки в положение щелчка в 2D-виде
zh_cn: 将工作坐标的原点设置为 2D 视图中的单击位置

# compensateAngleToolStripMenuItem.ToolTipText
source: Applys the yellow marked angle to the G code
ar: يطبق الزاوية المميزة باللون الأصفر على كود G.
cs: Aplikuje žlutě označený úhel na G kód
de_de: Gelb markierten Winkel auf G-Code anwenden
es: Aplica el ángulo marcado en amarillo al código G
fr: Applique l'angle marqué en jaune au code G
ja: 黄色でマークされた角度をGコードに適用します
pt: Aplica o ângulo marcado em amarelo ao código G
ru: Применяет желтый отмеченный угол к G-коду
zh_cn: 将黄色标记的角度应用于 G 代码

# FiducialAddCoordinateIn2DViewToolStripMenuItem.ToolTipText
source: Add fiducial coordinates of the clicked position, inside the 2D view, to the fiducial list
ar: أضف الإحداثيات الموثوقة للموضع الذي تم النقر فوقه ، داخل العرض ثنائي الأبعاد ، إلى القائمة الموثوقة
cs: Přidejte výchozí souřadnice pozice, na kterou jste klikli, uvnitř 2D pohledu do základního seznamu
de_de: Passmarkenkoordinate der angeklickten Position, in der 2D-Ansicht, zur Passmarkenliste hinzufügen
es: Agregue coordenadas fiduciales de la posición en la que se hizo clic, dentro de la vista 2D, a la lista fiducial
fr: Ajouter les coordonnées de repère de la position cliquée, à l'intérieur de la vue 2D, à la liste des repères
ja: 2Dビュー内のクリックされた位置の基準座標を基準リストに追加します
pt: Adicione coordenadas fiduciais da posição clicada, dentro da vista 2D, para a lista fiducial
ru: Добавить реперные координаты точки щелчка внутри 2D-вида в список реперных точек.
zh_cn: 在 2D 视图中将单击位置的基准坐标添加到基准列表

# FiducialRemoveLastToolStripMenuItem.ToolTipText
source: Remove last added fiducial from fiducial list
ar: إزالة الأخيرة المضافة من القائمة الائتمانية
cs: Odebrat poslední přidanou fiduciář ze seznamu fiduciář
de_de: Zuletzt hinzugefügte Passmarke aus der Passmarkenliste entfernen
es: Eliminar el último fiducial agregado de la lista de fiduciales
fr: Supprimer le dernier repère ajouté de la liste des repères
ja: 最後に追加した基準を基準リストから削除します
pt: Remover o último fiducial adicionado da lista fiducial
ru: Удалить последний добавленный реперный знак из списка реперных точек
zh_cn: 从基准列表中删除最后添加的基准

# FiducialListClearToolStripMenuItem.ToolTipText
source: Clear fiducial list
ar: قائمة إيمانية واضحة
cs: Přehledný základní seznam
de_de: Passmarkenliste löschen
es: Lista fiducial clara
fr: Effacer la liste fiduciaire
ja: 基準リストをクリアする
pt: Limpar lista fiducial
ru: Очистить список реперных точек
zh_cn: 清除基准列表

# ReferenceAddPointInImageToolStripMenuItem.ToolTipText
source: Add reference point from image to assigned list
ar: أضف نقطة مرجعية للموضع الذي تم النقر فوقه ، داخل الصورة ، إلى القائمة المعينة
cs: Přidejte referenční bod z obrázku do přiřazeného seznamu
de_de: Referenzpunkt der angeklickten Position im Bild zur zugewiesenen Liste hinzufügen
es: Agregue el punto de referencia de la posición en la que se hizo clic, dentro de la imagen, a la lista asignada
fr: Ajouter le point de référence de la position cliquée, à l'intérieur de l'image, à la liste attribuée
ja: 画像内のクリックされた位置の参照点を割り当てられたリストに追加します
pt: Adicione o ponto de referência da posição clicada, dentro da imagem, à lista atribuída
ru: Добавить контрольную точку места щелчка внутри изображения в назначенный список
zh_cn: 将图像内点击位置的参考点添加到指定列表中

# ReferenceRemoveLastPointToolStripMenuItem.ToolTipText
source: Remove last added reference point from assigned list
ar: إزالة آخر نقطة مرجعية مضافة من القائمة المعينة
cs: Odebrat poslední přidaný referenční bod z přiřazeného seznamu
de_de: Zuletzt hinzugefügten Referenzpunkt aus der zugewiesenen Liste entfernen
es: Eliminar el último punto de referencia agregado de la lista asignada
fr: Supprimer le dernier point de référence ajouté de la liste attribuée
ja: 割り当てられたリストから最後に追加された参照点を削除します
pt: Remova o último ponto de referência adicionado da lista atribuída
ru: Удалить последнюю добавленную контрольную точку из назначенного списка
zh_cn: 从指定列表中删除最后添加的参考点

# ReferenceClearListToolStripMenuItem.ToolTipText
source: Clear reference point (assigned) list
ar: مسح قائمة النقاط المرجعية (المعينة)
cs: Vymazat seznam referenčních bodů (přiřazených).
de_de: Liste der Referenzpunkte (zugewiesen) löschen
es: Lista clara de puntos de referencia (asignados)
fr: Effacer la liste des points de référence (attribués)
ja: 基準点（割り当て済み）リストをクリアする
pt: Limpar lista de pontos de referência (atribuídos)
ru: Очистить список контрольных точек (назначенных)
zh_cn: 清除参考点（已分配）列表

# showOverlayGraphicsToolStripMenuItem.ToolTipText
source: Show overlay graphics (ruler, pen-down path, etc.)
ar: إظهار رسومات التراكب (المسطرة ، مسار القلم ، إلخ.)
cs: Zobrazit překryvnou grafiku (pravítko, dráha pera dolů atd.)
de_de: Overlay-Grafiken anzeigen (Lineal, Stift-nach-unten-Pfad usw.)
es: Mostrar gráficos superpuestos (regla, trazado de lápiz hacia abajo, etc.)
fr: Afficher les graphiques de superposition (règle, chemin de plume, etc.)
ja: オーバーレイグラフィックを表示する（ルーラー、ペンダウンパスなど）
pt: Mostrar gráficos de sobreposição (régua, caminho da caneta, etc.)
ru: Mostrar gráficos de sobreposição (régua, caminho da caneta, etc.)
zh_cn: 显示叠加图形（标尺、下笔路径等）

# setMachinePositionToolStripMenuItem.Text
source: Click to get grbl machine offset at origin
ar: انقر للحصول على إزاحة آلة grbl في الأصل
cs: Kliknutím získáte offset stroje grbl na počátku
de_de: Klicke hier, um den grbl-Maschinenversatz am Ursprung zu erhalten
es: Haga clic para obtener el desplazamiento de la máquina grbl en el origen
fr: Cliquez pour obtenir le décalage de la machine grbl à l'origine
ja: クリックして、原点でのgrblマシンオフセットを取得します
pt: Clique para obter o deslocamento da máquina grbl na origem
ru: Нажмите, чтобы получить машинное смещение grbl в исходной точке
zh_cn: 单击以获取原点处的 grbl 机器偏移量
