Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlCameraForm.*.resx
Languages: ar, cs, de_de, es, fr, ja, pt, ru, zh_cn

# teachScalingToolStripMenuItem.Text
source: Teach scaling
ar: تعليم التحجيم
cs: Naučte škálování
de_de: Bild Skalierung
es: Enseñar escala
fr: Enseigner la mise à l'échelle
ja: スケーリングを教える
ru: Научить масштабирование
zh_cn: 缩放教学

# setRotationAngleToolStripMenuItem.Text
source: Picture rotation
ar: تدوير الصورة
cs: Otočení obrázku
de_de: Bilddrehung
es: Rotación de imagen
fr: Rotation d'image
ja: 画像の回転
pt: Rotação da imagem
ru: Поворот изображения
zh_cn: 图片旋转

# teachOffsetToolStripMenuItem.ToolTipText
source: 1) switch to 'Tool coord.' (G54) 2) Zero X,Y position 3) Mark tool position (at X=0,Y=0) with tool on work piece 4) Move marker below center of camera view 5) Teach actual position as offset 6) switch to 'Cam coord.' (G59) - shows now X=0, Y=0
ar: 1) قم بالتبديل إلى "أداة التنسيق". (G54) 2) صفر X ، Y الموقف 3) وضع علامة أداة (في X = 0 ، Y = 0) مع أداة على قطعة العمل 4) حرك علامة أسفل مركز عرض الكاميرا 5) تعليم الموقف الفعلي كما إزاحة 6) قم بالتبديل إلى "Cam coord". (G59) - يظهر الآن X = 0 ، Y = 0
cs: 1) přepněte na „Coord nástroje“. (G54) 2) Poloha nula X,Y 3) Označte polohu nástroje (při X=0,Y=0) nástrojem na obrobku 4) Přesuňte značku pod střed pohledu kamery 5) Naučte skutečnou polohu jako offset 6) přepněte na 'Cam coord.' (G59) - nyní ukazuje X=0, Y=0
de_de: Setzen des Offsets zwischen Mitte Kamerabild und Werkzeugposition 1) setze 'Tool coord.' (G54) 2) Nulle die X,Y Position 3) Markiere die Werkzeugposition (bei Koordinate X=0,Y=0) mit Werkzeug auf Werkstück 4) Verfahre XY bis die Markierung in der Bildmitte erscheint 5) Setze den Kameraoffset 6) setze 'Cam coord.' - steht nun aux X=0, Y=0
es: 1) cambie a 'Herramienta coord'. (G54) 2) Cero X, posición Y 3) Marque la posición de la herramienta (en X = 0, Y = 0) con la herramienta en la pieza de trabajo 4) Mueva el marcador debajo del centro de la vista de la cámara 5) Enseñar la posición real como compensación 6) cambia a 'Cam coord'. (G59): muestra ahora X = 0, Y = 0
fr: 1) basculez sur 'Outil coord.' (G54) 2) Zéro X, Y position 3) Marquer la position de l'outil (à X = 0, Y = 0) avec l'outil sur la pièce 4) Déplacer le marqueur sous le centre de la vue de la caméra 5) Enseigner la position réelle en décalage 6) basculez sur 'Cam coord.' (G59) - montre maintenant X = 0, Y = 0
ja: 1）「ツール座標」に切り替えます。 （G54） 2）ゼロX、Y位置 3）ワークピース上の工具で工具位置をマーク（X = 0、Y = 0） 4）マーカーをカメラビューの中心の下に移動する 5）実際の位置をオフセットとして教える 6）「Cam coord」に切り替えます。 （G59）-X = 0、Y = 0になりました
pt: 1) mude para 'Ferramenta coord.' (G54) 2) Zero X, posição Y 3) Marque a posição da ferramenta (em X = 0, Y = 0) com a ferramenta na peça de trabalho 4) Mova o marcador abaixo do centro da vista da câmera 5) Ensine a posição real como deslocamento 6) mude para 'Cam coord.' (G59) - mostra agora X = 0, Y = 0
ru: 1) переключиться на «Координата инструмента». (G54) 2) Ноль X, позиция Y 3) Отметьте положение инструмента (при X = 0, Y = 0) с помощью инструмента на заготовке. 4) Переместите маркер ниже центра обзора камеры 5) Изучите фактическое положение как смещение 6) переключиться на «Координаты кулачка». (G59) - теперь показывает X = 0, Y = 0
zh_cn: 1）切换到“工具坐标”。 （G54） 2）X，Y位置为零 3）用工具在工件上标记工具位置（在X = 0，Y = 0处） 4）将标记移至相机视图中心下方 5）示教实际位置作为偏移量 6）切换到“凸轮坐标”。 （G59）-现在显示X = 0，Y = 0

# btnApplyAngle.Text
source: Apply Angle to G-Code
ar: تطبيق زاوية على GCode
cs: Použijte úhel na G-kód
de_de: Winkel -> GCode
es: Aplicar ángulo a GCode
fr: Appliquer l'angle à GCode
ja: GCodeに角度を適用
pt: Aplicar ângulo ao GCode
ru: Применить угол к GCode
zh_cn: 将角度应用于GCode

# teachScalingToolStripMenuItem.ToolTipText
source: 1) Home Plotter 2) move camera to upper position 3) click in picture to teach distance of top radius 4) move camera to lower position 5) click in picture to teach distance of bottom radius
ar: 1) الراسمة الرئيسية 2) نقل الكاميرا إلى الموضع العلوي 3) انقر في الصورة لتعليم المسافة من دائرة نصف قطرها العلوي 4) نقل الكاميرا إلى انخفاض الموقف 5) انقر في الصورة لتعليم مسافة نصف قطرها السفلي
cs: 1) Domácí plotr 2) přesuňte kameru do horní polohy 3) kliknutím na obrázek naučte vzdálenost horního poloměru 4) přesuňte kameru do nižší polohy 5) klikněte na obrázek pro naučení vzdálenosti spodního poloměru
de_de: Setzen der Bildskalierung (Kamera ist an Z-Achse befestigt) an oberer und unterer Z-Position um Abhängig von der Z-Position die richtige Grafikskalierung zu berechnen 1) Home Plotter - es werden die Z-Maschinenkoordinaten verwendet 2) Fahre die Kamera zur oberen Position 3) Linksklick im Bild setzt obere Skalierung auf oberen Skalierungsradius 4) Fahre die Kamera zur unteren Position 5) Linksklick im Bild setzt untere Skalierung auf unteren Skalierungsradius
es: 1) Plotter casero 2) mover la cámara a la posición superior 3) haga clic en la imagen para enseñar la distancia del radio superior 4) mueva la cámara a la posición más baja 5) haga clic en la imagen para enseñar la distancia del radio inferior
fr: 1) Accueil Traceur 2) déplace la caméra en position haute 3) cliquez dans l'image pour enseigner la distance du rayon supérieur 4) déplacez la caméra en position basse 5) cliquez dans l'image pour enseigner la distance du rayon inférieur
ja: 1）ホームプロッター 2）カメラを上の位置に移動する 3）画像をクリックして、上の半径の距離を教えます 4）カメラを下の位置に移動する 5）下の半径の距離を教えるために写真をクリックしてください
pt: 1) Plotter doméstico 2) mova a câmera para a posição superior 3) clique na imagem para indicar a distância do raio superior 4) mova a câmera para a posição inferior 5) clique na imagem para indicar a distância do raio inferior
ru: 1) Домашний плоттер 2) переместить камеру в верхнее положение 3) нажмите на картинку, чтобы узнать расстояние от верхнего радиуса 4) переместите камеру в нижнее положение 5) нажмите на картинку, чтобы узнать расстояние нижнего радиуса
zh_cn: 1）家用绘图仪 2）将相机移到较高位置 3）点击图片以示最大半径的距离 4）将相机移至较低位置 5）点击图片以示下半径的距离

# toolStripTextBox2.ToolTipText
source: in GRBL units (mm or inch)
ar: بوحدات GRBL (مم أو بوصة)
cs: v jednotkách GRBL (mm nebo palce)
de_de: in GRBL Einheiten (mm oder Inch)
es: en unidades GRBL (mm o pulgadas)
fr: en unités GRBL (mm ou inch)
ja: GRBL単位（mmまたはインチ）
pt: em unidades GRBL (mm ou polegada)
ru: в единицах GRBL (мм или дюйм)
zh_cn: 以GRBL单位（毫米或英寸）

# showOverlayGraphicsToolStripMenuItem.Text
source: Show overlay graphics
ar: عرض تراكب الرسومات
cs: Zobrazit překryvnou grafiku
de_de: Zeige GCode Grafik
es: Mostrar gráficos superpuestos
fr: Afficher les graphiques de superposition
ja: オーバーレイグラフィックを表示する
pt: Mostrar gráficos de sobreposição
ru: Показать оверлейную графику
zh_cn: 显示叠加图形

# $this.Text
source: Camera
ar: الة تصوير
cs: Fotoaparát
de_de: Kamera
es: Cámara
fr: Caméra
ja: カメラ
pt: Câmera
ru: камера
zh_cn: 相机

# btnCamCoordTool.Text
source: G54 Tool coord.
ar: تنسيق أداة G54.
cs: G54 Souřadnice nástroje.
es: G54 Herramienta coord.
fr: G54 Coordonnée de l'outil.
ja: G54ツール座標。
ru: G54 Координата инструмента.
zh_cn: G54 工具坐标。

# toolStripTextBox1.ToolTipText
source: Rotate video image - enter angle
ar: تدوير صورة الفيديو - أدخل زاوية
cs: Otočit obraz videa – zadejte úhel
de_de: Videobild drehen - Winkel eingeben
es: Girar imagen de video - ingresar ángulo
fr: Faire pivoter l'image vidéo - saisir un angle
ja: ビデオ画像を回転-角度を入力
pt: Girar imagem de vídeo - inserir ângulo
ru: Повернуть видео - введите угол
zh_cn: 旋转视频图像-输入角度

# teachRadiusBottomToolStripMenuItem.Text
source: Set teach radius bottom
ar: مجموعة تعليم أسفل دائرة نصف قطرها
cs: Nastavte spodní poloměr učení
de_de: Skalierungsradius unten
es: Establecer el fondo del radio de enseñanza
fr: Définir le rayon d'apprentissage en bas
ja: ティーチ半径の下部を設定
pt: Definir raio de ensino inferior
ru: Установить радиус обучения внизу
zh_cn: 设定示教半径底

# lowerPositionToolStripMenuItem.ToolTipText
source: Teach camera view
ar: تعليم عرض الكاميرا
cs: Učte pohled kamery
es: Enseñar vista de cámara
fr: Enseigner la vue caméra
ja: カメラビューを教える
pt: Ensinar a visualização da câmera
ru: Научить вид с камеры
zh_cn: 示教相机视图

# cBCamCoordMove.ToolTip
source: Apply camera offset to graphics
ar: تطبيق إزاحة الكاميرا على الرسومات
cs: Použít offset kamery na grafiku
de_de: Wendet den Kameraversatz auf die Grafik an
es: Aplicar desplazamiento de cámara a gráficos
fr: Appliquer un décalage de la caméra aux graphiques
ja: カメラオフセットをグラフィックスに適用する
pt: Aplicar deslocamento da câmera aos gráficos
ru: Применить смещение камеры к графике
zh_cn: 将相机偏移量应用于图形

# teachToolStripMenuItem.ToolTipText
source: 1) Zero X,Y position 2) Mark tool position (at X=0,Y=0) 3) Move until marker is in center of camera view 4) Teach actual position as offset
ar: 1) صفر X ، Y الموقف 2) وضع علامة الأداة (في X = 0 ، Y = 0) 3) تحرك حتى علامة في وسط عرض الكاميرا 4) تعليم الموقف الفعلي كما إزاحة
cs: 1) Poloha nula X,Y 2) Označte polohu nástroje (při X=0, Y=0) 3) Pohybujte se, dokud nebude značka ve středu pohledu kamery 4) Naučte skutečnou polohu jako offset
de_de: Setzen des Offsets zwischen Mitte Kamerabild und Werkzeugposition 1) Nulle die X,Y Position 2) Markiere die Werkzeugposition (bei Koordinate X=0,Y=0) 3) Verfahre XY bis die Markierung in der Bildmitte erscheint 4) Setze den Kameraoffset
es: 1) Cero X, posición Y 2) Marcar la posición de la herramienta (en X = 0, Y = 0) 3) Muévase hasta que el marcador esté en el centro de la vista de la cámara 4) Enseñar la posición real como compensación
fr: 1) Zéro X, Y position 2) Marquer la position de l’outil (à X = 0, Y = 0) 3) Déplacez-vous jusqu'à ce que le marqueur se trouve au centre de la vue de la caméra 4) Enseigner la position réelle en décalage
ja: 1）ゼロX、Y位置 2）ツール位置をマーク（X = 0、Y = 0で） 3）マーカーがカメラビューの中央に来るまで移動する 4）実際の位置をオフセットとして教える
pt: 1) Zero X, posição Y 2) Marque a posição da ferramenta (em X = 0, Y = 0) 3) Mova-se até o marcador estar no centro da visão da câmera 4) Ensine a posição real como deslocamento
ru: 1) Ноль X, позиция Y 2) Отметить положение инструмента (при X = 0, Y = 0) 3) Двигайтесь, пока маркер не окажется в центре обзора камеры 4) Изучите фактическое положение как смещение
zh_cn: 1）X，Y位置为零 2）标记刀具位置（在X = 0，Y = 0处） 3）移动直到标记位于相机视图的中心 4）教实际位置作为偏移

# btnCamCoordCam.ToolTip
source: Move current camera position below Tool
ar: حرك موضع الكاميرا الحالي أسفل الأداة
cs: Přesuňte aktuální pozici kamery pod nástroj
de_de: Bewegt die aktuelle Kameraposition unter das Werkzeug
es: Mover la posición actual de la cámara debajo de Herramienta
fr: Déplacer la position actuelle de la caméra sous l'outil
ja: 現在のカメラ位置をツールの下に移動
pt: Mover a posição atual da câmera abaixo de Ferramenta
ru: Переместить текущую позицию камеры ниже инструмента
zh_cn: 将当前相机位置移到工具下方

# lblCenterPos.Text
source: No shape found
ar: لم يتم العثور على الشكل
cs: Nebyl nalezen žádný tvar
de_de: Keine Form gefunden
es: No se encontró forma
fr: Aucune forme trouvée
ja: 形状が見つかりません
pt: Nenhuma forma encontrada
ru: Форма не найдена
zh_cn: 找不到形状

# btnAutoCenter.Text
source: Move to red circle
ar: مركز الدائرة الحمراء
cs: Přejděte na červený kruh
de_de: Roten Ring zentrieren
es: Centro círculo rojo
fr: Centre cercle rouge
ja: 中央の赤丸
pt: Círculo vermelho central
ru: Центр красный круг
zh_cn: 中心红色圆圈

# toolStripTextBox3.ToolTipText
source: in GRBL units (mm or inch)
ar: بوحدات GRBL (مم أو بوصة)
cs: v jednotkách GRBL (mm nebo palce)
de_de: in GRBL Einheiten (mm oder Inch)
es: en unidades GRBL (mm o pulgadas)
fr: en unités GRBL (mm ou inch)
ja: GRBL単位（mmまたはインチ）
pt: em unidades GRBL (mm ou polegada)
ru: в единицах GRBL (мм или дюйм)
zh_cn: 以GRBL单位（毫米或英寸）

# label1.Text
source: Angle
ar: زاوية
cs: Úhel
de_de: Winkel:
es: ángulo
ja: 角度
pt: Ângulo
ru: угол
zh_cn: 角

# upperPositionToolStripMenuItem.ToolTipText
source: Teach camera view
ar: تعليم عرض الكاميرا
cs: Učte pohled kamery
de_de: Kameraansicht lernen
es: Enseñar vista de cámara
fr: Enseigner la vue caméra
ja: カメラビューを教える
pt: Ensinar a visualização da câmera
ru: Научить вид с камеры
zh_cn: 示教相机视图

# setupToolStripMenuItem.Text
source: Setup
ar: اقامة
cs: Založit
de_de: Einstellungen
es: Preparar
fr: Installer
ja: セットアップ
pt: Configuração
ru: Настроить
zh_cn: 设定

# label2.Text
source: Select filter set for fiducial recognition
ar: حدد مجموعة مرشح
cs: Vyberte sadu filtrů pro základní rozpoznávání
de_de: Filterset wählen
es: Seleccionar conjunto de filtros
fr: Sélectionner le jeu de filtres
ja: フィルターセットを選択
pt: Selecionar conjunto de filtros
ru: Выберите набор фильтров
zh_cn: 选择过滤器组

# upperPositionToolStripMenuItem.Text
source: Teach Upper Position
ar: تعليم الوظيفة العليا
cs: Učte horní pozici
de_de: Setze Skalierung obere Position
es: Enseñar posición superior
fr: Enseigner la position supérieure
ja: 上部位置を教える
pt: Ensinar Posição Superior
ru: Учить верхнюю позицию
zh_cn: 示教上位

# cBShapeDetection.Text
source: Enable shape recognition
ar: التعرف على الشكل
cs: Povolit rozpoznávání tvarů
de_de: Formenerkennung
es: Reconocimiento de forma
fr: Reconnaissance de forme
ja: 形状認識
pt: Reconhecimento de forma
ru: Распознавание формы
zh_cn: 形状识别

# camSourceToolStripMenuItem.Text
source: Video Source
ar: مصدر الفيديو
cs: Zdroj videa
de_de: Videoquelle
es: Fuente de vídeo
fr: Source vidéo
ja: ビデオソース
pt: Fonte de Vídeo
ru: Источник видео
zh_cn: 视讯来源

# setRotationAngleToolStripMenuItem.ToolTipText
source: Rotate video image - enter angle
ar: تدوير صورة الفيديو - أدخل زاوية
cs: Otočit obraz videa – zadejte úhel
de_de: Videobild drehen - Winkel eingeben
es: Girar imagen de video - ingresar ángulo
fr: Faire pivoter l'image vidéo - saisir un angle
ja: ビデオ画像を回転-角度を入力
pt: Girar imagem de vídeo - inserir ângulo
ru: Повернуть видео - введите угол
zh_cn: 旋转视频图像-输入角度

# teachToolStripMenuItem.Text
source: Teach Camera Offset
ar: تعليم إزاحة الكاميرا
cs: Naučte posun kamery
de_de: Kameraoffset setzen
es: Enseñar desplazamiento de cámara
fr: Enseigner le décalage de la caméra
ja: カメラオフセットを教える
pt: Ensinar deslocamento da câmera
ru: Обучить камеру смещению
zh_cn: 示教相机偏移

# compensateAngleToolStripMenuItem.Text
source: Apply angle to G-Code
ar: تعويض زاوية وحجم
cs: Použijte úhel na G-kód
de_de: Winkel und Skalierung ausgleichen
es: Compensar ángulo y escala
fr: Compenser l'angle et l'échelle
ja: 角度とスケールを補正する
pt: Compensar ângulo e escala
ru: Компенсировать угол и масштаб
zh_cn: 补偿角度和比例

# btnApplyAngle.ToolTip
source: Use right mouse button to measure angle. Press button to transform G-Code with measured angle.
ar: استخدم زر الفأرة الأيمن لقياس الزاوية. اضغط على الزر لتحويل G-Code بزاوية مقاسة.
cs: Pomocí pravého tlačítka myši změřte úhel. Stiskněte tlačítko pro transformaci G-kódu s naměřeným úhlem.
de_de: Rechte Maustaste um WInkel zu messen Drücke diesen Knopf um den G-Code um diesen Winkel zu drehen
es: Use el botón derecho del mouse para medir el ángulo. Presione el botón para transformar G-Code con el ángulo medido.
fr: Utilisez le bouton droit de la souris pour mesurer l'angle. Appuyez sur le bouton pour transformer le G-Code en angle mesuré.
ja: マウスの右ボタンを使用して角度を測定します。 ボタンを押して、測定された角度でGコードを変換します。
pt: Use o botão direito do mouse para medir o ângulo. Pressione o botão para transformar o código G com o ângulo medido.
ru: Используйте правую кнопку мыши, чтобы измерить угол. Нажмите кнопку, чтобы преобразовать G-Code с измеренным углом.
zh_cn: 使用鼠标右键测量角度。 按下按钮以测量角度转换G-Code。

# btnCamCoordCam.Text
source: G59 Camera coord
ar: تنسيق الكاميرا G59
cs: Koordinátor fotoaparátu G59
es: Coord de cámara G59
fr: G59 Coordonnées de la caméra
ja: G59カメラ座標
ru: G59 Координатор камеры
zh_cn: G59 相机坐标

# crossHairsToolStripMenuItem.Text
source: Cross Hairs
ar: الصليب الشعر
cs: Zaměřovací kříž
de_de: Fadenkreuz
es: punto de mira
fr: ligne de mire
ja: 十字線
pt: Mira
ru: 十字线...
zh_cn: 十字线

# colorsToolStripMenuItem.Text
source: Colors
ar: الألوان
cs: Barvy
de_de: Farben
es: Colores
fr: Couleurs
ja: 色
pt: Cores
ru: Цвета
zh_cn: 色彩

# lowerPositionToolStripMenuItem.Text
source: Teach Lower Position
ar: تعليم الموقف الأدنى
cs: Naučte nižší pozici
de_de: Setze Skalierung untere Position
es: Enseñar posición inferior
fr: Enseigner Position Basse
ja: 低い位置を教える
pt: Ensinar Posição Inferior
ru: Научить нижнее положение
zh_cn: 教低位

# cBCamCoordMove.Text
source: Move stage
ar: مرحلة الانتقال
cs: Přesuňte jeviště
es: Mover escenario
fr: Déplacer la scène
ja: ステージを移動
pt: Mover o palco
ru: Переместить этап
zh_cn: 移动舞台

# label3.Text
source: Zoom
ar: تكبير
cs: Zvětšení
ja: ズーム
ru: зум
zh_cn: 放大

# teachOffsetToolStripMenuItem.Text
source: Teach Offset
ar: علم الأوفست
cs: Naučte Offset
de_de: Bild Offset
es: Enseñar Offset
fr: Enseigner Offset
ja: オフセットを教える
ru: Учить офсет
zh_cn: 示教偏移

# teachRadiusTopToolStripMenuItem.Text
source: Set teach radius top
ar: تعيين تعليم نصف قطرها أعلى
cs: Nastavte horní poloměr učení
de_de: Skalierungsradius oben
es: Establecer la parte superior del radio de enseñanza
fr: Définir le rayon d'apprentissage en haut
ja: ティーチ半径を上に設定
pt: Definir o raio de ensino superior
ru: Установить радиус обучения сверху
zh_cn: 设置示教半径顶部

# lblAngle.ToolTip
source: Measured Angle
ar: زاوية قياس
cs: Měřený úhel
de_de: Gemessener Winkel
es: Ángulo medido
fr: Angle mesuré
ja: 測定角度
pt: Ângulo medido
ru: Измеренный угол
zh_cn: 测量角度

# btnCamCoordTool.ToolTip
source: Move current Tool position below camera
ar: حرك موضع الأداة الحالي أسفل الكاميرا
cs: Přesunout aktuální pozici nástroje pod kameru
de_de: Bewegt die aktuelle Werkzeugposition unter die Kamera
es: Mover la posición actual de la herramienta debajo de la cámara
fr: Déplacer la position actuelle de l'outil sous la caméra
ja: 現在のツールの位置をカメラの下に移動する
pt: Mover a posição atual da ferramenta abaixo da câmera
ru: Переместить текущее положение инструмента ниже камеры
zh_cn: 将当前工具位置移到摄像头下方

# camSourceToolStripMenuItem.ToolTipText
source: Select camera source.
ar: حدد مصدر الكاميرا.
cs: Vyberte zdroj fotoaparátu.
de_de: Wähle die Videoquelle aus
es: Selecciona la fuente de la cámara.
fr: Sélectionnez la source de la caméra.
ja: カメラソースを選択します。
pt: Selecione a fonte da câmera.
ru: Выберите источник камеры.
zh_cn: 选择摄像机源。

# cameraMountToolStripMenuItem.Text
source: Camera mount
ar: جبل الكاميرا
cs: Držák fotoaparátu
de_de: Kamerahalterung
es: Montaje de cámara
fr: Support de caméra
ja: カメラマウント
pt: Montagem de câmera
ru: Крепление камеры
zh_cn: 相机支架

# distortionToolStripMenuItem.Text
source: Distortion correction
ar: تصحيح التشويه
cs: Korekce zkreslení
de_de: Verzerrungskorrektur
es: Corrección de distorsión
fr: Correction de distorsion
ja: 歪み補正
pt: Correção de distorção
ru: Коррекция искажений
zh_cn: 失真校正

# teachRadiusToolStripMenuItem.Text
source: Teach radius
ar: علم الشعاع
cs: Naučte rádius
de_de: Radius einlernen
es: Enseñar radio
fr: Rayon d'apprentissage
ja: 半径を教える
pt: Raio de ensino
ru: Обучить радиус
zh_cn: 示教半径

# setTeachRadiusToolStripMenuItem.Text
source: Set teach radius
ar: تعيين نصف قطر التدريس
cs: Nastavte rádius učení
de_de: Teach-Radius einstellen
es: Establecer radio de enseñanza
fr: Définir le rayon d'apprentissage
ja: ティーチ半径を設定する
pt: Definir raio de ensino
ru: Установить радиус обучения
zh_cn: 设置示教半径

# teachScaling2ToolStripMenuItem.Text
source: Teach scaling
ar: تعليم القياس
cs: Naučte škálování
de_de: Skalierung beibringen
es: Enseñar a escalar
fr: Enseigner la mise à l'échelle
ja: スケーリングを教える
pt: Escala de ensino
ru: Научите масштабированию
zh_cn: 教缩放

# toolPositionToolStripMenuItem.Text
source: Set coordinate orign
ar: تحديد أصل الإحداثيات
cs: Nastavte orign souřadnic
de_de: Koordinatenursprung festlegen
es: Establecer origen de coordenadas
fr: Définir l'origine des coordonnées
ja: 座標orignを設定します
pt: Definir orign de coordenada
ru: Установить начало координат
zh_cn: 设置坐标原点

# textToolStripMenuItem.Text
source: Text
ar: نص
es: Texto
fr: Texte
ja: 文章
pt: Texto
ru: Текст
zh_cn: 文本

# setToolPositionToolStripMenuItem.Text
source: Click to set origin in 2D view
ar: انقر للتعيين
cs: Kliknutím nastavíte počátek ve 2D pohledu
de_de: Zum Einstellen klicken
es: Haga clic para configurar
fr: Cliquez pour définir
ja: クリックして設定
pt: Clique para definir
ru: Нажмите, чтобы установить
zh_cn: 点击设置

# resetAndTeachToolStripMenuItem.Text
source: Reset and teach
ar: إعادة تعيين وتعليم
cs: Resetovat a učit
de_de: Zurücksetzen und lehren
es: Reiniciar y enseñar
fr: Réinitialiser et enseigner
ja: リセットして教える
pt: Reiniciar e ensinar
ru: Сбросить и научить
zh_cn: 重置和教导

# cBRotateArround0.Text
source: Rotate arround 0;0
ar: تدوير حول 0 ؛ 0
cs: Otočit kolem 0;0
de_de: Um 0,0 . drehen
es: Girar alrededor de 0; 0
fr: Rotation autour de 0;0
ja: 0; 0を中心に回転します
pt: Girar ao redor 0; 0
ru: Повернуть вокруг 0; 0
zh_cn: 旋转 0;0

# simulateCameraToolStripMenuItem.Text
source: Simulate camera
ar: محاكاة الكاميرا
cs: Simulovat fotoaparát
ja: カメラをシミュレートする
ru: Имитация камеры
zh_cn: 模拟相机

# penupPathToolStripMenuItem.Text
source: Pen-up path
ar: مسار القلم
cs: Cesta k peru
de_de: Stift-oben Pfad
es: Camino de lápiz
fr: Chemin du stylo
ja: ペンアップパス
pt: Caminho de caneta
ru: Путь вверх
zh_cn: 上笔路径

# machineLimitsToolStripMenuItem.Text
source: Machine limits
ar: حدود الماكينة
cs: Limity stroje
de_de: Maschinengrenzen
es: Límites de la máquina
fr: Limites de la machine
ja: 機械の制限
pt: Limites da máquina
ru: Ограничения машины
zh_cn: 机器限制

# dimensionToolStripMenuItem.Text
source: G-Code Dimension
ar: البعد G- كود
cs: Rozměr G-kódu
es: Dimensión del código G
fr: Dimension du code G
ja: Gコードの寸法
pt: Dimensão Código G
ru: Размер G-кода
zh_cn: G 代码维度

# viewToolStripMenuItem.Text
source: View
ar: رأي
cs: Pohled
de_de: Ansicht
es: Vista
fr: Vue
ja: 意見
pt: Visualizar
ru: Вид
zh_cn: 看法

# menuStripCamera.Text
source: menuStrip1
ar: القائمة
zh_cn: 菜单条1

# TbSetPoints.Text
source: Fiducial coordinates:
ar: الإحداثيات الإيمانية:
cs: Výchozí souřadnice:
de_de: Passmarken Koordinaten
es: Coordenadas fiduciales:
fr: Coordonnées de référence :
ja: 基準座標：
pt: Coordenadas fiduciais:
ru: Реперные координаты:
zh_cn: 基准坐标：

# TbSetPoints.ToolTip
source: Fiducial coordinates: Only the 1st and 2nd will be used. Get fiducials coordinates from imported graphic, or collect them manualy: Ctrl-Click to mark, "a" to append to list, "c" to clear list.
ar: الإحداثيات الإيمانية: سيتم استخدام الإحداثيات الأولى والثانية فقط. احصل على إحداثيات fiducials من الرسوم المستوردة ، أو اجمعها يدويًا: Ctrl- انقر لتحديد ، "أ" للإلحاق بالقائمة ، "ج" لمسح القائمة.
cs: Výchozí souřadnice: Budou použity pouze 1. a 2. souřadnice. Získejte souřadnice referenčních značek z importované grafiky nebo je shromážděte ručně: Ctrl-Klikněte pro označení, "a" pro připojení k seznamu, "c" pro vymazání seznamu.
de_de: Passmarken Koordinaten: Es werden nur die 1. und 2. verwendet. Referenzkoordinaten werden aus Grafiken importiert oder sammeln Sie sie manuell: Strg-Klick zum Markieren, "a" zum Anhängen an die Liste, "c" zum Löschen der Liste.
es: Coordenadas fiduciales: solo se utilizarán la 1ª y la 2ª. Obtenga coordenadas fiduciales de gráficos importados o recójelos manualmente: Ctrl-clic para marcar, "a" para agregar a la lista, "c" para borrar la lista.
fr: Coordonnées de référence : Seuls le 1er et le 2e seront utilisés. Obtenez les coordonnées des repères à partir du graphique importé ou collectez-les manuellement : Ctrl-Clic pour marquer, "a" à ajouter à la liste, "c" pour effacer la liste.
ja: 基準座標：1番目と2番目のみが使用されます。 インポートしたグラフィックから基準座標を取得するか、手動で収集します。 Ctrl-クリックしてマーク、 リストに追加する「a」、 リストをクリアするには「c」。
pt: Coordenadas fiduciais: Apenas a 1ª e a 2ª serão utilizadas. Obtenha as coordenadas fiduciais do gráfico importado ou colete-as manualmente: Ctrl-clique para marcar, "a" para anexar à lista, "c" para limpar a lista.
ru: Реперные координаты: будут использоваться только 1-я и 2-я координаты. Получите координаты реперных точек из импортированной графики или соберите их вручную: Ctrl-щелчок, чтобы отметить, "a" добавить в список, «c», чтобы очистить список.
zh_cn: 基准坐标：仅使用第 1 个和第 2 个坐标。 从导入的图形中获取基准坐标，或手动收集它们： Ctrl-单击标记， “a”附加到列表， “c”清除列表。
