Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlProbing.*.resx
Languages: ar, cs, de_de, fr, it, ja, pt, tr, zh_cn

# label1.Text
source: Probe / cutter diameter
ar: التحقيق / قطر القاطع
cs: Průměr sondy / frézy
de_de: Wkzg. Durchmesser
fr: Diamètre de la fraise
it: Diametro sonda/fresa
ja: プローブ/カッター直径
pt: Sonda / diâmetro do cortador
tr: Prob / kesici çapı (PD)
zh_cn: 切刀直径

# label1.ToolTip
source: Diameter of probing tip or cutter head to calculate zero position
ar: قطر رأس السبر أو رأس السبر لحساب نقطة الصفر
cs: Průměr snímacího hrotu nebo řezné hlavy pro výpočet nulové polohy
de_de: Durchmesser der Tastspitze oder des Fräserkopfes zur Berechnung der Nullposition
fr: Diamètre de la pointe de sonde ou de la tête de coupe pour calculer la position zéro
it: Diametro della punta di tastatura o della testa di taglio per calcolare la posizione zero
ja: ゼロ位置を計算するためのプローブチップまたはカッターヘッドの直径
pt: Diâmetro da ponta de sondagem ou da cabeça do cortador para calcular a posição zero
tr: Sıfır konumunu hesaplamak için prob ucunun veya kesici kafasının çapı
zh_cn: 探针或刀头直径以计算零位

# label2.Text
source: Max. Probing distance
ar: ماكس. التحقيق المسافة
cs: Max. Vzdálenost sondy
de_de: Max. Abtastfahrweg
fr: Max. Distance de sondage
it: Massimo Distanza di indagine
ja: 最大 プロービング距離
pt: Máx. Distância de sondagem
tr: Maks. Prob mesafesi (MPD)
zh_cn: 最高 探测距离

# label2.ToolTip
source: Maximum distance to move, to find an edge
ar: أقصى مسافة للتحرك ، لإيجاد حافة
cs: Maximální vzdálenost k pohybu, k nalezení hrany
de_de: Maximale Entfernung, um eine Kante zu finden
fr: Distance maximale à déplacer pour trouver un bord
it: Distanza massima per spostarsi, per trovare un bordo
ja: 移動する最大距離、エッジを見つける
pt: Distância máxima para se mover, para encontrar uma borda
tr: Bir kenar bulmak için hareket edilecek maksimum mesafe
zh_cn: 查找边缘的最大移动距离

# label3.Text
source: Probing feed rate
ar: فحص معدل التغذية
cs: Rychlost posuvu sondy
de_de: Abtastgeschwindigkeit
fr: Taux d'alimentation
it: Velocità di avanzamento della sonda
ja: 送り速度のプロービング
pt: Taxa de avanço de sondagem
tr: Tarama besleme hızı
zh_cn: 进给速度

# label4.Text
source: Touch plate dimension
ar: لوحة اللمس البعد
cs: Rozměr dotykové desky
de_de: Tastplattendicke
fr: Palpage offset
it: Dimensione della piastra di contatto
ja: タッチプレート寸法
pt: Dimensão da placa de toque
tr: Dokunmatik plaka boyutu
zh_cn: 探测偏移

# label4.ToolTip
source: Offset to probed zero position, caused by touch plate, gage block or aluminum foil
ar: إزاحة إلى موضع صفري مجبر ، ناتج عن لوحة لمس ، كتلة غيج أو رقائق ألمنيوم
cs: Offset vůči snímané nulové poloze, způsobený dotykovou deskou, měrkou nebo hliníkovou fólií
de_de: Offset zur abgetasteten Nullposition, verursacht durch Tastplatte, Endmaß oder Aluminiumfolie
fr: Décalage par rapport à la position zéro détectée, provoqué par une plaque tactile ou une feuille d'aluminium
it: Offset alla posizione zero tastato, causato da piastra di contatto, blocchetto di riscontro o foglio di alluminio
ja: タッチプレート、ゲージブロック、またはアルミ箔が原因で、プローブされたゼロ位置へのオフセット
pt: Deslocamento para a posição zero sondada, causada por placa de toque, bloco de medição ou folha de alumínio
tr: Dokunmatik plaka, mastar bloğu veya alüminyum folyonun neden olduğu problanmış sıfır konumuna ofset
zh_cn: 由触摸板或铝箔引起的偏移到探测的零位置

# cBZProbing.Text
source: Probe Z also
ar: التحقيق Z أيضا
cs: Sonda Z také
de_de: Auch Z abtasten
fr: La sonde Z aussi
it: Anche la sonda Z
ja: プローブZも
pt: A sonda Z também
tr: Prob Z ayrıca
zh_cn: 探针Z也

# cBZProbing.ToolTip
source: Probe Z finally, after successful edge or corner probing
ar: دقق في النهاية ، بعد اختبار الحافة أو الزاوية الناجحة
cs: Po úspěšném nasnímání hrany nebo rohu sondy Z nakonec
de_de: Z abtasten nach Kanten- oder Eckenabtastung
it: Infine, la sonda Z, dopo la tastatura di spigoli o spigoli riuscita
ja: エッジまたはコーナーのプローブに成功した後、最後にプローブZ
pt: Teste Z finalmente, após uma sondagem bem-sucedida na borda ou no canto
tr: Başarılı bir kenar veya köşe araştırmasından sonra nihayet Z Sondası
zh_cn: 在成功进行边缘或角部探测之后，最终探测Z

# nUDDiameter.ToolTip
source: Diameter of probing tip or cutter head to calculate zero position
fr: Diamètre de la pointe de sonde ou de la tête de coupe pour calculer la position zéro
it: Diametro della punta di tastatura o della testa di taglio per calcolare la posizione zero
zh_cn: 探针或刀头直径以计算零位

# nUDOffsetX.ToolTip
source: Offset to probed zero position, caused by gage block or aluminum foil
ar: إزاحة إلى موضع صفري مجبر ، ناتج عن كتلة غيج أو رقائق ألمنيوم
cs: Offset k nulové poloze sondy, způsobený měřidlem nebo hliníkovou fólií
de_de: Offset to probed zero position, caused by touch plate, gage block or aluminum foil
fr: Décalage par rapport à la position zéro détectée, provoqué par une plaque tactile ou une feuille d'aluminium
it: Offset alla posizione zero sondata, causato dal blocco di riscontro o dal foglio di alluminio
ja: ゲージブロックまたはアルミ箔が原因でプローブされたゼロ位置へのオフセット
pt: Deslocamento para a posição zero sondada, causada por bloco de medição ou folha de alumínio
tr: Gösterge bloğu veya alüminyum folyonun neden olduğu, problanmış sıfır konumuna ofset
zh_cn: 由触摸板或铝箔引起的偏移到探测的零位置

# nUDOffsetY.ToolTip
source: Offset to probed zero position, caused by gage block or aluminum foil
ar: إزاحة إلى موضع صفري مجبر ، ناتج عن كتلة غيج أو رقائق ألمنيوم
cs: Offset k nulové poloze sondy, způsobený měřidlem nebo hliníkovou fólií
de_de: Offset to probed zero position, caused by touch plate, gage block or aluminum foil
fr: Décalage par rapport à la position zéro détectée, provoqué par une plaque tactile ou une feuille d'aluminium
it: Offset alla posizione zero sondata, causato dal blocco di riscontro o dal foglio di alluminio
ja: ゲージブロックまたはアルミ箔が原因でプローブされたゼロ位置へのオフセット
pt: Deslocamento para a posição zero sondada, causada por bloco de medição ou folha de alumínio
tr: Gösterge bloğu veya alüminyum folyonun neden olduğu problanmış sıfır konumuna ofset
zh_cn: 由触摸板或铝箔引起的偏移到探测的零位置

# nUDOffsetZ.ToolTip
source: Offset to probed zero position, caused by gage block or aluminum foil
ar: إزاحة إلى موضع صفري مجبر ، ناتج عن كتلة غيج أو رقائق ألمنيوم
cs: Offset k nulové poloze sondy, způsobený měřidlem nebo hliníkovou fólií
de_de: Offset to probed zero position, caused by touch plate, gage block or aluminum foil
fr: Décalage par rapport à la position zéro détectée, provoqué par une plaque tactile ou une feuille d'aluminium
it: Offset alla posizione zero sondata, causato dal blocco di riscontro o dal foglio di alluminio
ja: ゲージブロックまたはアルミ箔が原因でプローブされたゼロ位置へのオフセット
pt: Deslocamento para a posição zero sondada, causada por bloco de medição ou folha de alumínio
tr: Gösterge bloğu veya alüminyum folyonun neden olduğu problanmış sıfır konumuna ofset
zh_cn: 由触摸板或铝箔引起的偏移到探测的零位置

# gBHardware.Text
source: Hardware dimensions
ar: أبعاد الأجهزة
cs: Rozměry hardwaru
de_de: Hardware Abmessungen
fr: Dimensions du matériel
it: Dimensioni hardware
ja: ハードウェア寸法
pt: Dimensões de hardware
tr: Donanım boyutları
zh_cn: 硬件尺寸

# label14.Text
source: Save distance
ar: حفظ المسافة
cs: Ušetřete vzdálenost
de_de: Sicherheitsabstand
fr: Distance de sécurité
it: Salva distanza
ja: 距離を節約
pt: Salvar distância
tr: Güvenli mesafe (SD)
zh_cn: 安全距离

# label14.ToolTip
source: Retract by this distance after success probing
ar: التراجع عن طريق هذه المسافة بعد تحقيق النجاح
cs: Po úspěšném snímání se stáhněte o tuto vzdálenost
de_de: Fahre zurück um diesen Wert
fr: Après une numérisation réussie, revenez sur cette distance
it: Ritira di questa distanza dopo il successo del sondaggio
ja: プロービング成功後にこの距離だけ後退する
pt: Retraia por essa distância após a verificação do sucesso
tr: Başarılı araştırmadan sonra bu mesafe kadar geri çekil
zh_cn: 成功扫描后，向后行驶此距离

# lblProbeFinal.Text
source: Final position after probing
ar: الموقف النهائي بعد التحقيق
cs: Konečná poloha po sondování
de_de: Endposition nach dem Antasten
it: Posizione finale dopo il sondaggio
ja: プロービング後の最終位置
pt: Posição final após sondagem
tr: Sondajdan sonraki son konum
zh_cn: 探测后的最终位置

# lblProbeFinal.ToolTip
source: Finally move to this position
ar: وأخيرا انتقل إلى هذا الموقف
cs: Nakonec se přesuňte do této polohy
de_de: Fahre zum Schluß zu dieser Position
fr: Position finale après le sondage
it: Infine spostati in questa posizione
ja: 最後にこの位置に移動します
pt: Finalmente, vá para esta posição
tr: Son olarak bu pozisyona geçin
zh_cn: 探测后的最终位置

# nUDWorkpieceDiameter.ToolTip
source: Diameter of workpiece to determine probing distance
ar: قطر الشغل لتحديد المسافة التحقيق
cs: Průměr obrobku pro určení snímací vzdálenosti
de_de: Durchmesser des Werkstücks zur Ermittlung des Tastabstands
fr: Diamètre de la pièce à usiner pour déterminer la distance de palpage
it: Diametro del pezzo per determinare la distanza di tastatura
ja: プローブ距離を決定するワークピースの直径
pt: Diâmetro da peça de trabalho para determinar a distância de apalpação
tr: Problama mesafesini belirlemek için iş parçasının çapı
zh_cn: 工件直径以确定探测距离

# nUDProbeFinalZ.ToolTip
source: Finally move to this position
ar: وأخيرا انتقل إلى هذا الموقف
cs: Nakonec se přesuňte do této polohy
de_de: Fahre zum Schluß zu dieser Position
fr: Position finale après le sondage
it: Infine spostati in questa posizione
ja: 最後にこの位置に移動します
pt: Finalmente, vá para esta posição
tr: Son olarak bu pozisyona geçin
zh_cn: 探测后的最终位置

# nUDProbeFinalY.ToolTip
source: Finally move to this position
ar: وأخيرا انتقل إلى هذا الموقف
cs: Nakonec se přesuňte do této polohy
de_de: Fahre zum Schluß zu dieser Position
fr: Position finale après le sondage
it: Infine spostati in questa posizione
ja: 最後にこの位置に移動します
pt: Finalmente, vá para esta posição
tr: Son olarak bu pozisyona geçin
zh_cn: 探测后的最终位置

# nUDProbeFinalX.ToolTip
source: Finally move to this position
ar: وأخيرا انتقل إلى هذا الموقف
cs: Nakonec se přesuňte do této polohy
de_de: Fahre zum Schluß zu dieser Position
fr: Position finale après le sondage
it: Infine spostati in questa posizione
ja: 最後にこの位置に移動します
pt: Finalmente, vá para esta posição
tr: Son olarak bu pozisyona geçin
zh_cn: 探测后的最终位置

# nUDProbeSaveZ.ToolTip
source: Retract by this distance after success probing
ar: التراجع عن طريق هذه المسافة بعد تحقيق النجاح
cs: Po úspěšném snímání se stáhněte o tuto vzdálenost
de_de: Fahre zurück um diesen Wert
fr: Après une numérisation réussie, revenez sur cette distance
it: Ritira di questa distanza dopo il successo del sondaggio
ja: プロービング成功後にこの距離だけ後退する
pt: Retraia por essa distância após a verificação do sucesso
tr: Başarılı araştırmadan sonra bu mesafe kadar geri çekil
zh_cn: 成功扫描后，向后行驶此距离

# nUDProbeSaveY.ToolTip
source: Retract by this distance after success probing
ar: التراجع عن طريق هذه المسافة بعد تحقيق النجاح
cs: Po úspěšném snímání se stáhněte o tuto vzdálenost
de_de: Fahre zurück um diesen Wert
fr: Après une numérisation réussie, revenez sur cette distance
it: Ritira di questa distanza dopo il successo del sondaggio
ja: プロービング成功後にこの距離だけ後退する
pt: Retraia por essa distância após a verificação do sucesso
tr: Başarılı araştırmadan sonra bu mesafe kadar geri çekil
zh_cn: 成功扫描后，向后行驶此距离

# nUDProbeSaveX.ToolTip
source: Retract by this distance after success probing
ar: التراجع عن طريق هذه المسافة بعد تحقيق النجاح
cs: Po úspěšném snímání se stáhněte o tuto vzdálenost
de_de: Fahre zurück um diesen Wert
fr: Après une numérisation réussie, revenez sur cette distance
it: Ritira di questa distanza dopo il successo del sondaggio
ja: プロービング成功後にこの距離だけ後退する
pt: Retraia por essa distância após a verificação do sucesso
tr: Başarılı araştırmadan sonra bu mesafe kadar geri çekil
zh_cn: 成功扫描后，向后行驶此距离

# nUDProbeTravelZ.ToolTip
source: Maximum distance to move, to find an edge
ar: أقصى مسافة للتحرك ، لإيجاد حافة
cs: Maximální vzdálenost k pohybu, k nalezení hrany
de_de: Maximale Entfernung, um eine Kante zu finden
fr: Distance maximale à déplacer pour trouver un bord
it: Distanza massima per spostarsi, per trovare un bordo
ja: 移動する最大距離、エッジを見つける
pt: Distância máxima para se mover, para encontrar uma borda
tr: Bir kenar bulmak için hareket edilecek maksimum mesafe
zh_cn: 查找边缘的最大移动距离

# nUDProbeTravelY.ToolTip
source: Maximum distance to move, to find an edge
ar: أقصى مسافة للتحرك ، لإيجاد حافة
cs: Maximální vzdálenost k pohybu, k nalezení hrany
de_de: Maximale Entfernung, um eine Kante zu finden
fr: Distance maximale à déplacer pour trouver un bord
it: Distanza massima per spostarsi, per trovare un bordo
ja: 移動する最大距離、エッジを見つける
pt: Distância máxima para se mover, para encontrar uma borda
tr: Bir kenar bulmak için hareket edilecek maksimum mesafe
zh_cn: 查找边缘的最大移动距离

# nUDProbeTravelX.ToolTip
source: Maximum distance to move, to find an edge
ar: أقصى مسافة للتحرك ، لإيجاد حافة
cs: Maximální vzdálenost k pohybu, k nalezení hrany
de_de: Maximale Entfernung, um eine Kante zu finden
fr: Distance maximale à déplacer pour trouver un bord
it: Distanza massima per spostarsi, per trovare un bordo
ja: 移動する最大距離、エッジを見つける
pt: Distância máxima para se mover, para encontrar uma borda
tr: Bir kenar bulmak için hareket edilecek maksimum mesafe
zh_cn: 查找边缘的最大移动距离

# rBCF2.ToolTip
source: Find center and set 0;0 Z up = Z start + Z probing Finally move to center
ar: البحث عن مركز وتعيين 0 ؛ 0 Z up = Z start + Z probing أخيرا الانتقال إلى المركز
cs: Najděte střed a nastavte 0;0 Z nahoru = Z start + Z sondování Nakonec se přesuňte do středu
de_de: Mitte finden und setzen von 0; 0 Z up = Z start + Z probing Abschließend in die Mitte fahren
fr: Trouver le centre et régler 0; 0 Z up = Z start + Z sondage Enfin déplacer au centre
it: Trova il centro e imposta 0;0 Z su = Z inizio + Z tastatura Infine spostati al centro
ja: 中心を見つけて0; 0を設定 Z up = Z start + Zプローブ 最後に中央に移動
pt: Encontre o centro e defina 0; 0 Z up = Z start + Z sondagem Finalmente, vá para o centro
tr: Merkezi bulun ve 0;0 olarak ayarlayın Z yukarı = Z başlatma + Z tarama Son olarak merkeze taşı
zh_cn: 查找中心并设置0; 0 Z up = Z start + Z探测 最终移到中心

# rBCF1.ToolTip
source: Find center and set 0;0 Finally move to center
ar: البحث عن مركز وتعيين 0 ؛ 0 أخيرا الانتقال إلى المركز
cs: Najděte střed a nastavte 0;0
de_de: Mitte finden und 0; 0 setzen Abschließend wird die Mitte angefahren
fr: Trouver le centre et régler 0; 0 Enfin déplacer au centre
it: Infine spostati al centro Trova il centro e imposta 0;0
ja: 中心を見つけて0; 0を設定 最後に中央に移動
pt: Encontre o centro e defina 0; 0 Finalmente, vá para o centro
tr: Merkezi bulun ve 0;0 olarak ayarlayın Son olarak merkeze taşı
zh_cn: 查找中心并设置0; 0 最终移到中心

# btnGetAngleEF.Text
source: Rotate G-Code by angle
ar: تدوير G- كود من زاوية
cs: Nakonec se přesuňte do středu
de_de: G-Code drehen
fr: Faire pivoter le code G par angle
it: Ruota il codice G di angolo
ja: Gコードを角度で回転
pt: Gire o código G pelo ângulo
tr: G-Kodunu açıyla döndür
zh_cn: 按角度旋转G代码

# btnGetAngleEF.ToolTip
source: Correction angle will be calculated form vertical (X probing) or horizontal edge (Y probing) of workpiece
ar: سيتم احتساب زاوية التصحيح بشكل عمودي (اختبار س) أو حافة أفقية (اختبار ص) للشغل
cs: Korekční úhel bude vypočítán ze svislé (snímání X) nebo vodorovné hrany (snímání Y) obrobku
de_de: Der Korrekturwinkel wird anhand der vertikalen (X-Messung) oder horizontalen Kante (Y-Messung) des Werkstücks berechnet
fr: L'angle de correction sera calculé à partir de la verticale de la pièce à usiner (palpage X) ou horizontale (palpage Y)
it: L'angolo di correzione sarà calcolato dal bordo verticale (tastatura X) o orizzontale (tastatura Y) del pezzo
ja: 補正角度は、ワークの垂直（Xプローブ）または水平エッジ（Yプローブ）から計算されます
pt: O ângulo de correção será calculado na vertical (sondagem X) ou na borda horizontal (sondagem Y) da peça
tr: Düzeltme açısı, iş parçasının dikey (X problama) veya yatay kenar (Y problama) şeklinde hesaplanacaktır.
zh_cn: 通过工件的垂直（X探测）或水平边缘（Y探测）计算校正角

# tBAngle.ToolTip
source: Correction angle will be calculated form vertical (X probing) or horizontal edge (Y probing) of workpiece
ar: سيتم احتساب زاوية التصحيح بشكل عمودي (اختبار س) أو حافة أفقية (اختبار ص) للشغل
cs: Korekční úhel bude vypočítán ze svislé (snímání X) nebo vodorovné hrany (snímání Y) obrobku
de_de: Der Korrekturwinkel wird anhand der vertikalen (X-Messung) oder horizontalen Kante (Y-Messung) des Werkstücks berechnet
fr: L'angle de correction sera calculé à partir de la verticale de la pièce à usiner (palpage X) ou horizontale (palpage Y)
it: L'angolo di correzione sarà calcolato dal bordo verticale (tastatura X) o orizzontale (tastatura Y) del pezzo
ja: 補正角度は、ワークの垂直（Xプローブ）または水平エッジ（Yプローブ）から計算されます
pt: O ângulo de correção será calculado na vertical (sondagem X) ou na borda horizontal (sondagem Y) da peça
tr: Düzeltme açısı, iş parçasının dikey (X problama) veya yatay kenar (Y problama) şeklinde hesaplanacaktır.
zh_cn: 通过工件的垂直（X探测）或水平边缘（Y探测）计算校正角

# cBSetCoordTL.Text
source: Set G92 Z coord. for 1st tool
ar: تعيين تنسيق G92 Z. لأداة 1ST
cs: Sada G92 Z coord. pro 1. nástroj
de_de: G92 Z-Koordinate für das 1. Werkzeug verwenden
fr: Utiliser la coordonnée Z G92 pour le 1er outil
it: Impostare la coordinata Z G92. per il 1° strumento
ja: G92 Z座標を設定します。 最初のツール用
pt: Defina G92 Z coord. para a primeira ferramenta
tr: G92 Z koordinatını ayarlayın. 1. alet için
zh_cn: 将G92 Z坐标用于第一个工具

# cBSetCoordTL.ToolTip
source: Set G92 Z
ar: تعيين G92 Z
cs: Sada G92 Z
de_de: G92 Z einstellen
it: Impostare G92 Z
ja: G92 Zを設定
pt: Conjunto G92 Z
tr: G92 Z'yi ayarlayın
zh_cn: 套装G92 Z

# btnSaveTL.Text
source: Move Z to save pos.
ar: نقل Z لإنقاذ نقاط البيع.
cs: Posuňte Z pro uložení pozice.
de_de: Fahre Z zur sicheren Position
fr: Conduire Z en position de sécurité
it: Sposta Z per salvare la pos.
ja: Zを移動して位置を保存します。
pt: Mova Z para salvar a pos.
tr: Z'yi güvenli konuma taşıyın.
zh_cn: 将Z驱动到安全位置

# btnSaveTL.ToolTip
source: Use G90 absolute coordinate
ar: استخدام G90 الإحداثيات المطلقة
cs: Použijte absolutní souřadnici G90
de_de: Verwendet absolute Koordinaten G90
fr: Utiliser les coordonnées absolues G90
it: Utilizzare la coordinata assoluta G90
ja: G90絶対座標を使用
pt: Use a coordenada absoluta G90
tr: G90 mutlak koordinatını kullan
zh_cn: 使用G90绝对坐标

# cBSetCenterZero.Text
source: Set tool center as zero
ar: تعيين مركز الأداة كصفر
cs: Nastavte střed nástroje na nulu
de_de: Wkzg.mitte auf Null setzen
it: Imposta il centro utensile su zero
ja: 工具中心をゼロに設定
pt: Defina o centro da ferramenta como zero
tr: Takım merkezini sıfır olarak ayarla
zh_cn: 将工具中心设为零

# cBSetCenterZero.ToolTip
source: If checked, the tool (probe / cutter) center defines the zero position. Usually the border of the tool (probe / cutter) is used to define zero.
ar: في حالة تحديده ، يحدد مركز الأداة (المسبار / القاطع) موضع الصفر. عادةً ما يتم استخدام حدود الأداة (المسبار / القاطع) لتحديد الصفر.
cs: Je-li zaškrtnuto, střed nástroje (sondy / frézy) definuje nulovou polohu. Obvykle se k definování nuly používá okraj nástroje (sonda / fréza).
de_de: Wenn aktiviert, definiert die Werkzeugmitte (Messtaster / Fräser) die Nullposition. Normalerweise wird der Rand des Werkzeugs (Messtaster / Fräser) zum Definieren von Null verwendet.
it: Se selezionato, il centro dell'utensile (tastatore/fresa) definisce la posizione zero. Solitamente si usa il bordo dell'utensile (tastatore/fresa) per definire lo zero.
ja: チェックすると、ツール（プローブ/カッター）の中心がゼロ位置を定義します。 通常、ゼロの定義にはツールの境界（プローブ/カッター）が使用されます。
pt: Se marcado, o centro da ferramenta (sonda / cortador) define a posição zero.
tr: İşaretlenirse, takım (prob / kesici) merkezi sıfır konumunu tanımlar. Genellikle aletin (prob / kesici) kenarlığı sıfırı tanımlamak için kullanılır.
zh_cn: 如果选中，则工具（探针/刀具）中心定义为零位置。 通常，工具（探针/刀具）的边界用于定义零。

# gBMovement.Text
source: Probe movement
ar: دقق الحركة
cs: Pohyb sondy
de_de: Abtastbewegung
fr: Mouvement de la sonde
it: Movimento della sonda
ja: プローブの動き
pt: Movimento da sonda
tr: Prob hareketi
zh_cn: 测头运动

# label20.Text
source: Measured correction angle:
ar: زاوية تصحيح قياس
cs: Změřený korekční úhel
de_de: Gemessener Korrekturwinkel
fr: Angle de correction mesuré:
it: Angolo di correzione misurato
ja: 測定された補正角度
pt: Ângulo de correção medido
tr: Ölçülen düzeltme açısı
zh_cn: 实测校正角

# label19.Text
source: Select egde or corner to detect. Place tool tip in front of edge. On corners, X will be probed first, then Y. Z will be probed last. Probe edge a 2nd time on another position to get angle.
ar: حدد حافة الزاوية للكشف عنها. ضع طرف الأداة أمام الحافة. في الزوايا ، سيتم اختبار X أولاً ، ثم Y. وسيتم التحقيق Z الماضي. دقق في الحافة مرة ثانية على موقع آخر للحصول على زاوية.
cs: Vyberte hranu nebo roh k detekci. Umístěte hrot nástroje před okraj. V rozích bude nejprve sondováno X, poté Y. Z bude sondována jako poslední. Pro získání úhlu zjistěte hranu sondy podruhé na jiné pozici.
de_de: Wähle die Kante für die zu erkennende Ecke aus. Die Werkzeugspitze vor die Kante legen. In den Ecken wird zuerst X und dann Y geprüft. Z wird zuletzt geprüft. Sondenkante ein zweites Mal an einer anderen Position, um den Winkel zu bestimmen.
fr: Sélectionnez le bord ou le coin à reconnaître. Déplacez la pointe de l'outil devant le bord. Dans les coins, X puis Y sont cochés. Z est vérifié en dernier.
it: Selezionare il bordo o l'angolo da rilevare. Posizionare la punta dell'utensile davanti al bordo. Sugli angoli, verrà rilevato prima X, quindi Y. Z sarà sondato per ultimo. Sonda il bordo una seconda volta su un'altra posizione per ottenere l'angolo.
ja: 検出するコーナーのエッジを選択します。 先端の前にツールチップを置きます。 コーナーでは、Xが最初にプローブされ、次にYがプローブされます。 Zは最後にプローブされます。 角度を取得するために、別の位置で2回目のエッジをプローブします。
pt: Selecione egde ou canto para detectar. Coloque a ponta da ferramenta na frente da borda. Nos cantos, X será testado primeiro e depois Y. Z será testado por último. Borda da sonda uma segunda vez em outra posição para obter ângulo.
tr: Tespit edilecek kenarı veya köşeyi seçin. Alet ucunu kenarın önüne yerleştirin. Köşelerde, önce X, ardından Y incelenecektir. Z en son incelenecektir. Açı elde etmek için kenarı başka bir konumda 2. kez inceleyin.
zh_cn: 选择要识别的边缘或角。 将工具提示移到边缘的前面。 在角落，首先检查X，然后检查Y。 Z最后检查。

# lblEFProgressInfo.Text
source: Progress
ar: تقدم
cs: Pokrok
de_de: Fortschritt
fr: Le progrès
it: Progresso
ja: 進捗
pt: Progresso
tr: İlerlemek
zh_cn: 进展

# btnStartEF.Text
source: Start
ar: بداية
fr: Début
it: Inizio
ja: 開始
pt: Começar
tr: Başlangıç
zh_cn: 开始

# btnCancelEF.Text
source: Cancel
ar: إلغاء
cs: zrušení
de_de: Abbruch
fr: Annuler
it: Annulla
ja: キャンセル
pt: Cancelar
tr: İptal etmek
zh_cn: 取消

# rB5.Text
source: Only Z
ar: فقط Z
cs: Pouze Z
de_de: Nur Z
fr: Seulement z
it: Solo Z
ja: Zのみ
pt: Apenas Z
tr: sadece Z
zh_cn: 只有Z

# tabPage1.Text
source: Edge finder
ar: مكتشف الحافة
cs: Hledač hran
de_de: Kantenfinder
fr: Tranchant
it: Cerca bordo
ja: エッジファインダー
tr: Kenar bulucu
zh_cn: 坎特·芬顿
