Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlHeightMap.*.resx
Languages: ar, cs, de_de, es, fr, it, pl, pt, ru, tr, zh_cn

# RbScanYX.ToolTip
source: Column by column zig-zag
cs: Sloupec po sloupci cik-cak
pl: Kolumna po kolumnie zygzakiem
pt: Coluna por coluna em zig-zag
tr: Sütun sütun zikzak

# RbScanXY.ToolTip
source: Line by line zig-zag
cs: Řádek po řádku cik-cak
pl: Linia po linii zygzakiem
pt: Linha por linha em zig-zag
tr: Satır satır zikzak

# RbScanY.Text
source: Scan Y, extrude X
cs: Skenovat Y, vysunout X
es: Skenovat Y, vysunout X
it: Scansiona Y, estrudi X
pl: Skanowanie Y, wytłaczanie X
pt: Escanear Y, extrudar X
tr: Y'yi tara, X'i çıkart

# CbExtrudeEnable.Text
source: Probe one axis, extrude other
cs: Sondujte jednu osu, vytlačte druhou
es: Sondujte jednu osu, vytlačte druhou
it: Sonda un asse, estrudi l'altro
pl: Sonda w jednej osi, wytłaczanie w drugiej
pt: Sonde um eixo, faça a extrusão do outro
tr: Bir ekseni araştırın, diğerini çıkartın

# RbScanX.Text
source: Scan X, extrude Y
cs: Skenovat X, vysunout Y
es: Skenovat X, vysunout Y
it: Scansiona X, estrudi Y
pl: Skanowanie X, wytłaczanie Y
pt: Escanear X, extrudar Y
tr: X'i tara, Y'yi çıkart

# CbRoundUp.Text
source: Round up
cs: Zaokrouhlit nahoru
es: Redondeo
it: Arrotondare
pl: Zaokrąglij
pt: Arredondar para cima
tr: Hesabı yuvarlamak

# BtnPosFromCodeDimension.Text
source: Dimensions from loaded GCode
cs: Rozměry z načteného GCode
es: Dimensiones de GCode cargado
it: Dimensioni da GCode caricato
pl: Wymiary z wczytanego G-Code
pt: Dimensões do GCode carregado
tr: Yüklenen GCode'dan boyutlar

# BtnMoveUR.Text
source: Move to 🡵
ar: انتقل إلى 🡵
cs: Přesuňte se na 🡵
it: Passa a 🡵
pl: Idź do 🡵
tr: 🡵'ya taşı
zh_cn: 移到🡵

# BtnMoveLL.Text
source: Move to 🡷
ar: انتقل إلى 🡷
cs: Přesuňte se na 🡷
it: Passa a 🡷
pl: Idź do 🡷
tr: 🡷'a taşı
zh_cn: 移步🡷

# label5.Text
source: Grid size X and Y (mash width)
ar: حجم الشبكة X و Y (عرض الهريس)
cs: Velikost mřížky X a Y (šířka kaše)
de_de: Gittergröße X und Y
es: Tamaño de cuadrícula X e Y
fr: Taille de grille X et Y
it: Dimensioni griglia X e Y (larghezza poltiglia)
pl: Wielkość siatki X i Y
pt: Tamanho da grade X e Y (largura do mash)
ru: Размер сетки X и Y
tr: Izgara boyutu X ve Y (püre genişliği)
zh_cn: 网格尺寸X和Y（混搭宽度）

# btnPosUR.Text
source: Get Pos. 🡵
ar: استخدام Pos الفعلي.
cs: Získejte Poz. 🡵
de_de: Aktuelle Pos.
es: Usar pos.
fr: Utilisez la pos.
it: Ottieni Pos. 🡵
pl: Weź pozycję 🡵
pt: Use a pos.
ru: Используйте актуальный поз.
tr: Pozisyon alın. 🡵
zh_cn: 使用实际的位置。

# btnPosUR.ToolTip
source: Get actual machine position and set upper right coordinates
ar: الحصول على موقف الجهاز الفعلي وتعيين الإحداثيات اليمنى العليا
cs: Získejte aktuální polohu stroje a nastavte pravé horní souřadnice
de_de: Holen Sie sich die aktuelle Maschinenposition und stellen Sie die Koordinaten oben rechts ein
es: Obtenga la posición real de la máquina y configure las coordenadas superiores derecha
fr: Obtenir la position réelle de la machine et définir les coordonnées en haut à droite
it: Ottieni la posizione effettiva della macchina e imposta le coordinate in alto a destra
pl: Uzyskanie aktualnej pozycji maszyny i ustawienie prawych górnych współrzędnych
pt: Obtenha a posição atual da máquina e defina as coordenadas superiores à direita
ru: Получить фактическое положение машины и установить верхние правые координаты
tr: Gerçek makine konumunu alın ve sağ üst koordinatları ayarlayın
zh_cn: 获取实际机器位置并设置右上角坐标

# btnPosLL.Text
source: Get Pos. 🡷
ar: استخدام Pos الفعلي.
cs: Získejte Poz. 🡷
de_de: Aktuelle Pos.
es: Usar pos.
fr: Utilisez la pos.
it: Ottieni Pos. 🡷
pl: Weź pozycję 🡷
pt: Use a pos.
ru: Используйте актуальный поз.
tr: Pozisyon alın. 🡷
zh_cn: 使用实际的位置。

# btnPosLL.ToolTip
source: Get actual machine position and set lower left coordinates
ar: الحصول على موقف الجهاز الفعلي وتعيين الإحداثيات اليسرى السفلى
cs: Získejte aktuální polohu stroje a nastavte levé spodní souřadnice
de_de: Holen Sie sich die aktuelle Maschinenposition und stellen Sie die Koordinaten links unten ein
es: Obtenga la posición real de la máquina y configure las coordenadas inferiores izquierdas
fr: Obtenir la position réelle de la machine et définir les coordonnées en bas à gauche
it: Ottieni la posizione effettiva della macchina e imposta le coordinate in basso a sinistra
pl: Uzyskać aktualną pozycję maszyny i ustawić dolne lewe współrzędne
pt: Obtenha a posição real da máquina e defina as coordenadas inferiores esquerda
ru: Получить фактическое положение машины и установить нижние левые координаты
tr: Gerçek makine konumunu alın ve sol alt koordinatları ayarlayın
zh_cn: 获取实际机器位置并设置左下角坐标

# label1.Text
source: 🡷 Lower left
ar: النقطة اليسرى السفلى
cs: 🡷 Vlevo dole
de_de: Unten links
es: Abajo a la izquierda
fr: En bas à gauche
it: 🡷 In basso a sinistra
pl: 🡷 Lewy dolny
pt: Ponto inferior esquerdo
ru: Снизу слева
tr: 🡷 Sol alt
zh_cn: 左下

# label9.Text
source: 🡘🡙 Edge length
ar: طول الحافة
cs: 🡘🡙 Délka okraje
de_de: Kantenlänge
es: Longitud de la arista
fr: Longueur de bord
it: 🡘🡙 Lunghezza bordo
pl: 🡘🡙 Długość krawędzi
pt: Comprimento da aresta
ru: длина ребра
tr: 🡘🡙 Kenar uzunluğu
zh_cn: 边缘长度

# label4.Text
source: 🡵 Upper right
ar: النقطة اليمنى العليا
cs: 🡵 Vpravo nahoře
de_de: Oben rechts
es: Arriba a la derecha
fr: En haut à droite
it: 🡵 In alto a destra
pl: 🡵 Prawy górny
pt: Ponto superior direito
ru: В правом верхнем углу
tr: 🡵 Sağ üst
zh_cn: 右上方

# groupBox1.Text
source: Define Area to scan height information
ar: تحديد المنطقة لمسح معلومات الارتفاع
cs: Definujte oblast pro skenování informací o výšce
de_de: Gebiet des Höhenprofils
es: Perfil de área de altitud
fr: Profil de zone d'altitude
it: Definisci l'area per scansionare le informazioni sull'altezza
pl: Obszar profilu wysokości
pt: Definir Área para digitalizar informações de altura
ru: Площадь профиля высоты
tr: Yükseklik bilgilerini taramak için Alanı tanımlayın
zh_cn: 高度剖面面积

# label6.Text
source: Max depth
ar: أقصى عمق
cs: Maximální hloubka
de_de: Max. Tiefe
es: máxima profundidad
fr: profondeur max
it: profondità massima
pl: Max głęb.
pt: profundidade máxima
ru: Максимальная глубина
tr: Maksimum derinlik
zh_cn: 最大深度

# label7.Text
source: Safe height
ar: حفظ الارتفاع
cs: Uložit výšku
de_de: Sichere Höhe
es: Guardar altura
fr: Sauvegarder la hauteur
it: Risparmia altezza
pl: Bezp. wys.
pt: Salvar altura
ru: Сохранить высоту
tr: Güvenli yükseklik
zh_cn: 节省身高

# label8.Text
source: Z Feed rate
ar: سرعة التحقيق Z
cs: Z Rychlost posuvu
es: Velocidad de sondeo Z
fr: Vitesse de palpage Z
it: Z Velocità di avanzamento
pl: Posuw Z
pt: Velocidade de sondagem Z
ru: Скорость зондирования Z
tr: Z İlerleme hızı
zh_cn: 探测速度Z

# btnOffset.Text
source: set max. value = 0.0
ar: تعيين كحد أقصى. القيمة = 0.0
cs: nastavit max. hodnota = 0,0
de_de: Setze max. Wert = 0
it: impostare max. valore = 0,0
pl: Ustaw maks. wartość = 0.0
tr: maks. değer = 0.0
zh_cn: 设置最大值值 = 0.0

# btnOffset.ToolTip
source: Remove offset from all Z values
ar: إزالة الإزاحة من جميع القيم Z
cs: Odstraňte offset ze všech hodnot Z
de_de: Entferne Offset von allen Z Werten
es: Eliminar desplazamiento de todos los valores Z
fr: Supprimer le décalage de toutes les valeurs Z
it: Rimuovere l'offset da tutti i valori Z
pl: Usuń offset z wszystkich wartości Z
pt: Remover deslocamento de todos os valores Z
ru: Удалить смещение из всех значений Z
tr: Ofseti tüm Z değerlerinden kaldır
zh_cn: 从所有Z值中删除偏移

# btnStartHeightScan.Text
source: Generate Height Map
ar: توليد خريطة الارتفاع
cs: Generovat výškovou mapu
de_de: Scanne Höhenprofil
es: Generar mapa de altura
fr: Générer une carte de hauteur
it: Genera mappa altezza
pl: Gneruj mapę wysokości
pt: Gerar mapa de altura
ru: Создать карту высот
tr: Yükseklik Haritası Oluştur
zh_cn: 生成高度图

# btnStartHeightScan.ToolTip
source: Send height map scanning commands
ar: إرسال أوامر مسح خريطة الارتفاع
cs: Odešlete příkazy pro skenování výškové mapy
de_de: Sende Befehle um Höhenprofil einzulesen
es: Enviar comandos de escaneo de mapas de altura
fr: Envoyer des commandes d'analyse de carte de hauteur
it: Invia comandi di scansione della mappa dell'altezza
pl: Wysyłanie poleceń skanowania mapy wysokości
pt: Enviar comandos de verificação de mapa de altura
ru: Отправить команды сканирования карты высот
tr: Yükseklik haritası tarama komutlarını gönder
zh_cn: 发送高度图扫描命令

# lblProgress.Text
source: Finished
ar: تم الانتهاء من
cs: Hotovo
it: Finito
pl: Zakończone
tr: Bitti
zh_cn: 完成的

# lblMin.Text
source: min
ar: دقيقة
tr: dakika
zh_cn: 分钟

# lblMax.Text
source: max
ar: ماكس
tr: maks.
zh_cn: 最大限度

# lblMid.Text
source: mid
ar: منتصف
cs: střední
it: metà
tr: orta
zh_cn: 中

# btnApply.Text
source: Apply Height Map
ar: تطبيق خريطة الارتفاع
cs: Použít mapu výšky
de_de: Höhenprofil anwenden
es: Aplicar mapa de altura
fr: Appliquer la carte de hauteur
it: Applicare la mappa dell'altezza
pl: Zastosuj mapę wysokości
pt: Aplicar mapa de altura
ru: Применить карту высот
tr: Yükseklik Haritasını Uygula
zh_cn: 套用高度图

# btnApply.ToolTip
source: Apply height map to G-Code in main window
ar: قم بتطبيق خريطة الارتفاع على G-Code في النافذة الرئيسية
cs: Použijte výškovou mapu na G-kód v hlavním okně
de_de: Auto leveling: Höhenprofil auf G-Code anwenden
es: Nivelación automática: aplique el perfil de altitud al código G
fr: Mise à niveau automatique: appliquer le profil d'altitude au code G
it: Applica la mappa dell'altezza a G-Code nella finestra principale
pl: Zastosuj mapę wysokości do G-Code w oknie głównym
pt: Aplicar mapa de altura ao código G na janela principal
ru: Автоматическое выравнивание: применить профиль высоты к G-коду
tr: Yükseklik haritasını ana pencerede G-Code'a uygula
zh_cn: 自动调平：将海拔剖面应用于G代码

# loadHeightMapToolStripMenuItem.Text
source: Load Height Map
ar: تحميل خريطة الارتفاع
cs: Načíst mapu výšky
de_de: Lade Höhenprofil
es: Perfil de altura abierta
fr: Profilé ouvert
it: Carica la mappa dell'altezza
pl: Wczytaj mapę wysokości
pt: Mapa de altura de carga
ru: Открытый профиль высоты
tr: Yük Yüksekliği Haritası
zh_cn: 打开高度轮廓

# saveHeightMapToolStripMenuItem.Text
source: Save Height Map
ar: حفظ خريطة الارتفاع
cs: Uložit mapu výšky
de_de: Speichere Höhenprofil
es: Guardar perfil de altura
fr: Enregistrer le profil de hauteur
it: Salva la mappa dell'altezza
pl: Zapisz mapę wysokości
pt: Salvar mapa de altura
ru: Сохранить профиль высоты
tr: Yükseklik Haritasını Kaydet
zh_cn: 保存高度轮廓

# sTLToolStripMenuItem.Text
source: Import height profile from STL
cs: Import výškového profilu z STL
es: Importar perfil de altura desde STL
pl: Importuj profil wysokości z STL
pt: Importar perfil de altura de STL
tr: STL'den yükseklik profilini içe aktar

# importToolStripMenuItem.Text
source: Import
es: Importar
pl: Importuj
pt: Importar
tr: İçe aktarmak

# savePictureAsBMPToolStripMenuItem.Text
source: Save Picture as BMP
ar: حفظ الصورة باسم BMP
cs: Uložit obrázek jako BMP
de_de: Speichere Bild als BMP
es: Guardar como BMP
fr: Enregistrer sous BMP
it: Salva immagine come BMP
pl: Zapisz obraz jako BMP
pt: Salvar imagem como BMP
ru: Сохранить как BMP
tr: Resmi BMP Olarak Kaydet
zh_cn: 另存为BMP

# saveMapAsSTLToolStripMenuItem.Text
source: Save Map as STL
ar: حفظ الخريطة باسم STL
cs: Uložit mapu jako STL
de_de: Speichere Höhenprofil als STL
es: Guardar como STL
fr: Enregistrer sous STL
it: Salva mappa come STL
pl: Zapisz mapę jako STL
pt: Salvar mapa como STL
ru: Сохранить как STL
tr: Haritayı STL Olarak Kaydet
zh_cn: 另存为STL

# saveMapAsOBJToolStripMenuItem.Text
source: Save Map as OBJ
ar: حفظ الخريطة باسم OBJ
cs: Uložit mapu jako OBJ
de_de: Speichere Höhenprofil als OBJ
es: Guardar como OBJ
fr: Enregistrer sous OBJ
it: Salva mappa come OBJ
pl: Zapisz mapę jako OBJ
pt: Salvar mapa como OBJ
tr: Haritayı OBJ Olarak Kaydet
zh_cn: 另存为OBJ

# saveMapAsX3DToolStripMenuItem.Text
source: Save Map as X3D
ar: حفظ الخريطة باسم X3D
cs: Uložit mapu jako X3D
de_de: Speichere Höhenprofil als X3D
es: Guardar como X3D
fr: Enregistrer sous X3D
it: Salva mappa come X3D
pl: Zapisz mapę jako X3D
pt: Salvar mapa como X3D
ru: Сохранить как X3D
tr: Haritayı X3D Olarak Kaydet
zh_cn: 另存为X3D

# savePictureAsBWBMPToolStripMenuItem.Text
source: Export
ar: تصدير
cs: Vývozní
es: Exportar
fr: Exportation
it: Esportare
pl: Eksportuj
pt: Exportação
ru: экспорт
tr: İhracat
zh_cn: 出口

# CbInterpolate.Text
source: Interpolate
cs: Interpolovat
es: Interpolar
pl: Interpolacja
pt: Interpolar
tr: enterpolasyon

# cBGray.Text
source: Grayscale
ar: الرمادي
cs: Stupně šedi
de_de: Grauwert
es: Escala de grises
fr: Niveaux de gris
it: Scala di grigi
pl: Odcienie szarości
pt: Escala de cinza
ru: Оттенки серого
tr: gri tonlama
zh_cn: 灰阶

# cBGray.ToolTip
source: Show result picture in grayscale for further use as hight map image
ar: إظهار صورة النتيجة في تدرج الرمادي لاستخدامها مرة أخرى كصورة خريطة هايت
cs: Zobrazit výsledný obrázek ve stupních šedi pro další použití jako obrázek výšky mapy
de_de: Zeigen Sie das Ergebnisbild in Graustufen an, um es als Höhenkartenbild zu verwenden
es: Muestra la imagen del resultado en escala de grises para su uso posterior como imagen del mapa de altura
fr: Afficher l'image de résultat en niveaux de gris pour une utilisation ultérieure en tant qu'image de carte en hauteur
it: Mostra l'immagine del risultato in scala di grigi per un ulteriore utilizzo come immagine della mappa ad alta quota
pl: Pokaż obraz wynikowy w skali szarości do dalszego wykorzystania jako obraz mapy wysokości
pt: Mostrar imagem do resultado em escala de cinza para uso posterior como imagem de mapa alto
ru: Показать изображение результата в оттенках серого для дальнейшего использования в качестве изображения карты высот
tr: Yükseklik haritası görüntüsü olarak daha fazla kullanmak için sonuç resmini gri tonlamalı olarak göster
zh_cn: 以灰度显示结果图片，以进一步用作高度图图像

# groupBox3.Text
source: Result
ar: نتيجة
cs: Výsledek
de_de: Ergebnis
es: Resultado
fr: Résultat
it: Risultato
pl: Wynik
pt: Resultado
ru: результат
tr: Sonuç
zh_cn: 结果

# btnOffsetZ.Text
source: Z Offset
ar: Z الأوفست
it: Spostamento Z
pl: Przesunięcie Z
tr: Z Ofseti
zh_cn: Z 偏移

# btnOffsetZ.ToolTip
source: Add given offset to all Z values
ar: إضافة إزاحة معينة إلى جميع القيم Z
cs: Přidejte daný offset ke všem hodnotám Z
de_de: Addiere gegebenen Offset zu allen Z Werten
es: Agregar un desplazamiento dado a todos los valores Z
fr: Ajouter un décalage donné à toutes les valeurs Z
it: Aggiungi l'offset dato a tutti i valori Z
pl: Dodaj podane przesunięcie do wszystkich wartości Z
pt: Adicionar deslocamento dado a todos os valores Z
ru: Добавить данное смещение ко всем значениям Z
tr: Verilen ofseti tüm Z değerlerine ekle
zh_cn: 给定偏移量到所有Z值

# btnZoomZ.Text
source: Z Zoom
ar: تكبير Z
it: Zoom Z
pl: Powiększenie Z
tr: Z Yakınlaştır
zh_cn: Z 变焦

# btnZoomZ.ToolTip
source: Multiply all Z values with given value
ar: اضرب كل القيم Z مع القيمة المعطاة
cs: Vynásobte všechny hodnoty Z danou hodnotou
de_de: Multipliziere alle Z Werte mit gegebenen Wert
es: Multiplica todos los valores Z con el valor dado
fr: Multiplie toutes les valeurs Z avec une valeur donnée
it: Moltiplica tutti i valori Z per il valore dato
pl: Pomnóż wszystkie wartości Z z podaną wartoscią
pt: Multiplique todos os valores de Z com um determinado valor
ru: Умножьте все значения Z на заданное значение.
tr: Tüm Z değerlerini verilen değerle çarpın
zh_cn: 将所有Z值与给定值相乘

# btnInvertZ.Text
source: Invert Z
ar: عكس Z
cs: Invertovat Z
de_de: Invertiere Z
es: Invertir Z
fr: Inverser Z
it: Inverti Z
pl: Inwersja Z
pt: Inverter Z
ru: Инвертировать Z
tr: Z'yi Ters Çevir
zh_cn: 反转Z

# btnInvertZ.ToolTip
source: Switch sign of Z values
ar: تبديل علامة القيم Z
cs: Přepínací znaménko hodnot Z
de_de: Invertiere Z Werte (Vorzeichen wird von '+' auf '-' geändert und umgekehrt)
es: Cambiar signo de valores Z
fr: Changer le signe des valeurs Z
it: Cambia il segno dei valori Z
pl: Zmień znak wartości Z
pt: Alternar sinal dos valores Z
ru: Переключатель знака значений Z
tr: Z değerlerinin işaretini değiştir
zh_cn: 切换Z值的符号

# btnCutOffZ.Text
source: Z Cut off !!!
ar: Z قطع!
cs: Z Odříznout!!!
es: Z ¡Corta!
fr: Z coupé !!!
it: Z Tagliare !!!
pl: Odcięcie Z
pt: Z cortado !!!
ru: Z отрезать !!!
tr: Z Kes !!!
zh_cn: Z切断

# btnCutOffZ.ToolTip
source: Cut off Z values below given value. Better save data before using cut off!
ar: قطع قيم Z دون القيمة المحددة. أفضل حفظ البيانات قبل استخدام قطع!
cs: Ořízněte hodnoty Z pod danou hodnotou. Před použitím cut off si raději uložte data!
de_de: Setze alle Z Werte kleiner dem gegeben Wert auf diesen Wert. Achtung, das Höhenprofil sollte vorher gespeichert werden!
es: Corte los valores Z por debajo del valor dado. Mejor guardar datos antes de usar cortar!
fr: Couper les valeurs Z inférieures à la valeur donnée. Mieux sauvegarder les données avant d'utiliser coupé!
it: Tagliare i valori Z al di sotto del valore dato. Meglio salvare i dati prima di usare cut off!
pl: Odcięcie wartosci Z poniże podanej wartosci. Lepiej zapisać dane przed użyciem odcięcia.
pt: Corte os valores de Z abaixo do valor especificado. Melhor salvar os dados antes de usar o corte!
ru: Отрежьте значения Z ниже заданного значения. Лучше сохранить данные перед использованием отрезать!
tr: Verilen değerin altındaki Z değerlerini kesin. Kesmeyi kullanmadan önce verileri daha iyi kaydedin!
zh_cn: 切断低于给定值的Z值。 使用切断功能之前，最好保存数据！

# btnGCode.Text
source: Generate G-Code
ar: توليد G- كود
cs: Vygenerujte G-kód
de_de: Generiere G-Code
es: Generar código G
fr: Générer un G-Code
it: Genera codice G
pl: Generuj G-Code
pt: Gerar código G
ru: Создать G-код
tr: G Kodu Oluştur
zh_cn: 生成G代码

# btnGCode.ToolTip
source: Generate G-Code to retrace height map
ar: قم بإنشاء G-Code لاستعادة خريطة الارتفاع
cs: Vygenerujte G-kód pro návrat k výškové mapě
de_de: Generiere G-Code um Höhenprofil abzufahren
es: Generar código G para volver sobre el mapa de altura
fr: Générer G-Code pour retracer la carte de hauteur
it: Genera G-Code per ripercorrere la mappa dell'altezza
pl: Wygeneruj G-Code, aby odtworzyć mapę wysokości
pt: Gere código G para refazer o mapa de altura
ru: Сгенерируйте G-код, чтобы восстановить карту высот
tr: Yükseklik haritasını yeniden izlemek için G Kodu oluşturun
zh_cn: 生成G代码以回溯高度图

# nUDCutOffZ.ToolTip
source: After STL import, the second smallest value will be displayed
cs: Po importu STL se zobrazí druhá nejmenší hodnota
es: Después de la importación STL, se mostrará el segundo valor más pequeño
pl: Po zaimportowaniu STL wyświetlona zostanie druga najmniejsza wartość
pt: Após a importação STL, o segundo menor valor será exibido
tr: STL içe aktarma işleminden sonra ikinci en küçük değer görüntülenecektir

# CbNewStepWidth.Text
source: Individual step-width
cs: Individuální šířka kroku
es: Ancho de paso individual
pl: Indywidualna szerokość kroku
pt: Largura do passo individual
tr: Bireysel adım genişliği

# label12.Text
source: Note: for milling the height map, the max. value should be equal to or less than zero.
cs: Poznámka: pro frézování výškové mapy by měla být max. hodnota rovna nebo menší než nula.
es: Nota: para fresar el mapa de altura, el valor máximo debe ser igual o inferior a cero.
pl: Uwaga: w przypadku frezowania mapy wysokości maksymalna wartość powinna być równa lub mniejsza od zera.
pt: Nota: para fresar o mapa de altura, o valor máximo deve ser igual ou menor que zero.
tr: Not: yükseklik haritasının frezelenmesi için maks. değeri sıfıra eşit veya sıfırdan küçük olmalıdır.

# gB_Manipulation.Text
source: Manipulation
ar: بمعالجة
cs: Manipulace
es: Manipulación
it: Manipolazione
pl: Manipulacje
pt: Manipulação
ru: манипуляция
tr: manipülasyon
zh_cn: 操作

# tabPage1.Text
source: Area to scan
ar: منطقة للمسح
cs: Oblast pro skenování
de_de: Zu scannender Bereich
es: Área para escanear
fr: Zone à scanner
it: Area da scansionare
pl: Obszar skanowania
pt: Área para escanear
tr: Taranacak alan
zh_cn: 扫描区域

# label11.Text
source: XY Feed rate
ar: معدل التغذية XY
cs: XY Rychlost posuvu
de_de: XY-Vorschubgeschwindigkeit
es: Velocidad de alimentación XY
fr: Vitesse d'avance XY
it: Velocità di avanzamento XY
pl: Prędkość posuwu XY
pt: Taxa de alimentação XY
tr: XY İlerleme hızı
zh_cn: XY 进给率

# CbUseG1.Text
source: Use G1 for XY move (else G0)
ar: استخدم G1 من أجل XY move (عدا G0)
cs: Použijte G1 pro XY pohyb (jinak G0)
de_de: G1 für XY-Bewegung (sonst G0)
es: Utilice G1 para el movimiento XY (de lo contrario, G0)
fr: Utilisez G1 pour le mouvement XY (sinon G0)
it: Usa G1 per il movimento XY (altrimenti G0)
pl: Użyj G1 dla XY (inaczej G0)
pt: Use G1 para movimento XY (senão G0)
tr: XY hareketi için G1'i kullanın (aksi halde G0)
zh_cn: 使用 G1 进行 XY 移动（否则为 G0）

# RbProbingDiy.Text
source: From DIY-Control
ar: من DIY التحكم
cs: Od DIY-Control
de_de: Von DIY-Steuerung
es: De DIY-Control
fr: De DIY-Control
it: Da controllo fai-da-te
pl: Z kontrolera DIY
pt: Do DIY-Control
tr: DIY-Control'den
zh_cn: 来自 DIY-Control

# LblConnected.Text
source: DIY Control not connected
ar: التحكم الذاتي غير متصل
cs: DIY Control není připojen
de_de: DIY-Steuerung nicht verbunden
es: Control de bricolaje no conectado
fr: Contrôle DIY non connecté
it: Controllo fai da te non connesso
pl: Kontroler DIY niepodłączony
pt: Controle DIY não conectado
tr: DIY Kontrolü bağlı değil
zh_cn: DIY 控制未连接

# label10.Text
source: Uses last received "(PRB:Zxxx)" Z-value from DIY-Control as depth information . (xxx = Z value)
ar: الاستخدامات التي تم تلقيها مؤخرًا "(PRB: Zxxx)" قيمة Z من DIY-Control كمعلومات عمق. (xxx = قيمة Z)
cs: Jako informace o hloubce používá naposledy přijatou hodnotu Z "(PRB:Zxxx)" z DIY-Control. (xxx = hodnota Z)
de_de: Verwendet den zuletzt empfangenen "(PRB:Zxxx)" Z-Wert von DIY-Control als Tiefeninformation. (xxx = Z-Wert)
es: Utiliza el último valor Z "(PRB: Zxxx)" recibido de DIY-Control como información de profundidad. (xxx = valor Z)
fr: Utilise la dernière valeur Z "(PRB:Zxxx)" reçue de DIY-Control comme information de profondeur. (xxx = valeur Z)
it: Utilizza l'ultimo valore Z ricevuto "(PRB:Zxxx)" da DIY-Control come informazioni sulla profondità. (xxx = valore Z)
pl: Wykorzystuje ostatnio otrzymaną "(PRB:Zxxx)" wartość Z z kontrolera DIY jako informację o głębokości. (xxx = wartość Z)
pt: Usa o valor Z "(PRB: Zxxx)" recebido pela última vez do DIY-Control como informação de profundidade. (xxx = valor Z)
tr: Derinlik bilgisi olarak DIY-Control'den son alınan "(PRB:Zxxx)" Z-değerini kullanır . (xxx = Z değeri)
zh_cn: 使用上次从 DIY-Control 接收到的“(PRB:Zxxx)”Z 值作为深度信息。 （xxx = Z 值）

# RbProbingZ.Text
source: Z axis (G38.3Z)
ar: (xxx = قيمة Z)
cs: Osa Z (G38.3Z)
de_de: Verwendung der Z-Achse (G38.3Z)
es: Eje Z (G38.3Z)
fr: Utilisation de l'axe Z (G38.3Z)
it: Asse Z (G38.3Z)
pl: Oś Z (G38.3Z)
pt: Eixo Z (G38.3Z)
tr: Z ekseni (G38.3Z)
zh_cn: 使用 Z 轴 (G38.3Z)

# GbProbing.Text
source: Probing, select source for Z value
cs: Snímání, vyberte zdroj pro hodnotu Z
es: Sondeo, seleccione la fuente para el valor Z
it: Sondaggio, selezionare la sorgente per il valore Z
pl: Sondowanie, wybierz źródło wartości Z
pt: Sondagem, selecione a fonte para o valor Z
tr: Tarama, Z değeri için kaynak seçin

# tabPage2.Text
source: Probing
ar: استقصاء ، حدد مصدرًا لقيمة Z.
cs: Sondování
de_de: Sondierung
es: Sondeo
fr: Sondage
it: Sondaggio
pl: Sondowanie
pt: Sondagem
tr: Sondaj
zh_cn: 探测

# tabPage3.Text
source: Result manipulation
ar: سبر
cs: Manipulace s výsledky
de_de: Ergebnismanipulation
es: Manipulación de resultados
fr: Manipulation des résultats
it: Manipolazione dei risultati
pl: Manipulacje wynikiem
pt: Manipulação de resultados
tr: Sonuç manipülasyonu
zh_cn: 结果操作

# tabPage4.Text
source: Output
ar: التلاعب بالنتيجة
cs: Výstup
de_de: Ausgabe
es: Producción
fr: Production
it: Produzione
pl: Wyjście
pt: Saída
tr: Çıktı
zh_cn: 输出

# $this.Text
source: Surface scan
ar: انتاج |
cs: Skenování povrchu
de_de: Oberflächenscan
es: Escaneo de superficie
fr: Balayage de surface
it: Scansione di superficie
pl: Skanowanie powierzchni
pt: Varredura de superfície
ru: Читать профиль высоты
tr: Yüzey taraması
zh_cn: 表面扫描
