Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlProbing.*.resx
Languages: ar, cs, de_de, fr, it, ja, pt, tr, zh_cn

# label21.Text
source: Inner contour: Place tool tip inside hole of work piece, almost centered. Z will not moved. Outside contour: Place tool tip on left side of work piece, as for edge detection
ar: كفاف داخلي: ضع المجس داخل فتحة قطعة العمل ، في المنتصف تقريبًا. لن يتحرك Z. محيط خارجي: ضع المسبار على الجانب الأيسر من قطعة العمل ، بالنسبة لاكتشاف الحافة. أو قم بتمكين "البدء من المركز" ووضع المجس في المنتصف فوق قطعة الشغل.
cs: Vnitřní obrys: Umístěte sondu do otvoru obrobku, téměř vycentrujte. Z se nepohne. Vnější obrys: Umístěte sondu na levou stranu obrobku, jako při detekci hran. Nebo povolte 'Start from center' a umístěte sondu na střed nad obrobek.
de_de: Innenkontur: Setzen Sie die Sonde fast zentriert in das Loch des Werkstücks ein. Z wird nicht verschoben. Außenkontur: Sonde auf der linken Seite des Werkstücks platzieren, wie bei der Kantenerkennung. Oder aktivieren Sie „Von Mitte starten“ und platzieren Sie den Messtaster mittig über dem Werkstück.
fr: Contour intérieur: Placez la pointe de l'outil dans le trou de la pièce, presque centré. Z ne sera pas déplacé. Contour extérieur: Placez la pointe de l'outil sur le côté gauche de la pièce, comme pour la détection de bord
it: Contorno interno: Posizionare la punta dell'utensile all'interno del foro del pezzo da lavorare, quasi al centro. Z non si sposterà. Contorno esterno: Posizionare la punta dell'utensile sul lato sinistro del pezzo da lavorare, come per il rilevamento del bordo
ja: 内側の輪郭: ワークピースの穴の内側にプローブをほぼ中央に配置します。 Zは移動しません。 外側の輪郭: エッジ検出と同様に、プローブをワークピースの左側に置きます。 または、「中心から開始」を有効にして、ワークピースの中心にプローブを配置します。
pt: Contorno interno: Coloque a sonda dentro do orifício da peça de trabalho, quase centralizada. Z não será movido. Contorno exterior: Coloque a sonda no lado esquerdo da peça de trabalho, como para detecção de borda. Ou ative 'Iniciar do centro' e posicione o apalpador centralizado acima da peça de trabalho.
tr: İç kontur: Probu iş parçasının deliğine neredeyse ortalanmış şekilde yerleştirin. Z hareket etmeyecek. Dış kontur: Kenar algılamada olduğu gibi probu iş parçasının sol tarafına yerleştirin. Veya 'Merkezden başla' seçeneğini etkinleştirin ve probu iş parçasının üzerine ortalayın.
zh_cn: 内部轮廓： 将刀尖放在工件的孔中，几乎居中。 Z将不会移动。 外轮廓： 将刀尖放在工件的左侧，以进行边缘检测

# lblCFProgressInfo.Text
source: Progress
ar: تقدم
cs: Pokrok
de_de: Fortschritt
fr: Le progrès
it: Progresso
ja: 進捗
pt: Progresso
tr: İlerlemek
zh_cn: 进展

# btnStartCF.Text
source: Start
ar: بداية
fr: Début
it: Inizio
ja: 開始
pt: Começar
tr: Başlangıç
zh_cn: 开始

# btnCancelCF.Text
source: Cancel
ar: إلغاء
cs: zrušení
de_de: Abbruch
fr: Annuler
it: Annulla
ja: キャンセル
pt: Cancelar
tr: İptal etmek
zh_cn: 取消

# label22.Text
source: Workpiece diameter
ar: قطر الشغل
cs: Průměr obrobku
de_de: Werkstückdurchmesser
it: Diametro del pezzo
ja: ワーク径
pt: Diâmetro da peça de trabalho
tr: İş parçası çapı (WpD)
zh_cn: 工件直径

# tabPage2.Text
source: Center finder
ar: مكتشف المركز
cs: Středový vyhledávač
de_de: Mittenfinder
fr: Chercheur de centre
it: Cercatore centrale
ja: センターファインダー
pt: Localizador de centros
tr: Merkez bulucu
zh_cn: 中心取景器

# btnClearTL.Text
source: Clear tool length offset
ar: مسح طول أداة الإزاحة
cs: Vymazat offset délky nástroje
de_de: Wkzg.längenkorr. löschen
fr: Effacer la longueur de l'outil
it: Cancella l'offset lunghezza utensile
ja: 工具長オフセットのクリア
pt: Desmarque a correção do comprimento da ferramenta
tr: Takım uzunluğu ofsetini temizle
zh_cn: 清除刀具长度偏移

# label12.Text
source: 1. Get tool length for 1st tool 2. Use G92 to set Z zero 3. After tool change, just measure tool length again, Z coordinate will then corrected. After tool length probing: Z will move back to start position
ar: 1. احصل على طول الأداة للأداة الأولى 2. استخدم G92 لتعيين Z صفر 3. بعد تغيير الأداة ، ما عليك سوى قياس طول الأداة مرة أخرى ، ثم تصحيح الإحداثيات Z. بعد فحص طول الأداة: سوف Z العودة إلى الوراء لبدء الموقف
cs: 1. Získejte délku nástroje pro 1. nástroj 2. Pomocí G92 nastavte Z nulu 3. Po výměně nástroje znovu změřte délku nástroje, souřadnice Z se poté opraví. Po měření délky nástroje: Z se vrátí zpět do výchozí polohy
de_de: 1. Werkzeuglänge für 1. Werkzeug ermitteln 2. Mit G92 Z Null setzen 3. Nach dem Werkzeugwechsel einfach die Werkzeuglänge erneut messen. Die Z-Koordinate wird dann korrigiert. Nach der Werkzeuglängentastung: Z fährt in die Ausgangsposition zurück
fr: 1. Obtenir la longueur d'outil pour le 1er outil 2. Utilisez G92 pour définir Z zéro 3. Après le changement d'outil, il suffit de mesurer à nouveau la longueur de l'outil, la coordonnée Z sera alors corrigée. Après palpage de la longueur d'outil: Z reviendra à la position de départ
it: 1. Ottieni la lunghezza dell'utensile per il 1° utensile 2. Utilizzare G92 per impostare Z zero 3. Dopo il cambio utensile, misurare nuovamente la lunghezza dell'utensile, la coordinata Z verrà quindi corretta.
ja: 1.最初の工具の工具長を取得する 2. G92を使用してZをゼロに設定します 3.ツールの変更後、再度ツールの長さを測定するだけで、Z座標が修正されます。 工具長の調査後： Zは開始位置に戻ります
pt: 1. Obtenha o comprimento da primeira ferramenta. 2. Use G92 para definir Z zero. 3. Após a troca da ferramenta, apenas meça o comprimento da ferramenta novamente, a coordenada Z será corrigida. Após a medição do comprimento da ferramenta: Z voltará à posição inicial
tr: 1. 1. takım için takım uzunluğunu alın 2. Z'yi sıfıra ayarlamak için G92'yi kullanın 3. Takım değiştirdikten sonra, sadece takım uzunluğunu tekrar ölçün, Z koordinatı düzeltilecektir. Takım uzunluğu taramasından sonra: Z, başlangıç ​​konumuna geri döner
zh_cn: 1.获取第一个刀具的刀具长度 2.用G92设定Z为零 3.换刀后，只需再次测量刀具长度，即可校正Z坐标。 刀具长度探测后： Z将移回起始位置

# lblTLProgressInfo.Text
source: Progress
ar: تقدم
cs: Pokrok
de_de: Fortschritt
fr: Le progrès
it: Progresso
ja: 進捗
pt: Progresso
tr: İlerlemek
zh_cn: 进展

# btnStartTL.Text
source: Start
ar: بداية
fr: Début
it: Inizio
ja: 開始
pt: Começar
tr: Başlangıç
zh_cn: 开始

# btnCancelTL.Text
source: Cancel
ar: إلغاء
cs: zrušení
de_de: Abbruch
it: Annulla
ja: キャンセル
pt: Cancelar
tr: İptal etmek
zh_cn: 取消

# tabPage3.Text
source: Tool length
ar: طول الأداة
cs: Délka nástroje
de_de: Werkzeuglänge
fr: Longueur de l'outil
it: Lunghezza utensile
ja: 工具長
pt: Comprimento da ferramenta
tr: Takım uzunluğu
zh_cn: 工具长度

# btnProbeCoordClear.Text
source: Clear G92
ar: واضح G92
cs: Vymazat G92
fr: Clair G92
it: Cancella G92
ja: クリアG92
pt: Limpar G92
tr: G92'yi Temizle
zh_cn: 清除G92

# rBProbeCoord2.Text
source: Use G92
ar: استخدم G92
cs: Použijte G92
de_de: Verwende G92
fr: Utilisez G92
it: Usa G92
ja: G92を使用する
tr: G92'yi kullanın
zh_cn: 使用G92

# rBProbeCoord1.Text
source: Use G10 L2 P0 - Set coord. (G54-G59)
ar: استخدم G10 L2 P0 - Set coord. (G54-G59)
cs: Použijte G10 L2 P0 - Set coord. (G54-G59)
de_de: Verwende G10 L2 P0 - setzen der Koordinate (G54-G59)
fr: Utiliser G10 L2 P0 - Définir coord. (G54-G59)
it: Usa G10 L2 P0 - Imposta coord. (G54-G59)
ja: G10 L2 P0を使用-座標を設定します。 （G54-G59）
pt: Use G10 L2 P0 - Definir coord. (G54-G59)
tr: G10 L2 P0 - Koordinatı ayarla'yı kullanın. (G54-G59)
zh_cn: 使用G10 L2 P0-设置坐标。 （G54-G59）

# gBCoordinates.Text
source: Coordinates
ar: إحداثيات
cs: Souřadnice
de_de: Koordinaten
fr: Les coordonnées
it: Coordinate
ja: 座標
pt: Coordenadas
tr: koordinatlar
zh_cn: 座标

# $this.Text
source: Probing and Tool Length Offset
ar: التحقيق وإزاحة طول الأداة
cs: Snímání a korekce délky nástroje
de_de: Abtastung und Werkzeuglängenkorrektur
fr: Palpage et décalage de longueur d'outil
it: Sondaggio e offset lunghezza utensile
ja: プローブと工具長オフセット
pt: Sondagem e deslocamento do comprimento da ferramenta
tr: Problama ve Takım Uzunluğu Ofseti
zh_cn: 探测和刀具长度偏移
