Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/MachineControl/ControlJogPathCreator.*.resx
Languages: fr

# gBPathCreator.Text
source: Path creator
fr: Créateur de chemin

# btnDelete.ToolTip
source: Delete complete path
fr: Supprimer le chemin complet

# btnUndo.Text
source: Undo last
fr: Annuler dernier

# btnLoad.Text
source: Load path
fr: Chemin de chargement

# btnSave.Text
source: Save path
fr: Enregistrer le chemin

# btnRotate.Text
source: Rotate path 90°
fr: Faire pivoter la trajectoire de 90 °

# btnDelete.Text
source: Delete path
fr: Supprimer le chemin

# nUDRaster.ToolTip
source: Raster width to snap path position
fr: Largeur du raster à la position du tracé d'accrochage

# btnExport.Text
source: Import as graphic
fr: Importer sous forme de graphique

# btnJogStart.Text
source: Send Jog path
fr: Envoyer le chemin jog

# cBSnap.Text
source: Snap on raster
fr: Accrocher sur le raster

# $this.Text
source: Jog Path Creator
fr: Créateur de Jog Path

# btnExport.ToolTip
source: Import path with given settings
fr: Importer le chemin avec les paramètres donnés

# btnJogStop.ToolTip
source: Stop jogging (only grbl 1.1)
fr: Arrêtez le jogging (seulement grbl 1.1)

# btnJogStart.ToolTip
source: Start relative movement, imediatly
fr: Commencer le mouvement relatif, immédiatement

# nUDFeedrate.ToolTip
source: Feedrate for jogging
fr: Avance pour le jogging

# gBJogParameter.Text
source: Jog parameter
fr: Paramètre Jog
