Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromImage.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# cBPreview.Text
source: Preview with colors from tool table
ar: معاينة مع الألوان من جدول الأداة
cs: Náhled s barvami z tabulky nástrojů
de_de: Vorschau mit Farben der Werkzeugliste
es: Vista previa con colores de la tabla de herramientas
fr: Aperçu avec les couleurs de la table d'outils
it: Anteprima con i colori dalla tabella degli strumenti
ja: ツールテーブルの色でプレビュー
pl: Podgląd z kolorami z tabeli narzędzi
pt: Visualizar com cores da tabela de ferramentas
ru: Предварительный просмотр с цветами из таблицы инструментов
tr: Alet tablosundan renklerle ön izleme
zh_cn: 使用工具表中的颜色进行预览

# tabPage4.Text
source: Preset
ar: مسبقا
cs: Přednastavení
es: Preestablecido
fr: Préréglé
it: Preimpostato
ja: プリセット
pl: Ustawienia wstępne
pt: Predefinição
ru: Предустановленная
tr: ön ayar
zh_cn: 预设值

# tabPage1.Text
source: Color correction
ar: تصحيح الصورة
cs: Oprava obrazu
de_de: Farben ändern
es: Corrección de imagen
fr: Correction d'image
it: Correzione del colore
ja: 画像補正
pl: Korekcja koloru
pt: Correção de imagem
ru: Коррекция изображения
tr: Renk düzeltmesi
zh_cn: 影像校正

# cBFilterRemoveArtefact.Text
source: Remove single pixels
ar: إزالة بكسل واحد
cs: Odstraňte jednotlivé pixely
de_de: Einzelne Pixel entfernen
es: Eliminar píxeles individuales
fr: Supprimer les pixels simples
it: Rimuovere i singoli pixel
ja: 単一ピクセルを削除
pl: Usuń pojedyncze piksele
pt: Remover pixels únicos
ru: Удалить отдельные пиксели
tr: Tek pikselleri kaldır
zh_cn: 移除单个像素

# nUDZBottom.ToolTip
source: Lower value
ar: قيمة أقل
cs: Nižší hodnota
de_de: Unterer Wert
es: Bajo valor
fr: Valeur inférieure
it: Valore più basso
ja: 低い値
pl: Niższa wartość
pt: Valor inferior
ru: Меньшее значение
tr: Düşük değer
zh_cn: 较低的价值

# nUDSBottom.ToolTip
source: Lower value
ar: قيمة أقل
cs: Nižší hodnota
de_de: Unterer Wert
es: Bajo valor
fr: Valeur inférieure
it: Valore più basso
ja: 低い値
pl: Niższa wartość
pt: Valor inferior
ru: Меньшее значение
tr: Düşük değer
zh_cn: 较低的价值

# cBFilterHistogram.Text
source: Histogram Equalization
ar: الرسم البياني معادلة
cs: Vyrovnání histogramu
de_de: Histogramm-Ausgleich
es: Ecualización de histograma
fr: Égalisation d'histogramme
it: Equalizzazione dell'istogramma
ja: ヒストグラム均等化
pl: Wyrównanie histogramu
pt: Equalização do histograma
ru: Выравнивание гистограммы
tr: Histogram Eşitleme
zh_cn: 直方图均衡

# cBFilterEdge.Text
source: Edge filter
ar: مرشح الحافة
cs: Okrajový filtr
de_de: Kantenfilter
es: Filtro de borde
fr: Filtre de bord
it: Filtro perimetrale
ja: エッジフィルター
pl: Filtr krawędziowy
pt: Filtro de borda
ru: Краевой фильтр
tr: Kenar filtresi
zh_cn: 边缘过滤器

# cBPosterize.Text
source: Posterization
ar: على posterization
cs: Posterizace
es: Posterización
fr: Postérisation
it: Posterizzazione
ja: ポスタリゼーション
pl: Posteryzacja
pt: Posterização
ru: Постеризация
tr: posterleştirme
zh_cn: 后发化

# cBReduceColorsToolTable.Text
source: Reduce colors
ar: تقليل الألوان
cs: Omezte barvy
de_de: Reduziere Farben
es: Reducir los colores
fr: Réduire les couleurs
it: Riduci i colori
ja: 色を減らす
pl: Zredukuj kolory
pt: Reduzir cores
ru: Уменьшить цвета
tr: Renkleri azalt
zh_cn: 减少色彩

# label10.Text
source: Tool list sorted by occurrence
ar: قائمة الأدوات
cs: Seznam nástrojů seřazený podle výskytu
de_de: Werkzeugliste
es: Lista de herramientas
fr: Liste d'outils
it: Elenco strumenti ordinato per occorrenza
ja: ツールリスト
pl: Lista narzędzi posortowana według występowania
pt: Lista de ferramentas
ru: Список инструментов
tr: Olaya göre sıralanmış araç listesi
zh_cn: 工具清单

# btnPresetCorrection4.Text
source: Contour (no go back)
ar: كونتور (لا رجوع)
cs: Obrys (bez návratu)
de_de: Kontur (kein Rückgängig)
es: Contorno (sin retroceder)
fr: Contour (pas de retour)
it: Contorno (non tornare indietro)
ja: 輪郭（戻ることはできません）
pl: Kontur (bez możliwości cofnięcia się)
pt: Contorno (sem volta)
ru: Контур (нет возврата)
tr: Kontur (geri dönüş yok)
zh_cn: 轮廓（不返回）

# btnPresetCorrection2.Text
source: Graphic - many colors
ar: الرسم - العديد من الألوان
cs: Grafika - mnoho barev
de_de: Grafik - viele Farben
es: Gráfico - muchos colores
fr: Graphique - beaucoup de couleurs
it: Grafica - molti colori
ja: グラフィック-多くの色
pl: Grafika - wiele kolorów
pt: Gráfico - muitas cores
ru: Графика - много цветов
tr: Grafik - birçok renk
zh_cn: 图形-许多颜色

# btnResetCorrection.Text
source: RESET values
ar: إعادة تعيين القيم
cs: RESET hodnot
de_de: RESET der Einstellungen
es: RESTABLECER valores
fr: RESET valeurs
it: AZZERA valori
ja: リセット値
pl: RESET wartości
pt: RESET valores
ru: СБРОС значения
tr: SIFIRLAMA değerleri
zh_cn: 重置值

# btnPresetCorrection1.Text
source: Image - dark background
ar: صورة - الخلفية المظلمة
cs: Obrázek - tmavé pozadí
de_de: Bild - dunkler Hintergrund
es: Imagen - fondo oscuro
fr: Image - fond sombre
it: Immagine - sfondo scuro
ja: 画像-暗い背景
pl: Obraz - ciemne tło
pt: Imagem - fundo escuro
ru: Изображение - темный фон
tr: Resim - koyu arka plan
zh_cn: 图像-深色背景

# label11.Text
source: Saturation
ar: التشبع
cs: Nasycení
de_de: Farbsättig.
es: Saturación
it: Saturazione
ja: 飽和
pl: Nasycenie
pt: Saturação
ru: насыщение
tr: Doyma
zh_cn: 饱和

# gBgcodeSelection.Text
source: Vectorization
ar: رسم اختيار
cs: Vektorizovat
de_de: Auswahl Zeichnen
es: vectorizar
fr: Dessiner la sélection
it: Vettorizzazione
ja: 選択範囲を描く
pl: Wektoryzacja
pt: Vetorizar
ru: Векторизовать
tr: vektörleştir
zh_cn: 抽签选择

# cBGCodeFill.Text
source: Fill areas
ar: ملء المناطق
cs: Vyplňte oblasti
de_de: Flächen füllen
es: Áreas de relleno
fr: Remplir des zones
it: Riempi le aree
ja: 塗りつぶしエリア
pl: Wypełnij obszary
pt: Áreas de preenchimento
ru: Заполнить области
tr: Alanları doldurun
zh_cn: 填充区域

# cBGCodeOutline.Text
source: Draw outline
ar: ارسم الخطوط العريضة
cs: Nakreslete obrys
de_de: Umrandung zeichnen
es: Dibujar borde
fr: Tracer une bordure
it: Disegna il contorno
ja: 輪郭を描く
pl: Rysuj kontur
pt: Desenhar esboço
ru: Нарисуйте границу
tr: Taslak çiz
zh_cn: 画边框

# cBGCodeOutlineSmooth.Text
source: smooth
ar: ناعم
cs: hladký
de_de: glätten
es: liso
fr: lisse
it: liscio
ja: なめらか
pl: gładki
pt: suave
ru: гладкий
tr: düz
zh_cn: 光滑

# groupBox2.Text
source: From Setup form
ar: من نموذج الإعداد
cs: Z formuláře Nastavení
de_de: Aus dem Setup-Formular
es: Desde el formulario de configuración
fr: À partir du formulaire de configuration
it: Dal modulo di installazione
ja: セットアップフォームから
pl: f
pt: Do formulário de configuração
ru: Из формы настройки
tr: Kurulum formundan
zh_cn: 从设置表单

# label19.Text
source: Tool table selection and content:
ar: اختيار جدول الأدوات والمحتوى:
cs: Výběr a obsah tabulky nástrojů:
de_de: Auswahl und Inhalt der Werkzeugtabelle:
es: Selección y contenido de la tabla de herramientas:
fr: Sélection et contenu de la table d'outils :
it: Selezione e contenuto della tabella utensili:
ja: ツールテーブルの選択と内容：
pl: Wybór i zawartość tabeli narzędzi:
pt: Seleção e conteúdo da tabela de ferramentas:
ru: Выбор и содержимое таблицы инструментов:
tr: Alet tablosu seçimi ve içeriği:
zh_cn: 工具表选择及内容：

# label17.Text
source: Collects areas of same color
ar: يجمع مساحات من نفس اللون
cs: Sbírá oblasti stejné barvy
de_de: Sammelt Bereiche gleicher Farbe
es: Recoge áreas del mismo color.
fr: Collecte des zones de même couleur
it: Raccoglie aree dello stesso colore
ja: 同じ色の領域を収集します
pl: Zbiera obszary o tym samym kolorze
pt: Coleta áreas da mesma cor
ru: Собирает области одного цвета
tr: Aynı renkteki alanları toplar
zh_cn: 收集相同颜色的区域

# cBResolutionPenWidth.Text
source: Pen-width from resolution
ar: عرض القلم من القرار
cs: Šířka pera od rozlišení
de_de: Stiftbreite aus Auflösung
es: Ancho de pluma desde la resolución
fr: Largeur du stylo à partir de la résolution
it: Larghezza della penna dalla risoluzione
ja: 解像度からのペン幅
pl: Szerokośc pióra z rozdzielczości
pt: Largura da caneta a partir da resolução
ru: Ширина пера от разрешения
tr: Çözünürlükten kalem genişliği
zh_cn: 分辨率的笔宽

# cBLaserModeOffEnd.Text
source: Lasermode OFF at G-Code end
ar: مسح الليزر في نهاية G-Code
cs: Laserový režim VYP na konci G kódu
de_de: Lasermode AUS am G-Code-Ende
es: Modo láser APAGADO al final del código G
fr: Mode laser désactivé à la fin du code G
it: Modalità laser OFF alla fine del codice G
ja: Gコード側のレーザーモードをクリア
pl: Wyłącz tryb lasera na końcu G-Code
pt: Modo laser DESLIGADO no final do código G
ru: Режим лазера ВЫКЛ в конце G-кода
tr: G kodu sonunda lazer modu KAPALI
zh_cn: 在G代码端清除激光模式

# cBLaserModeOnStart.Text
source: Lasermode ON at G-Code start
ar: اضبط وضع الليزر على G-Code start
cs: Laserový režim zapnut při spuštění G kódu
de_de: Lasermode EIN am G-Code-Start
es: Modo láser activado al inicio del código G
fr: Mode laser activé au démarrage du code G
it: Lasermode ON all'inizio del codice G
ja: Gコード開始時にレーザーモードを設定します
pl: Włącz tryb lasera na początku G-Code
pt: Modo laser LIGADO no início do código G
ru: Лазерный режим включается при запуске G-кода
tr: G kodu başlangıcında lazer modu AÇIK
zh_cn: 在G代码启动时设置Lasermode

# groupBox7.Text
source: Properties
ar: مسافة الخط
cs: Vlastnosti
de_de: Linienabstand
es: Distancia de línea
fr: Distance de ligne
it: Proprietà
ja: 線間距離
pl: Ustawienia
pt: Distância da linha
ru: Расстояние линии
tr: Özellikler
zh_cn: 线距

# CbPenUpOn0.Text
source: Pen-up on 0
ar: Pen-up على 0
cs: Přípis na 0
es: Pen-up en 0
it: Pen-up su 0
ja: 0のペンアップ
pl: 'Pen-Up' na 0
pt: Pen-up em 0
ru: Pen-up на 0
tr: 0'da kalem-up
zh_cn: 上笔 0

# btnLoad.Text
source: Load and apply use case
ar: تحميل وتطبيق حالة الاستخدام
cs: Načíst a použít případ použití
de_de: Lade und verwende Einstellungen
es: Cargar y usar configuraciones
fr: Charger et utiliser les paramètres
it: Carica e applica caso d'uso
ja: ユースケースをロードして適用する
pl: Załaduj i zastosuj przypadek użycia
pt: Carregar e aplicar caso de uso
ru: Загрузите и используйте настройки
tr: Kullanım senaryosunu yükleyin ve uygulayın
zh_cn: 加载和使用设置

# label16.Text
source: Last loaded:
ar: آخر تحميل:
cs: Naposledy načteno:
de_de: Zuletzt geladen:
es: Última carga:
fr: Dernier chargé:
it: Ultimo caricato:
ja: 最終ロード：
pl: Ostatnio wczytane:
pt: Último carregamento:
ru: Последняя загрузка:
tr: Son yüklenen:
zh_cn: 上次加载：

# $this.Text
source: Create G-Code from Image
ar: قم بإنشاء G-Code من الصورة
cs: Vytvořte G-kód z obrázku
de_de: Erzeuge G-Code aus Bild
es: Crear G-Code a partir de imagen
fr: Créer un G-Code à partir d'une image
it: Crea codice G dall'immagine
ja: 画像からGコードを作成
pl: Utwórz G-Code z obrazu
pt: Criar código G a partir da imagem
ru: Создать G-Code из изображения
tr: Görüntüden G Kodu Oluşturun
zh_cn: 从图像创建G代码

# tabPage2Color.Text
source: Color mode
ar: وضع اللون
cs: Barevný režim
de_de: Farbmodus
es: Modo de color
fr: Mode de couleur
it: Modalità colore
ja: カラーモード
pl: Tryb koloru
pt: Modo de cor
ru: Цветовой режим
tr: Renk modu
zh_cn: 颜色模式

# CboxToolTable.Text
source: Content of tool table
ar: محتوى جدول الأدوات
cs: Obsah tabulky nástrojů
de_de: Inhalt der Werkzeugtabelle
es: Contenido de la tabla de herramientas
fr: Contenu de la table d'outils
it: Contenuto della tabella degli strumenti
ja: ツールテーブルの内容
pl: Zawartość tablicy narzędzi
pt: Conteúdo da tabela de ferramentas
ru: Содержимое таблицы инструментов
tr: Alet tablosunun içeriği
zh_cn: 工具表内容

# CboxToolFiles.Text
source: Last loaded tool table
ar: آخر جدول أداة تم تحميله
cs: Poslední načtená tabulka nástrojů
de_de: Zuletzt geladene Werkzeugtabelle
es: Última tabla de herramientas cargada
fr: Dernière table d'outils chargée
it: Ultima tabella utensili caricata
ja: 最後にロードされたツールテーブル
pl: Ostatnio wczytana tablica narzędzi
pt: Última tabela de ferramentas carregada
ru: Последняя загруженная таблица инструментов
tr: Son yüklenen alet tablosu
zh_cn: 最后加载的刀具表

# label28.Text
source: For felt pens, colored pencils, watercolor... Uses a tool table to assign tool colors to image colors and groups them. Amount of colors can be reduced by applying filters. Manual or automatic tool change can be applied.
ar: لأقلام اللباد والأقلام الملونة والألوان المائية ... يستخدم جدول الأدوات لتعيين ألوان الأداة لألوان الصورة وتجميعها. يمكن تقليل كمية الألوان عن طريق تطبيق المرشحات. يمكن تطبيق التغيير اليدوي أو التلقائي للأداة.
cs: Na fixy, pastelky, vodové barvy... Používá tabulku nástrojů k přiřazení barev nástrojů k barvám obrazu a jejich seskupení. Množství barev lze snížit použitím filtrů. Lze použít ruční nebo automatickou výměnu nástroje.
de_de: Für Filzstifte, Buntstifte, Wasserfarben... Verwendet eine Werkzeugtabelle, um Bildfarben Werkzeugfarben zuzuweisen und sie zu gruppieren. Die Farbmenge kann durch Anwenden von Filtern reduziert werden. Es kann ein manueller oder automatischer Werkzeugwechsel angewendet werden.
es: Para rotuladores, lápices de colores, acuarela... Utiliza una tabla de herramientas para asignar colores de herramientas a colores de imagen y agruparlos. La cantidad de colores se puede reducir aplicando filtros. Se puede aplicar el cambio de herramienta manual o automático.
fr: Pour feutres, crayons de couleur, aquarelle... Utilise une table d'outils pour attribuer des couleurs d'outils aux couleurs d'image et les regroupe. La quantité de couleurs peut être réduite en appliquant des filtres. Un changement d'outil manuel ou automatique peut être appliqué.
it: Per pennarelli, matite colorate, acquerelli... Utilizza una tabella degli strumenti per assegnare i colori degli strumenti ai colori dell'immagine e raggrupparli. La quantità di colori può essere ridotta applicando filtri. È possibile applicare il cambio utensile manuale o automatico.
ja: フェルトペン、色鉛筆、水彩画用... ツールテーブルを使用して、ツールの色を画像の色に割り当て、グループ化します。フィルタを適用することにより、色の量を減らすことができます。 手動または自動の工具交換を適用できます。
pl: Do filcowych piór, kolorowych ołówków, akwareli... Używa tabeli narzędzi do przypisania kolorów narzędzi do kolorów obrazu i grupuje je. Ilość kolorów może być zmniejszona przez zastosowanie filtrów. Można zastosować ręczną lub automatyczną zmianę narzędzi.
pt: Para canetas de feltro, lápis de cor, aguarela... Usa uma tabela de ferramentas para atribuir cores de ferramentas às cores da imagem e agrupá-las. A quantidade de cores pode ser reduzida aplicando filtros. A troca manual ou automática da ferramenta pode ser aplicada.
ru: Для фломастеров, цветных карандашей, акварели... Использует таблицу инструментов для назначения цветов инструментов цветам изображения и группирует их. Количество цветов можно уменьшить, применяя фильтры. Может применяться ручная или автоматическая смена инструмента.
tr: Keçeli kalemler, renkli kalemler, sulu boyalar için... Araç renklerini görüntü renklerine atamak ve bunları gruplandırmak için bir araç tablosu kullanır. Filtre uygulanarak renk miktarı azaltılabilir. Manuel veya otomatik takım değiştirme uygulanabilir.
zh_cn: 用于毡笔、彩色铅笔、水彩... 使用工具表将工具颜色分配给图像颜色并将它们分组。通过应用过滤器可以减少颜色的数量。 可以应用手动或自动换刀。

# tabPage2Gray.Text
source: B/W Grayscale mode
ar: وضع B / W Grayscale
cs: Černobílý režim odstínů šedi
de_de: S/W Graustufenmodus
es: Modo escala de grises B/N
fr: Mode niveaux de gris N/B
it: Modalità scala di grigi B/N
ja: B/Wグレースケールモード
pl: Tryb czarno-biały/skala szarości
pt: Modo P/B em tons de cinza
ru: Ч/Б режим оттенков серого
tr: S/B Gri tonlama modu
zh_cn: 黑白灰度模式

# GbCOlorCorrection.Text
source: Color correction
ar: تصحيح الألوان
cs: Korekce barev
de_de: Farbkorrektur
es: Corrección de color
fr: Correction de couleur
it: Correzione del colore
ja: 色補正
pl: Korekcja koloru
pt: Correção de cor
ru: Цветовая коррекция
tr: Renk düzeltmesi
zh_cn: 色彩校正

# GbColorEffects.Text
source: Color effects
ar: تأثيرات اللون
cs: Barevné efekty
de_de: Farbeffekte
es: efectos de color
fr: Effets de couleur
it: Effetti di colore
ja: 色の効果
pl: Efekty koloru
pt: Efeitos de cor
ru: Цветовые эффекты
tr: Renk efektleri
zh_cn: 色彩效果

# GbSpecialEffects.Text
source: Special effects
ar: مؤثرات خاصة
cs: Zvláštní efekty
de_de: Spezialeffekte
es: Efectos especiales
fr: Effets spéciaux
it: Effetti speciali
ja: 特殊効果
pl: Efekty specjalne
pt: Efeitos especiais
ru: Спецэффекты
tr: Özel efektler
zh_cn: 特殊效果

# cBToolChange.Text
source: Perform tool change on Tx M06
ar: قم بإجراء تغيير الأداة على Tx M06
cs: Proveďte výměnu nástroje na Tx M06
de_de: Werkzeugwechsel auf Tx M06 durchführen
es: Realizar cambio de herramienta en Tx M06
fr: Effectuer le changement d'outil sur Tx M06
it: Eseguire il cambio utensile su Tx M06
ja: TxM06で工具交換を実行します
pl: Wykonaj zmianę narzędzia w Tx M06
pt: Realize a troca de ferramenta no Tx M06
ru: Выполните смену инструмента на Tx M06
tr: Tx M06'da takım değiştirme gerçekleştirin
zh_cn: 在 Tx M06 上执行换刀

# cBToolChange.ToolTip
source: Execute following scripts on Tx M06 commands
ar: قم بتنفيذ البرامج النصية التالية على أوامر Tx M06
cs: Proveďte následující skripty na příkazech Tx M06
de_de: Führe die folgenden Skripte für Tx M06-Befehle aus
es: Ejecute los siguientes scripts en los comandos Tx M06
fr: Exécutez les scripts suivants sur les commandes Tx M06
it: Eseguire i seguenti script sui comandi Tx M06
ja: TxM06コマンドで次のスクリプトを実行します
pl: Wykonaj następujące skrypty na komendach Tx M06
pt: Execute os seguintes scripts nos comandos Tx M06
ru: Выполните следующие сценарии для команд Tx M06.
tr: Tx M06 komutlarında aşağıdaki komut dosyalarını yürütün
zh_cn: 在 Tx M06 命令上执行以下脚本

# cBImportGCToolM0.Text
source: Add Pause (M0) instead
ar: أضف إيقاف مؤقت (M0) بدلاً من ذلك
cs: Místo toho přidejte Pauza (M0).
de_de: Füge stattdessen Pause (M0) hinzu
es: Agregue Pausa (M0) en su lugar
fr: Ajouter Pause (M0) à la place
it: Aggiungi invece Pausa (M0).
ja: 代わりに一時停止（M0）を追加
pl: Dodaj pauzę (M0) zamiast
pt: Adicionar Pausa (M0) em vez disso
ru: Вместо этого добавьте паузу (M0)
tr: Bunun yerine Duraklat (M0) ekleyin
zh_cn: 改为添加暂停 (M0)

# cBImportGCToolM0.ToolTip
source: Replace any M06 (tool change) command by M0 (pause) for manual tool change.
ar: استبدل أي أمر M06 (تغيير الأداة) بواسطة M0 (إيقاف مؤقت) لتغيير الأداة يدويًا.
cs: Pro ruční výměnu nástroje nahraďte libovolný příkaz M06 (výměna nástroje) příkazem M0 (pauza).
de_de: Ersetze jeden M06-Befehl (Werkzeugwechsel) durch M0 (Pause) für den manuellen Werkzeugwechsel.
es: Reemplace cualquier comando M06 (cambio de herramienta) por M0 (pausa) para el cambio de herramienta manual.
fr: Remplacez toute commande M06 (changement d'outil) par M0 (pause) pour un changement d'outil manuel.
it: Sostituire qualsiasi comando M06 (cambio utensile) con M0 (pausa) per il cambio utensile manuale.
ja: 手動で工具を交換するには、M06（工具交換）コマンドをM0（一時停止）に置き換えます。
pl: Zastąp dowolne polecenie M06 (zmiana narzędzia) przez M0 (pauza) dla ręcznej zmiany narzędzia.
pt: Substitua qualquer comando M06 (troca de ferramenta) por M0 (pausa) para troca manual de ferramenta.
ru: Замените любую команду M06 (смена инструмента) на M0 (пауза) для ручной смены инструмента.
tr: Manuel takım değişimi için herhangi bir M06 (takım değiştirme) komutunu M0 (duraklatma) ile değiştirin.
zh_cn: 用 M0（暂停）替换任何 M06（换刀）命令以进行手动换刀。

# cBImportGCTool.Text
source: Add Tool Change command Tx M06
ar: إضافة أداة تغيير الأمر Tx M06
cs: Přidejte příkaz výměny nástroje Tx M06
de_de: Werkzeugwechselbefehl Tx M06 hinzufügen
es: Agregar comando de cambio de herramienta Tx M06
fr: Ajouter la commande de changement d'outil Tx M06
it: Aggiungi comando cambio utensile Tx M06
ja: ツール変更コマンドの追加TxM06
pl: Dodaj polecenie zmiany narzędzia Tx M06
pt: Adicionar comando de mudança de ferramenta Tx M06
ru: Добавить команду смены инструмента Tx M06
tr: Takım Değiştirme komutu ekle Tx M06
zh_cn: 添加换刀命令 Tx M06

# cBImportGCTool.ToolTip
source: Perform tool change action on Tx M06 commands if information is available - check tab 'Tool change'.
ar: قم بتنفيذ إجراء تغيير الأداة على أوامر Tx M06 إذا كانت المعلومات متوفرة - حدد علامة التبويب "تغيير الأداة".
cs: Proveďte akci výměny nástroje na příkazech Tx M06, pokud jsou k dispozici informace - zaškrtněte záložku 'Výměna nástroje'.
de_de: Führe die Werkzeugwechselaktion für Tx M06-Befehle durch, wenn Informationen verfügbar sind – überprüfe die Registerkarte „Werkzeugwechsel“.
es: Realice la acción de cambio de herramienta en los comandos Tx M06 si hay información disponible: consulte la pestaña 'Cambio de herramienta'.
fr: Effectuez une action de changement d'outil sur les commandes Tx M06 si des informations sont disponibles - vérifiez l'onglet 'Changement d'outil'.
it: Eseguire l'azione di cambio utensile sui comandi Tx M06 se le informazioni sono disponibili - controllare la scheda 'Cambio utensile'.
ja: 情報が利用可能な場合は、TxM06コマンドでツール変更アクションを実行します-タブ「ツール変更」を確認します。
pl: Wykonaj akcję zmiany narzędzia na poleceniach Tx M06, jeśli jest dostępna informacja - sprawdź zakładkę 'Zmiana narzędzia'.
pt: Execute a ação de troca de ferramenta nos comandos Tx M06 se as informações estiverem disponíveis - verifique a guia 'Mudança de ferramenta'.
ru: Выполните действие по смене инструмента по командам Tx M06, если информация доступна - проверьте вкладку «Смена инструмента».
tr: Bilgi varsa, Tx M06 komutlarında takım değiştirme eylemini gerçekleştirin - 'Takım değiştirme' sekmesini kontrol edin.
zh_cn: 如果信息可用，请对 Tx M06 命令执行换刀操作 - 检查选项卡“换刀”。

# checkBox1.Text
source: Pen down color mode
ar: وضع القلم لأسفل
cs: Barevný režim s perem
de_de: Stift-unten-Farbmodus
es: Modo de color de lápiz hacia abajo
fr: Mode couleur stylet vers le bas
it: Modalità colore penna giù
ja: ペンダウンカラーモード
pl: 'Pen-Down' tryb koloru
pt: Modo de cor da caneta para baixo
ru: Цветовой режим «Перо вниз»
tr: Kalem aşağı renk modu
zh_cn: 下笔颜色模式

# RbStartGrayZ.Text
source: Gray value as Z (deepth)
ar: القيمة الرمادية مثل Z (عمق)
cs: Šedá hodnota jako Z (hloubka)
de_de: Grauwert als Z (Tiefe)
es: Valor de gris como Z (profundidad)
fr: Valeur de gris en Z (profondeur)
it: Valore di grigio come Z (profondità)
ja: Z（深さ）としてのグレー値
pl: Szary jako Z (głębokość)
pt: Valor cinza como Z (profundidade)
ru: Значение серого как Z (глубина)
tr: Z (derinlik) olarak gri değer
zh_cn: 灰度值为 Z（深度）

# GbUseCaseLoad.Text
source: Load use case
ar: حالة استخدام الحمل
cs: Načíst případ použití
de_de: Anwendungsfall laden
es: Cargar caso de uso
fr: Charger le cas d'utilisation
it: Carica caso d'uso
ja: 負荷のユースケース
pl: Załaduj przypadek użycia
pt: Carregar caso de uso
ru: Загрузить вариант использования
tr: Kullanım senaryosunu yükle
zh_cn: 加载用例

# groupBox4.Text
source: Display in 2D-View
ar: العرض في 2D-View
cs: Zobrazení ve 2D zobrazení
de_de: Anzeige in 2D-Ansicht
es: Mostrar en vista 2D
fr: Affichage en vue 2D
it: Visualizza in vista 2D
ja: 2Dビューで表示
pl: Wyświetl w 2D
pt: Exibição em 2D-View
ru: Отображение в 2D-виде
tr: 2B Görünümde Görüntüle
zh_cn: 以 2D 视图显示

# GbGrayscaleProcess.Text
source: Grayscale processing
ar: معالجة التدرج الرمادي
cs: Zpracování ve stupních šedi
de_de: Graustufenverarbeitung
es: Procesamiento en escala de grises
fr: Traitement des niveaux de gris
it: Elaborazione in scala di grigi
ja: グレースケール処理
pl: Przetwarzanie skali szarości
pt: Processamento em escala de cinza
ru: Обработка оттенков серого
tr: Gri tonlamalı işleme
zh_cn: 灰度处理

# RbGrayscaleVector.Text
source: Vectorize
ar: فيكتور
cs: Vektorizovat
de_de: Vektorisieren
es: vectorizar
fr: Vectoriser
it: Vettorizza
ja: ベクトル化
pl: Wektoryzuj
pt: Vetorizar
ru: Векторизовать
tr: vektörleştir
zh_cn: 矢量化

# CbBlackWhiteEnable.Text
source: Black and white
ar: اسود و ابيض
cs: Černý a bílý
es: En blanco y negro
fr: Noir et blanc
it: Bianco e nero
pl: Biel i czerń
pt: Preto e branco
ru: Черное и белое
tr: Siyah ve beyaz
zh_cn: 黑与白

# groupBox8.Text
source: Black and white via threshold
ar: أبيض وأسود عبر العتبة
cs: Černá a bílá přes práh
es: Blanco y negro a través del umbral
fr: Noir et blanc via seuil
it: Bianco e nero tramite soglia
pl: Biel i czerń wg progu
pt: Preto e branco via limiar
ru: Черное и белое через порог
tr: Eşik üzerinden siyah ve beyaz
zh_cn: 黑白过门槛
