Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromImage.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# label13.ToolTip
source: The filter does color channels' filtering by clearing values (set to black), which are inside/outside of the specified value's range. The filter allows to fill certain ranges of RGB color channels with specified value.
ar: يقوم المرشح بترشيح قنوات اللون عن طريق مسح القيم (المعينة إلى الأسود) ، والتي تكون داخل / خارج نطاق القيمة المحددة. يسمح المرشح بملء نطاقات معينة من قنوات ألوان RGB بالقيمة المحددة.
cs: Filtr provádí filtrování barevných kanálů vymazáním hodnot (nastavených na černou), které jsou uvnitř/mimo zadaný rozsah hodnot. Filtr umožňuje vyplnit určité rozsahy barevných kanálů RGB zadanou hodnotou.
de_de: Der Filter filtert die Farbkanäle, indem er Werte löscht (auf Schwarz gesetzt), die innerhalb oder außerhalb des angegebenen Wertebereichs liegen.
es: El filtro filtra los canales de color al borrar los valores (establecidos en negro), que están dentro / fuera del rango del valor especificado.
fr: Le filtre filtre les canaux de couleur en effaçant les valeurs (définies en noir) situées à l'intérieur ou à l'extérieur de la plage de la valeur spécifiée.
it: Il filtro esegue il filtraggio dei canali di colore cancellando i valori (impostati su nero), che si trovano all'interno/al di fuori dell'intervallo del valore specificato.Il filtro consente di riempire determinati intervalli di canali di colore RGB con un valore specificato.
ja: このフィルターは、指定された値の範囲の内側/外側にある値（黒に設定）をクリアすることにより、カラーチャンネルのフィルター処理を行います。 このフィルターを使用すると、特定の範囲のRGBカラーチャネルを指定した値で埋めることができます。
pl: Filtr dokonuje filtracji kanałów kolorów poprzez wyczyszczenie wartości (ustawionych na czarno), które znajdują się wewnątrz/oprócz określonego zakresu wartości. Filtr umożliwia wypełnienie określonych zakresów kanałów kolorów RGB określoną wartością.
pt: O filtro faz a filtragem dos canais de cores limpando os valores (definidos para preto), que estão dentro / fora da faixa do valor especificado. O filtro permite preencher determinados intervalos de canais de cores RGB com o valor especificado.
ru: Фильтр выполняет фильтрацию цветовых каналов путем очистки значений (установленных в черный цвет), которые находятся внутри / вне диапазона указанного значения.
tr: Filtre, belirtilen değer aralığının içinde/dışında bulunan değerleri (siyah olarak ayarlanmış) temizleyerek renk kanallarının filtrelemesini yapar. Filtre, belirli RGB renk kanalı aralıklarını belirtilen değerle doldurmaya izin verir.
zh_cn: 过滤器通过清除位于指定值范围内/外的值（设置为黑色）来进行颜色通道的过滤。

# label14.ToolTip
source: The filter does color channels' filtering by clearing values (set to black), which are inside/outside of the specified value's range.
ar: يقوم المرشح بترشيح قنوات اللون عن طريق مسح القيم (المعينة إلى الأسود) ، والتي تكون داخل / خارج نطاق القيمة المحددة.
cs: Filtr provádí filtrování barevných kanálů vymazáním hodnot (nastavených na černou), které jsou uvnitř/mimo zadaný rozsah hodnot.
de_de: Der Filter filtert die Farbkanäle durch Löschen von Werten (auf Schwarz gesetzt), die innerhalb oder außerhalb des angegebenen Wertebereichs liegen.
es: El filtro filtra los canales de color al borrar los valores (establecidos en negro), que están dentro / fuera del rango del valor especificado.
fr: Le filtre filtre les canaux de couleur en effaçant les valeurs (définies en noir) situées à l'intérieur ou à l'extérieur de la plage de la valeur spécifiée.
it: cap. f g
ja: このフィルターは、指定された値の範囲の内側/外側にある値（黒に設定）をクリアすることにより、カラーチャンネルのフィルター処理を行います。
pl: Filtr dokonuje filtracji kanałów kolorów poprzez wyczyszczenie wartości (ustawionych na czarno), które znajdują się wewnątrz/oprócz określonego zakresu wartości.
pt: O filtro faz a filtragem dos canais de cores limpando os valores (definidos para preto), que estão dentro / fora da faixa do valor especificado.
ru: Фильтр выполняет фильтрацию цветовых каналов путем очистки значений (установленных в черный цвет), которые находятся внутри / вне диапазона указанного значения.
tr: Filtre, belirtilen değer aralığının içinde/dışında bulunan değerleri (siyah olarak ayarlanmış) temizleyerek renk kanallarının filtrelemesini yapar.
zh_cn: 过滤器通过清除位于指定值范围内/外的值（设置为黑色）来进行颜色通道的过滤。

# label15.ToolTip
source: The filter does color channels' filtering by clearing values (set to black), which are inside/outside of the specified value's range.
ar: يقوم المرشح بترشيح قنوات اللون عن طريق مسح القيم (المعينة إلى الأسود) ، والتي تكون داخل / خارج نطاق القيمة المحددة.
cs: Filtr provádí filtrování barevných kanálů vymazáním hodnot (nastavených na černou), které jsou uvnitř/mimo zadaný rozsah hodnot.
de_de: Der Filter filtert die Farbkanäle, indem er Werte löscht (auf Schwarz gesetzt), die innerhalb oder außerhalb des angegebenen Wertebereichs liegen.
es: El filtro filtra los canales de color al borrar los valores (establecidos en negro), que están dentro / fuera del rango del valor especificado.
fr: Le filtre filtre les canaux de couleur en effaçant les valeurs (définies en noir) situées à l'intérieur ou à l'extérieur de la plage de la valeur spécifiée.
it: Il filtro esegue il filtraggio dei canali di colore cancellando i valori (impostati su nero), che si trovano all'interno/al di fuori dell'intervallo del valore specificato.
ja: このフィルターは、指定された値の範囲の内側/外側にある値（黒に設定）をクリアすることにより、カラーチャンネルのフィルター処理を行います。
pl: Filtr dokonuje filtracji kanałów kolorów poprzez wyczyszczenie wartości (ustawionych na czarno), które znajdują się wewnątrz/oprócz określonego zakresu wartości.
pt: O filtro faz a filtragem dos canais de cores limpando os valores (definidos para preto), que estão dentro / fora da faixa do valor especificado.
ru: Фильтр выполняет фильтрацию цветовых каналов путем очистки значений (установленных в черный цвет), которые находятся внутри / вне диапазона указанного значения.
tr: Filtre, belirtilen değer aralığının içinde/dışında bulunan değerleri (siyah olarak ayarlanmış) temizleyerek renk kanallarının filtrelemesini yapar.
zh_cn: 过滤器通过清除位于指定值范围内/外的值（设置为黑色）来进行颜色通道的过滤。

# rBMode0.Text
source: Distance in RGB-Space
ar: المسافة في RGB- الفضاء
cs: Vzdálenost v RGB prostoru
de_de: Abstand im RGB-Raum
es: Distancia en espacio RGB
fr: Distance dans l'espace RVB
it: Distanza nello spazio RGB
ja: RGBスペースでの距離
pl: Zakr. przestrzeni RGB
pt: Distância no espaço RGB
ru: Расстояние в RGB-пространстве
tr: RGB Alanında Mesafe
zh_cn: RGB空间中的距离

# rBMode0.ToolTip
source: Distance in RGB-Space: Math.Sqrt((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B)*(c1.B - c2.B)); }
ar: المسافة في مساحة RGB: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)) ؛ }
cs: Vzdálenost v prostoru RGB: Math.Sqrt((c1.R - ​​c2.R) * (c1.R - ​​c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (cl.B - c2.B)* (cl.B - c2.B)); }
de_de: Abstand im RGB-Raum: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)); }
es: Distancia en el espacio RGB: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)); }
fr: Distance dans l'espace RVB: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)); }
it: Distanza nello spazio RGB: Math.Sqrt((c1.R - ​​c2.R) * (c1.R - ​​c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B)*(c1.B - c2.B)); }
ja: RGB空間の距離：Math.Sqrt（（c1.R-c2.R）*（c1.R-c2.R）+（c1.G-c2.G）*（c1.G-c2.G）+ （c1.B-c2.B）*（c1.B-c2.B））; }
pl: Zakres przestrzeni RGB: Math.Sqrt((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B)*(c1.B - c2.B)); }
pt: Distância no espaço RGB: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)); }
ru: Расстояние в RGB-пространстве: Math.Sqrt ((c1.R - c2.R) * (c1.R - c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B) * (c1.B - c2.B)); }
tr: RGB Uzayında Uzaklık: Math.Sqrt((c1.R - ​​c2.R) * (c1.R - ​​c2.R) + (c1.G - c2.G) * (c1.G - c2.G) + (c1.B - c2.B)*(c1.B - c2.B)); }
zh_cn: RGB空间中的距离：Math.Sqrt（（c1.R-c2.R）*（c1.R-c2.R）+（c1.G-c2.G）*（c1.G-c2.G）+ （c1.B-c2.B）*（c1.B-c2.B））; }

# rBMode1.Text
source: Distance in color-hue (0°-360°)
ar: المسافة في لون هوى (0 ° -360 °)
cs: Vzdálenost v barevném odstínu (0°-360°)
de_de: Abstand im Farbwert (0°-360°)
es: Distancia en tono de color (0 ° -360 °)
fr: Distance en teinte de couleur (0 ° -360 °)
it: Distanza in tonalità di colore (0°-360°)
ja: 色相の距離（0°-360°）
pl: Zakr. odcienia koloru (0°-360°)
pt: Distância em tonalidade da cor (0 ° -360 °)
ru: Расстояние в цвете-оттенке (0 ° -360 °)
tr: Renk tonunda mesafe (0°-360°)
zh_cn: 色相距离（0°-360°）

# rBMode1.ToolTip
source: Distance in color-hue (0°-360°)
ar: المسافة في لون هوى (0 ° -360 °)
cs: Vzdálenost v barevném odstínu (0°-360°)
de_de: Abstand im Farbwert (0°-360°)
es: Distancia en tono de color (0 ° -360 °)
fr: Distance en teinte de couleur (0 ° -360 °)
it: Distanza in tonalità di colore (0°-360°)
ja: 色相の距離（0°-360°）
pl: Zakr. odcienia koloru (0°-360°)
pt: Distância em tonalidade da cor (0 ° -360 °)
ru: Расстояние в цвете-оттенке (0 ° -360 °)
tr: Renk tonunda mesafe (0°-360°)
zh_cn: 色相距离（0°-360°）

# rBMode2.Text
source: Distance in color-hue,-sat.,-bright.
ar: المسافة في لون هوى ، -sat. ، - مشرق.
cs: Vzdálenost v barvě-odstín,-sat.,-světlý.
de_de: Abstd in Farbw., Hellw., Sättigung
es: Distancia en tono de color, saturación, brillo
fr: Distance en teinte, teinte, saturation, luminosité
it: Distanza in colore-tonalità,-sab.,-luminoso.
ja: 色相、彩度、明度での距離。
pl: Zakr. odc., nasycenia, jasności
pt: Distância na cor-matiz, -sat., - brilhante.
ru: Расстояние в цветовой тон, насыщенность, яркость
tr: Mesafe renk tonu,-doymuş,-parlak.
zh_cn: 色相，饱和度，亮度的距离

# rBMode2.ToolTip
source: Distance in color-hue (0°-360°) + color-saturation + color-brightness
ar: المسافة في لون هوى (0 ° -360 °) + تشبع اللون + سطوع اللون
cs: Vzdálenost v barevném odstínu (0°-360°) + sytost barev + jas barev
de_de: Abstand in Farbton (0 ° -360 °) + Farbsättigung + Farbhelligkeit
es: Distancia en tono de color (0 ° -360 °) + saturación de color + brillo de color
fr: Distance en nuance de couleur (0 ° à 360 °) + saturation en couleur + luminosité en couleur
it: Distanza nella tonalità del colore (0°-360°) + saturazione del colore + luminosità del colore
ja: 色相の距離（0°-360°）+色の彩度+色の明るさ
pl: Zakres odcienia koloru (0°-360°) + nasycenie + jasność
pt: Distância na tonalidade da cor (0 ° -360 °) + saturação da cor + brilho da cor
ru: Расстояние в цветовом оттенке (0 ° -360 °) + насыщенность цвета + яркость цвета
tr: Renk tonu mesafesi (0°-360°) + renk doygunluğu + renk parlaklığı
zh_cn: 色相距离（0°-360°）+色饱和度+色亮度

# label7.Text
source: Threshold
ar: خريطة ألوان الصورة لألوان الجدول الأداة
cs: Mapujte barvy obrázku na barvy tabulky nástrojů
de_de: Ordnet die Bildfarben den Farben der Werkzeugtabellen zu
es: Asigna colores de imagen a colores de tabla de herramientas
fr: Mapper les couleurs de l'image aux couleurs de la table d'outils
it: Soglia
ja: 画像の色をツールテーブルの色にマッピングする
pl: Próg
pt: Mapear cores da imagem para as cores da tabela de ferramentas
ru: Сопоставить цвета изображения с цветами таблицы инструментов
tr: Eşik
zh_cn: 将图像颜色映射到工具表颜色

# btnTest.Text
source: Preview
ar: معاينة
cs: Náhled
de_de: Vorschau
es: Avance
fr: Aperçu
it: Anteprima
ja: プレビュー
pl: Podgląd
pt: Pré-visualização
ru: предварительный просмотр
tr: Ön izleme
zh_cn: 预习

# btnTest.ToolTip
source: Keep button pressed to check picture with colors from tool table
ar: استمر في الضغط على الزر للتحقق من الألوان باستخدام جدول الأدوات
cs: Podržte tlačítko stisknuté pro kontrolu obrázku s barvami z tabulky nástrojů
de_de: Halte die Taste gedrückt, um das Bild mit den Farben aus der Werkzeugtabelle zu überprüfen
es: Mantenga presionado el botón para verificar la imagen con los colores de la tabla de herramientas
fr: Maintenez le bouton enfoncé pour vérifier l'image avec les couleurs de la table d'outils
it: Tenere premuto il pulsante per controllare l'immagine con i colori dalla tabella degli strumenti
ja: ボタンを押したままにして、ツールテーブルの色で画像を確認します
pl: Przytrzymaj przycisk, aby sprawdzić obraz z kolorami z tabeli narzędzi
pt: Mantenha o botão pressionado para verificar a imagem com as cores da tabela de ferramentas
ru: Удерживайте кнопку нажатой, чтобы проверить изображение с цветами из таблицы инструментов
tr: Alet tablosundaki renklerle resmi kontrol etmek için düğmeyi basılı tutun
zh_cn: 按住按钮可检查工具表中颜色的图片

# nUDColorPercent.ToolTip
source: Min limit % of color ocurence
ar: الحد الأدنى ٪ من ocurence اللون
cs: Minimální limit % výskytu barvy
de_de: Mindest Vorkommen einer Farbe in Prozent
es: Ocurrencia mínima de un color en porcentaje
fr: Occurrence minimale d'une couleur en pourcentage
it: Limite minimo % dell'occorrenza del colore
ja: 色の発生の最小制限％
pl: Minimalny limit pokrycia kolorem %
pt: % De limite mínimo de ocorrência de cores
ru: Минимальное вхождение цвета в процентах
tr: Renk oluşumunun minimum limit %'si
zh_cn: 颜色出现的最小百分比

# btnPresetCorrection3.Text
source: Comic - few colors
ar: هزلية - بعض الألوان
cs: Komiks - málo barev
de_de: Comic - wenige Farben
es: Comic - pocos colores
fr: Comic - peu de couleurs
it: Comico - pochi colori
ja: コミック-少数の色
pl: Komiks - mało kolorów
pt: Quadrinhos - poucas cores
ru: Комикс - мало цветов
tr: Komik - birkaç renk
zh_cn: 漫画-几种颜色

# btnPresetCorrection3.ToolTip
source: Try to use as less colors as possible, by discarding colors below a certain percentage
ar: حاول استخدام أقل عدد ممكن من الألوان من خلال التخلص من الألوان التي تقل عن نسبة معينة
cs: Pokuste se použít co nejméně barev tím, že vyřadíte barvy pod určité procento
de_de: Es werden so wenig Farben wie möglich verwendet. Farben mit einer Häufigkeit unter dem angegebenen Prozentwert werden in die nächstgelegene Farbe umgewandelt.
es: Intente utilizar la menor cantidad de colores posible, descartando los colores por debajo de un cierto porcentaje
fr: Essayez d'utiliser le moins de couleurs possible en éliminant les couleurs inférieures à un certain pourcentage.
it: Cerca di utilizzare il minor numero di colori possibile, scartando i colori al di sotto di una certa percentuale
ja: 特定の割合未満の色を破棄して、できるだけ少ない色を使用するようにしてください
pl: Spróbuj użyć jak najmniejszej ilości kolorów, odrzucając kolory poniżej pewnego procentu
pt: Tente usar o mínimo de cores possível, descartando cores abaixo de uma certa porcentagem
ru: Старайтесь использовать как можно меньше цветов, отбрасывая цвета ниже определенного процента.
tr: Belirli bir oranın altındaki renkleri atarak mümkün olduğunca az renk kullanmaya çalışın.
zh_cn: 通过丢弃低于一定百分比的颜色，尝试使用尽可能少的颜色

# btnShowSettings.Text
source: show Settings
ar: إعدادات العرض
cs: zobrazit Nastavení
de_de: Einstellungen
es: ajustes de la presentación
fr: Afficher paramètres
it: mostra Impostazioni
ja: 設定を表示
pl: Pokaż ustawienia
pt: Mostrar configurações
ru: показать настройки
tr: ayarları göster
zh_cn: 显示设置

# btnShowSettings.ToolTip
source: Show applied correction values
ar: إظهار قيم التصحيح المطبقة
cs: Zobrazit použité korekční hodnoty
de_de: Angewendete Korrekturwerte anzeigen
es: Mostrar valores de corrección aplicados
fr: Afficher les valeurs de correction appliquées
it: Mostra i valori di correzione applicati
ja: 適用された補正値を表示
pl: Pokaż zastosowane wartości korekcji
pt: Mostrar valores de correção aplicados
ru: Показать примененные значения коррекции
tr: Uygulanan düzeltme değerlerini göster
zh_cn: 显示应用的校正值

# btnShowOrig.Text
source: Original
ar: أصلي
cs: Originál
it: Originale
ja: 元の
pl: Oryginał
ru: оригинал
tr: orijinal
zh_cn: 原版的

# btnShowOrig.ToolTip
source: Press to see original unmodified picture
ar: اضغط لرؤية الصورة الأصلية غير المعدلة
cs: Stisknutím zobrazíte původní neupravený obrázek
de_de: Drücke um originales, unmodifiziertes, Bild zu sehen
es: Presione para ver la imagen original sin modificar
fr: Appuyez sur pour voir l'image originale non modifiée
it: Premere per vedere l'immagine originale non modificata
ja: を押して、元の変更されていない画像を表示します
pl: Naciśnij, aby zobaczyć oryginalny, niezmodyfikowany obraz
pt: Pressione para ver a imagem original não modificada
ru: Нажмите, чтобы увидеть исходное неизмененное изображение
tr: Orijinal değiştirilmemiş resmi görmek için basın
zh_cn: 按下即可查看原始未修改的图片

# nUDGCodeOutlineSmooth.ToolTip
source: Smoothing cycles
ar: دورات تجانس
cs: Vyhlazovací cykly
de_de: Glättungszyklen
es: Ciclos de suavizado
fr: Cycles de lissage
it: Cicli di lisciatura
ja: 平滑化サイクル
pl: Cykle wygładzania
pt: Ciclos de suavização
ru: Циклы сглаживания
tr: Yumuşatma döngüleri
zh_cn: 平滑周期

# cBGCodeOutlineShrink.Text
source: Shrink path
ar: انكماش المسار
cs: Zmenšit cestu
de_de: Pfad verkleinern
es: Camino de encogimiento
fr: Chemin de rétrécissement
it: Riduci il percorso
ja: 収縮経路
pl: Zmniejszanie ścieżki
pt: Encolher caminho
ru: Сжатый путь
tr: Yolu küçült
zh_cn: 收缩路径

# cBGCodeOutlineShrink.ToolTip
source: Shrink path to compensate pen width
ar: تقليص المسار لتعويض عرض القلم
cs: Zmenšením dráhy kompenzujte šířku pera
de_de: Verkleinert den Pfad, um die Stiftbreite auszugleichen
es: Ruta de contracción para compensar el ancho de la pluma
fr: Rétrécir le chemin pour compenser la largeur du stylo
it: Riduci il percorso per compensare la larghezza della penna
ja: ペン幅を補正するパスを縮小
pl: Zmniejszanie ścieżki w celu skompensowania szerokości pióra
pt: Trajeto de contração para compensar a largura da caneta
ru: Сжать путь, чтобы компенсировать ширину пера
tr: Kalem genişliğini telafi etmek için yolu daraltın
zh_cn: 缩小路径以补偿笔宽

# btnGetPWMValues.Text
source: Get servo-PWM settings
ar: احصل على إعدادات servo-PWM
cs: Získejte nastavení servo-PWM
de_de: Kopieren der Servo-PWM-Einstellungen
es: Obtener la configuración del servo-PWM
fr: Obtenez les paramètres servo-PWM
it: Ottieni le impostazioni del servo-PWM
ja: サーボPWM設定を取得する
pl: Pobierz ustawienia serwomechanizmu-PWM
pt: Obtenha as configurações do servo-PWM
ru: Получить настройки серво-ШИМ
tr: Servo-PWM ayarlarını alın
zh_cn: 获取伺服PWM设置

# btnGetPWMValues.ToolTip
source: Get values for RC-Servo Pen-down and Pen-Zero from setup dialog
ar: احصل على قيم RC-Servo Pen-down و Pen-Zero من مربع حوار الإعداد
cs: Získejte hodnoty pro RC-Servo Pen-down a Pen-Zero z dialogu nastavení
de_de: Kopiert die Setup-Dialog Werte für RC-Servo Pen-down und Pen-Zero ab
es: Obtenga valores para RC-Servo Pen-down y Pen-Zero desde el cuadro de diálogo de configuración
fr: Obtenir les valeurs pour RC-Servo Pen-down et Pen-Zero à partir de la boîte de dialogue de configuration
it: Ottieni i valori per RC-Servo Pen-down e Pen-Zero dalla finestra di dialogo di configurazione
ja: セットアップダイアログからRCサーボペンダウンとペンゼロの値を取得します
pl: Pobierz wartości RC-Servo 'Pen-Down' oraz 'Pen-Zero' z dialogu konfiguracyjnego
pt: Obtenha valores para RC-Servo Pen-down e Pen-Zero na caixa de diálogo de configuração
ru: Получите значения для RC-Servo Pen-down и Pen-Zero из диалогового окна настройки
tr: Kurulum iletişim kutusundan RC-Servo Pen-down ve Pen-Zero için değerleri alın
zh_cn: 从设置对话框获取RC-Servo Pen-down和Pen-Zero的值

# cBCompress.Text
source: compress Code
ar: ضغط كود
cs: komprimovat kód
de_de: Code komprimieren
es: comprimir código
fr: compresser le code
it: comprimere il codice
ja: コードを圧縮する
pl: Kompresuj kod
pt: código de compressão
ru: сжать код
tr: sıkıştırma Kodu
zh_cn: 压缩代码

# cBCompress.ToolTip
source: Avoid code overhead for faster streaming
ar: يزيل عبء الكود للحصول على تدفق أسرع
cs: Vyhněte se režii kódu pro rychlejší streamování
de_de: Vermeidet Code-Overhead für ein schnelleres Streaming
es: Elimina la sobrecarga de código para una transmisión más rápida
fr: Élimine la surcharge de code pour une diffusion plus rapide
it: Evita l'overhead del codice per uno streaming più veloce
ja: コードのオーバーヘッドを排除してストリーミングを高速化
pl: Unikanie narzutu kodu dla szybszego strumieniowania
pt: Elimina a sobrecarga de código para streaming mais rápido
ru: Устраняет накладные расходы на код для более быстрой потоковой передачи
tr: Daha hızlı akış için kod yükünden kaçının
zh_cn: 消除代码开销，实现更快的流传输

# Cb2DViewHide0.Text
source: 2D view hide 0
ar: 2D إخفاء الرؤية 0
cs: 2D pohled skrýt 0
de_de: 2D-Ansicht ausblenden 0
es: Vista 2D ocultar 0
fr: Vue 2D masquer 0
it: Nascondi vista 2D 0
ja: 2Dビュー非表示0
pl: Ukryj 0 widoku 2D
pt: Vista 2D ocultar 0
ru: 2D вид скрыть 0
tr: 2B görünüm gizle 0
zh_cn: 2D 视图隐藏 0

# Cb2DViewHide0.ToolTip
source: In 2D view don't show white value (pen width = 0)
ar: في العرض ثنائي الأبعاد لا تظهر قيمة بيضاء (عرض القلم = 0)
cs: Ve 2D zobrazení nezobrazovat bílou hodnotu (šířka pera = 0)
de_de: In der 2D-Ansicht keinen Weißwert anzeigen (Stiftbreite = 0)
es: En la vista 2D no muestra el valor blanco (ancho de la pluma = 0)
fr: Dans la vue 2D, n'affiche pas la valeur du blanc (largeur du stylo = 0)
it: Nella vista 2D non mostra il valore bianco (larghezza penna = 0)
ja: 2Dビューでは、白の値を表示しません（ペンの幅= 0）
pl: Nie pokazuj białych wartości w widoku 2D (szerokość pióra = 0)
pt: Na vista 2D, não mostra o valor de branco (largura da caneta = 0)
ru: В 2D-виде не показывать белое значение (ширина пера = 0)
tr: 2B görünümde beyaz değeri gösterme (kalem genişliği = 0)
zh_cn: 在 2D 视图中不显示白色值（笔宽 = 0）

# nUDResoY.ToolTip
source: Distance between lines, should match pen width
ar: يجب أن تتطابق المسافة بين السطور مع عرض القلم
cs: Vzdálenost mezi řádky by měla odpovídat šířce pera
de_de: Der Abstand zwischen den Linien sollte mit der Stiftbreite übereinstimmen
es: Distancia entre líneas, debe coincidir con el ancho de la pluma
fr: Distance entre les lignes, doit correspondre à la largeur du stylo
it: La distanza tra le righe dovrebbe corrispondere alla larghezza della penna
ja: 行間の距離、ペンの幅と一致する必要があります
pl: Odległość między liniami, powinna odpowiadać szerokości pióra
pt: Distância entre as linhas, deve corresponder à largura da caneta
ru: Расстояние между линиями должно соответствовать ширине пера
tr: Çizgiler arasındaki mesafe, kalem genişliğine uygun olmalıdır
zh_cn: 行之间的距离，应与笔的宽度相匹配

# loadPictureToolStripMenuItem.Text
source: Load Picture
ar: تحميل الصورة
cs: Načíst obrázek
de_de: Bild laden
es: Cargar imagen
fr: Charger une image
it: Carica immagine
ja: 画像を読み込む
pl: Wczytaj obraz
pt: Carregar imagem
ru: Загрузить картинку
tr: Resim Yükle
zh_cn: 载入图片

# pasteFromClipboardToolStripMenuItem.Text
source: Paste from clipboard
ar: لصق من الحافظة
cs: Vložit ze schránky
de_de: Aus Zwischenablage
es: Pegar desde el portapapeles
fr: Coller du presse-papier
it: Incolla dagli appunti
ja: クリップボードから貼り付け
pl: Wklej ze schowka
pt: Colar da área de transferência
ru: Вставить из буфера обмена
tr: Panodan yapıştır
zh_cn: 从剪贴板粘贴

# label8.Text
source: Z max (white)
ar: Z كحد أقصى (أبيض)
cs: Z max (bílá)
de_de: Z max (weiß)
es: Z max (blanco)
fr: Z max (blanc)
it: Z max (bianco)
ja: Z max（白）
pl: Z max (biały)
pt: Z max (branco)
ru: Z max (белый)
tr: Z maks (beyaz)
zh_cn: 最大Z（白色）

# label9.Text
source: Z min (black)
ar: Z دقيقة (أسود)
cs: Z min (černá)
de_de: Z min (schwarz)
es: Z min (negro)
fr: Z min (noir)
it: Z min (nero)
ja: Z min（黒）
pl: Z min (czarny)
pt: Z min (preto)
ru: Z мин (черный)
tr: Z dak (siyah)
zh_cn: Z分钟（黑色）

# label22.Text
source: S min (white)
ar: S min (أبيض)
cs: S min (bílá)
de_de: S min (weiß)
es: S min (blanco)
fr: S min (blanc)
it: S min (bianco)
ja: S分（白）
pl: S min (biały)
pt: S min (branco)
ru: S мин (белый)
tr: S dk (beyaz)
zh_cn: S min（白色）

# label23.Text
source: S max (black)
ar: S max (أسود)
cs: S max (černá)
de_de: S max (schwarz)
es: S max (negro)
fr: S max (noir)
it: S max (nero)
ja: S max（黒）
pl: S max (czarny)
pt: S max (preto)
ru: S max (черный)
tr: S maks (siyah)
zh_cn: S max（黑色）
