Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeForWireCutter.*.resx
Languages: de_de, es, fr, zh_cn

# btnApply.Text
source: Create GCode
de_de: GCode erstellen
es: Crear código G
fr: Créer un GCode
zh_cn: 创建G代码

# label3.Text
source: Gap Y
de_de: Lücke Y
es: Brecha Y
fr: Écart Y
zh_cn: 间隙Y

# label4.Text
source: Gap
de_de: Lücke X
es: Brecha X
fr: Écart X
zh_cn: 间隙X

# label2.Text
source: Vertical
de_de: Vertikal
fr: Verticale
zh_cn: 垂直的

# label1.Text
source: Horizontal
zh_cn: 水平的

# groupBox1.Text
source: Array size
de_de: Arraygröße
es: Tamaño de la matriz
fr: Taille du tableau
zh_cn: 数组大小

# label7.Text
source: Number of sections
de_de: Anzahl der Abschnitte
es: Número de secciones
fr: Nombre de sections
zh_cn: 节数

# label5.Text
source: Outer diameter
de_de: Außendurchmesser
es: Diámetro externo
fr: Diamètre extérieur
zh_cn: 外径

# label6.Text
source: Inner diameter
de_de: Innendurchmesser
es: Diámetro interno
fr: Diamètre intérieur
zh_cn: 内径

# groupBox2.Text
source: Circular ring section
de_de: Kreisringabschnitt
es: Sección de anillo circular
fr: Section d'anneau circulaire
zh_cn: 圆环截面

# NudArrayGapY.ToolTip
source: Gap between connection path and objects in Y direction.
de_de: Lücke zwischen Verbindungspfad und Objekten in Y-Richtung.
es: Espacio entre la ruta de conexión y los objetos en dirección Y.
fr: Écart entre le chemin de connexion et les objets dans la direction Y.
zh_cn: 连接路径与 Y 方向对象之间的间隙。

# NudArrayGapX.ToolTip
source: Gap between connection path and objects in X direction.
de_de: Lücke zwischen Verbindungspfad und Objekten in X-Richtung.
es: Espacio entre la ruta de conexión y los objetos en la dirección X.
fr: Écart entre le chemin de connexion et les objets dans la direction X.
zh_cn: X 方向连接路径与对象之间的间隙。

# NudArrayY.ToolTip
source: Number of objects in Y direction.
de_de: Anzahl der Objekte in Y-Richtung.
es: Número de objetos en dirección Y.
fr: Nombre d'objets dans la direction Y.
zh_cn: Y 方向上的对象数量。

# NudArrayX.ToolTip
source: Number of objects in X direction.
de_de: Anzahl der Objekte in X-Richtung.
es: Número de objetos en dirección X.
fr: Nombre d'objets dans la direction X.
zh_cn: X 方向上的对象数量。

# NudCRingSegments.ToolTip
source: Number of segments to divide a circle into.
de_de: Anzahl der Segmente, in die ein Kreis unterteilt werden soll.
es: Número de segmentos en los que dividir un círculo.
fr: Nombre de segments en lesquels diviser un cercle.
zh_cn: 将圆分成的线段数。

# NudCRingOut.ToolTip
source: Outer diameter of the ring
de_de: Außendurchmesser des Rings
es: Diámetro exterior del anillo.
fr: Diamètre extérieur de la bague
zh_cn: 环外径

# NudCRingIn.ToolTip
source: Inner diameter of the ring
de_de: Innendurchmesser des Rings
es: Diámetro interior del anillo
fr: Diamètre intérieur de la bague
zh_cn: 环内径

# label8.Text
source: A (hot) wire cutter can't switch on or off it's tool, the 'Pen up/down' translations are useless. All objects are conected and the conection lines must not cross the objects.
de_de: Ein (Heiß-) Drahtschneider kann sein Werkzeug nicht ein- oder ausschalten, die Übersetzungen „Stift hoch/runter“ sind nutzlos. Alle Objekte sind verbunden und die Verbindungslinien dürfen die Objekte nicht kreuzen.
es: Un cortador de alambre (caliente) no puede encender o apagar su herramienta, las traducciones 'Pluma arriba/abajo' son inútiles. Todos los objetos están conectados y las líneas de conexión no deben cruzar los objetos.
fr: Un coupe-fil (chaud) ne peut pas allumer ou éteindre son outil, les traductions 'Stylo haut/bas' sont inutiles. Tous les objets sont connectés et les lignes de connexion ne doivent pas traverser les objets.
zh_cn: （热）钢丝钳无法打开或关闭其工具，“笔向上/向下”翻译是无用的。所有对象都是连接的，连接线不得与对象相交。

# groupBox3.Text
source: Tool
de_de: Werkzeug
es: Herramienta
fr: Outil
zh_cn: 工具

# tabPage1.Text
source: Circular ring section array
de_de: Anordnung kreisförmiger Ringabschnitte
es: Conjunto de sección de anillo circular
fr: Réseau de sections d'anneaux circulaires
zh_cn: 圆环截面阵列

# tabPage2.Text
source: Empty
de_de: Leer
es: Vacío
fr: Vide
zh_cn: 空的

# label9.Text
source: Tool Diameter
de_de: Werkzeugdurchmesser
es: Diámetro de la herramienta
fr: Diamètre de l'outil
zh_cn: 刀具直径

# NudToolDiameter.ToolTip
source: Diameter of the gap created after using the tool (a hot wire creates a larger gap than its wire diameter).
de_de: Durchmesser des Spalts, der nach der Verwendung des Werkzeugs entsteht (ein heißer Draht erzeugt einen größeren Spalt als sein Drahtdurchmesser).
es: Diámetro del espacio creado después de usar la herramienta (un alambre caliente crea un espacio mayor que el diámetro del alambre).
fr: Diamètre de l'espace créé après utilisation de l'outil (un fil chaud crée un espace plus grand que son diamètre de fil).
zh_cn: 使用工具后产生的间隙直径（热丝产生的间隙大于其丝直径）。

# $this.Text
source: G-Code for wire cutter
de_de: G-Code für Drahtschneider
es: Código G para cortador de alambre
fr: Code G pour coupe-fil
zh_cn: 钢丝钳 G 代码
