Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromTablet.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# groupBox1.Text
source: Live update
ar: تحديث مباشر
cs: Živá aktualizace
es: Actualización en vivo
fr: Mise à jour en direct
it: Aggiornamento in tempo reale
ja: ライブアップデート
pl: Aktualizacja na żywo
pt: Atualização ao vivo
ru: Обновление в реальном времени
tr: Canlı Güncelleme
zh_cn: 实时更新

# GbSize.Text
source: Plotter working size
ar: حجم الراسمة
cs: Pracovní velikost plotru
de_de: Plotter-Arbeitsgröße
es: Tamaño de trabajo del plotter
fr: Taille de travail du traceur
it: Dimensioni di lavoro del plotter
ja: プロッタ作業サイズ
pl: Rozmiar roboczy plotera
pt: Tamanho de trabalho do plotter
ru: Рабочий размер плоттера
tr: Plotter çalışma boyutu
zh_cn: 绘图仪工作尺寸

# GbPen.Text
source: Pen / brush size
ar: حجم القلم/الفرشاة
cs: Velikost pera / štětce
de_de: Stift-/Pinselgröße
es: Tamaño de pluma/pincel
fr: Taille du stylet/pinceau
it: Dimensioni penna/pennello
ja: ペン/ブラシサイズ
pl: Rozmiar pióra/pędzla
pt: Tamanho da caneta/pincel
ru: Размер пера/кисти
tr: Kalem / fırça boyutu
zh_cn: 笔/画笔尺寸

# GbColor.Text
source: Color
ar: لون
cs: Barva
de_de: Farbe
fr: Couleur
it: Colore
ja: 色
pl: Kolor
pt: Cor
ru: Цвет
tr: Renk
zh_cn: 颜色

# LblInfo.Text
source: A stylus is a digital pen, which also delivers a pressure value (0% to 100%). This pressure value controls the pen width and can be converted to a Z-value (for a Z axis) or a S-value (for a RC-servo) to control the plotters pen pressure. A mouse delivers a constant pressure value of 50%.
ar: القلم الرقمي هو قلم رقمي يُعطي قيمة ضغط (من ٠٪ إلى ١٠٠٪). تتحكم هذه القيمة في عرض القلم، ويمكن تحويلها إلى قيمة Z (للمحور Z) أو قيمة S (للمحرك المؤازر RC) للتحكم في ضغط قلم الراسمة. يُعطي الماوس قيمة ضغط ثابتة قدرها ٥٠٪.
cs: Stylus je digitální pero, které také poskytuje hodnotu tlaku (0 % až 100 %). Tato hodnota tlaku řídí šířku pera a lze ji převést na hodnotu Z (pro osu Z) nebo hodnotu S (pro RC servo) pro řízení tlaku pera plotru. Myš poskytuje konstantní hodnotu tlaku 50 %.
de_de: Ein Stylus ist ein digitaler Stift, der ebenfalls einen Druckwert (0 % bis 100 %) liefert. Dieser Druckwert steuert die Stiftbreite und kann in einen Z-Wert (für eine Z-Achse) oder einen S-Wert (für einen RC-Servo) umgewandelt werden, um den Stiftdruck des Plotters zu steuern. Eine Maus liefert einen konstanten Druckwert von 50 %.
es: Un lápiz digital proporciona un valor de presión (del 0 % al 100 %). Este valor controla el ancho del lápiz y puede convertirse en un valor Z (para el eje Z) o en un valor S (para un servocontrolador RC) para controlar la presión del lápiz del plotter. Un ratón proporciona un valor de presión constante del 50 %.
fr: Un stylet est un stylo numérique qui fournit également une valeur de pression (de 0 % à 100 %). Cette valeur contrôle la largeur du stylo et peut être convertie en valeur Z (pour un axe Z) ou S (pour un servomoteur RC) afin de contrôler la pression du stylo du traceur. Une souris fournit une valeur de pression constante de 50 %.
it: Uno stilo è una penna digitale che fornisce anche un valore di pressione (da 0% a 100%). Questo valore di pressione controlla lo spessore della penna e può essere convertito in un valore Z (per un asse Z) o in un valore S (per un servocomando RC) per controllare la pressione della penna del plotter. Un mouse fornisce un valore di pressione costante del 50%.
ja: スタイラスはデジタルペンの一種で、圧力値（0%～100%）を出力します。この圧力値はペン幅を制御し、Z値（Z軸の場合）またはS値（RCサーボの場合）に変換してプロッタのペン圧力を制御できます。 マウスは50%の一定の圧力値を提供します。
pl: Rysik to cyfrowy długopis, który również dostarcza wartość nacisku (od 0% do 100%). Ta wartość nacisku kontroluje szerokość długopisu i może być przekonwertowana na wartość Z (dla osi Z) lub wartość S (dla serwa RC), aby kontrolować nacisk długopisu plotera. Mysz dostarcza stałą wartość nacisku 50%.
pt: Uma caneta stylus é uma caneta digital que também fornece um valor de pressão (0% a 100%). Este valor de pressão controla a largura da caneta e pode ser convertido em um valor Z (para um eixo Z) ou um valor S (para um servo RC) para controlar a pressão da caneta do plotter. Um mouse fornece um valor de pressão constante de 50%.
ru: Стилус — это цифровое перо, которое также обеспечивает значение давления (от 0% до 100%). Это значение давления управляет шириной пера и может быть преобразовано в значение Z (для оси Z) или значение S (для RC-сервопривода) для управления давлением пера плоттера. Мышь обеспечивает постоянное значение давления 50%.
tr: Kalem, bir basınç değeri (0% ila 100%) de veren dijital bir kalemdir. Bu basınç değeri kalem genişliğini kontrol eder ve çizici kalem basıncını kontrol etmek için bir Z değerine (bir Z ekseni için) veya bir S değerine (bir RC servo için) dönüştürülebilir. Bir fare %50'lik sabit bir basınç değeri verir.
zh_cn: 手写笔是一种数字笔，它也能提供压力值（0% 到 100%）。该压力值控制笔的宽度，并可转换为 Z 值（用于 Z 轴）或 S 值（用于 RC 伺服电机），以控制绘图仪的笔压。 鼠标提供 50% 的恒定压力值。

# BtnReduce.Text
source: Apply value
ar: طبّق قيمة
cs: Použít hodnotu
de_de: Wert anwenden
es: Aplicar valor
fr: Appliquer la valeur
it: Applica valore
ja: 値を適用
pl: Zastosuj wartość
pt: Aplicar valor
ru: Применить значение
tr: Değeri uygula
zh_cn: 应用值

# BtnReduce.ToolTip
source: Reduce amount of data points per stroke. Keep minimum distance. Apply new value to all strokes.
ar: قلّل عدد نقاط البيانات لكلّ ضربة. حافظ على الحدّ الأدنى للمسافة. طبّق قيمة جديدة على جميع الضربات.
cs: Snižte počet datových bodů na tah. Zachovejte minimální vzdálenost. Použijte novou hodnotu na všechny tahy.
de_de: Anzahl der Datenpunkte pro Strich reduzieren. Mindestabstand einhalten. Neuen Wert auf alle Striche anwenden.
es: Reducir la cantidad de puntos de datos por trazo. Mantener la distancia mínima. Aplicar el nuevo valor a todos los trazos.
fr: Réduire le nombre de points de données par trait. Maintenir une distance minimale. Appliquer la nouvelle valeur à tous les traits.
it: Riduci la quantità di punti dati per tratto. Mantieni la distanza minima. Applica il nuovo valore a tutti i tratti.
ja: ストロークごとのデータポイント数を減らします。最小距離を維持します。すべてのストロークに新しい値を適用します。
pl: Zmniejsz liczbę punktów danych na pociągnięcie pędzlem. Zachowaj minimalną odległość. Zastosuj nową wartość do wszystkich pociągnięć pędzlem.
pt: Reduza a quantidade de pontos de dados por traço. Mantenha a distância mínima. Aplique o novo valor a todos os traços.
ru: Уменьшить количество точек данных на один штрих. Сохранять минимальное расстояние. Применить новое значение ко всем штрихам.
tr: Vuruş başına veri noktası sayısını azaltın. Minimum mesafeyi koruyun. Tüm vuruşlara yeni değer uygulayın.
zh_cn: 减少每笔画的数据点数量。保持最小距离。将新值应用于所有笔画。

# NudPointDistance.ToolTip
source: Minimum distance between stroke points will be applied after finishing a stroke.
ar: تُطبق المسافة الدنيا بين نقاط الضربة بعد الانتهاء منها.
cs: Po dokončení tahu bude použita minimální vzdálenost mezi body tahu.
de_de: Der Mindestabstand zwischen den Strichpunkten wird nach Abschluss eines Strichs angewendet.
es: La distancia mínima entre los puntos del trazo se aplicará al finalizarlo.
fr: La distance minimale entre les points du trait sera appliquée après la fin du trait.
it: La distanza minima tra i punti del tratto verrà applicata al termine del tratto.
ja: ストロークの終了時に、ストローク点間の最小距離が適用されます。
pl: Minimalna odległość między punktami kreskowania zostanie zastosowana po zakończeniu kreskowania.
pt: A distância mínima entre os pontos do traço será aplicada após a conclusão do traço.
ru: Минимальное расстояние между точками штриха будет применено после завершения штриха.
tr: Çizim noktaları arasındaki minimum mesafe, çizgi tamamlandıktan sonra uygulanacaktır.
zh_cn: 笔触完成后，将应用笔触点之间的最小距离。

# label4.ToolTip
source: Stroke width at 100% pressure
ar: عرض الشوط عند ضغط ١٠٠٪
cs: Šířka tahu při 100% tlaku
de_de: Strichbreite bei 100 % Druck
es: Ancho de trazo al 100 % de presión
fr: Largeur de trait à 100 % de pression
it: Larghezza del tratto al 100% di pressione
ja: 筆圧100%時の線幅
pl: Szerokość pociągnięcia przy 100% nacisku
pt: Largura do curso com 100% de pressão
ru: Ширина штриха при 100% нажиме
tr: %100 basınçta strok genişliği
zh_cn: 100% 压力下的描边宽度

# BtnSwitchXy.ToolTip
source: Swap X and Y values
ar: تبديل قيمتي X وY
cs: Prohoďte hodnoty X a Y
de_de: X- und Y-Werte vertauschen
es: Intercambiar valores de X e Y
fr: Inverser les valeurs X et Y
it: Scambia i valori X e Y
ja: XとYの値を入れ替える
pl: Zamień wartości X i Y
pt: Alterar os valores X e Y
ru: Поменять местами значения X и Y
tr: X ve Y değerlerini değiştirin
zh_cn: 交换 X 和 Y 值

# BtnCloseSetup.Text
source: Close Setup
ar: يغلق
cs: Blízko
de_de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
pl: Zamknij
pt: Fechar
ru: Закрыть
tr: Kapat
zh_cn: 关闭

# label6.Text
source: Setup
ar: يثبت
cs: Nastavení
de_de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
pl: Ustawienia
pt: Configurações
ru: Настройки
tr: Ayarlar
zh_cn: 设置

# toolStripMenuItem1.Text
source: File
ar: ملف
cs: Soubor
de_de: Datei
es: Archivo
fr: Fichier
ja: ファイル
pl: Plik
pt: Arquivo
ru: Файл
tr: Dosya
zh_cn: 文件

# openToolStripMenuItem.Text
source: Open
ar: فتح
cs: Otevřít
de_de: Öffnen
es: Abrir
fr: Ouvrir
it: Apri
ja: 開く
pl: Otwórz
pt: Abrir
ru: Открыть
tr: Aç
zh_cn: 打开

# toolStripMenuItem2.Text
source: Create
ar: أنشئ
cs: Vytvořit
de_de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
pl: Utwórz
pt: Criar
ru: Создать
tr: Oluştur
zh_cn: 创建

# dLiveUpdateToolStripMenuItem.Text
source: 2D view live update
ar: تحديث مباشر للعرض ثنائي الأبعاد
cs: Aktualizace 2D zobrazení
de_de: Live-Update der 2D-Ansicht
es: Actualización en tiempo real de la vista 2D
fr: Mise à jour en direct de la vue 2D
it: Aggiornamento in tempo reale della vista 2D
ja: 2Dビューのライブ更新
pl: Aktualizacja widoku 2D na żywo
pt: Atualização ao vivo da visualização 2D
ru: Обновление 2D-вида в режиме реального времени
tr: 2B görünüm canlı güncelleme
zh_cn: 二维视图实时更新

# dLiveUpdateToolStripMenuItem.ToolTipText
source: Add each finished stroke to 2D view in main form
ar: إضافة كل رسمة نهائية إلى العرض ثنائي الأبعاد في النموذج الرئيسي
cs: Přidat každý dokončený tah do 2D zobrazení v hlavním formuláři
de_de: Jeden fertigen Strich in die 2D-Ansicht im Hauptformular einfügen
es: Añadir cada trazo terminado a la vista 2D en el formulario principal
fr: Ajouter chaque trait terminé à la vue 2D du formulaire principal
it: Aggiungi ogni tratto finito alla vista 2D nel modulo principale
ja: 完成したストロークをメインフォームの2Dビューに追加
pl: Dodaj każdy ukończony obrys do widoku 2D w formularzu głównym
pt: Adicionar cada traço finalizado à visualização 2D no formulário principal
ru: Добавить каждый готовый штрих в 2D-вид в основной форме
tr: Bitmiş her çizgiyi ana formdaki 2B görünüme ekle
zh_cn: 将每个完成的笔画添加到主窗口中的二维视图

# importWholeDrawingToolStripMenuItem.Text
source: Import whole drawing
ar: استيراد الرسم بالكامل
cs: Importovat celý výkres
de_de: Gesamte Zeichnung importieren
es: Importar dibujo completo
fr: Importer le dessin entier
it: Importa l'intero disegno
ja: 図面全体をインポート
pl: Importuj cały rysunek
pt: Importar desenho inteiro
ru: Импортировать весь рисунок
tr: Tüm çizimi içe aktar
zh_cn: 导入整幅图纸

# plotterToolStripMenuItem.Text
source: Plotter
ar: الرسام
fr: Traceur
ja: プロッタ
pl: Ploter
ru: Плоттер
zh_cn: 绘图仪

# liveUpdateToolStripMenuItem.Text
source: Live update
ar: تحديث مباشر
cs: Živá aktualizace
es: Actualización en vivo
fr: Mise à jour en direct
it: Aggiornamento in tempo reale
ja: ライブ更新
pl: Aktualizacja na żywo
pt: Atualização em tempo real
ru: Обновление в реальном времени
tr: Canlı güncelleme
zh_cn: 实时更新

# liveUpdateToolStripMenuItem.ToolTipText
source: Update plotter position on pen or mouse move.
ar: تحديث موضع الراسمة عند تحريك القلم أو الماوس.
cs: Aktualizace polohy plotru při pohybu pera nebo myši.
de_de: Aktualisiert die Plotterposition bei Stift- oder Mausbewegung.
es: Actualiza la posición del plotter al mover el lápiz o el ratón.
fr: Mise à jour de la position du traceur en fonction du mouvement du stylet ou de la souris.
it: Aggiorna la posizione del plotter spostando la penna o il mouse.
ja: ペンまたはマウスの動きに応じてプロッタの位置を更新します。
pl: Aktualizuj pozycję plotera po poruszeniu piórem lub myszą.
pt: Atualiza a posição do plotter ao mover a caneta ou o mouse.
ru: Обновляйте положение плоттера при перемещении пера или мыши.
tr: Kalem veya fare hareketiyle çizici konumunu güncelleyin.
zh_cn: 随着笔或鼠标的移动更新绘图仪的位置。

# setupToolStripMenuItem.Text
source: Setup / Help
ar: الإعداد / المساعدة
cs: Nastavení / Nápověda
de_de: Einrichtung / Hilfe
es: Configuración / Ayuda
fr: Configuration / Aide
it: Configurazione/Aiuto
ja: セットアップ/ヘルプ
pl: Konfiguracja / Pomoc
pt: Configuração/Ajuda
ru: Настройка/Помощь
tr: Kurulum / Yardım
zh_cn: 设置/帮助

# MenuNewClear.Text
source: New (clear canvas)
ar: جديد (مسح اللوحة)
cs: Nové (průhledné plátno)
de_de: Neu (Leinwand leeren)
es: Nuevo (lienzo en blanco)
fr: Nouveau (effacer la zone de travail)
it: Nuovo (cancella tela)
ja: 新規（キャンバスをクリア）
pl: Nowy (wyczyść płótno)
pt: Novo (tela limpa)
ru: Создать (очистить холст)
tr: Yeni (temiz tuval)
zh_cn: 新建（清除画布）

# label7.Text
source: Min. distance
ar: الحد الأدنى للمسافة
cs: Minimální vzdálenost
de_de: Mindestabstand
es: Distancia mínima
fr: Distance minimale
it: Distanza minima
ja: 最小距離
pl: Minimalna odległość
pt: Distância mínima
ru: Мин. расстояние
tr: Minimum mesafe
zh_cn: 最小距离

# LblStrokes.Text
source: A stroke drawn with the stylus consists of countless point coordinates. After a stroke is completed, the number of points is reduced to a necessary number.
ar: تتكون كل ضربة قلم من عدد لا نهائي من إحداثيات النقاط. بعد اكتمال كل ضربة، يُقلل عدد النقاط إلى الحد الأدنى المطلوب.
cs: Tah nakreslený stylusem se skládá z nespočtu bodových souřadnic. Po dokončení tahu se počet bodů sníží na nezbytný počet.
de_de: Ein mit dem Stift gezeichneter Strich besteht aus unzähligen Punktkoordinaten. Nach Abschluss eines Strichs wird die Anzahl der Punkte auf die erforderliche Anzahl reduziert.
es: Un trazo dibujado con el lápiz óptico consta de innumerables coordenadas de puntos. Tras completar un trazo, el número de puntos se reduce al necesario.
fr: Un trait tracé au stylet est composé d'innombrables coordonnées de points. Une fois le trait terminé, le nombre de points est réduit au nombre nécessaire.
it: Un tratto disegnato con lo stilo è costituito da innumerevoli coordinate di punti. Una volta completato un tratto, il numero di punti viene ridotto al numero necessario.
ja: スタイラスで描いたストロークは、無数の点座標で構成されます。ストロークが完了すると、点の数は必要な数にまで削減されます。
pl: Kres narysowany rysikiem składa się z niezliczonej liczby współrzędnych punktów. Po zakończeniu kreskowania liczba punktów jest redukowana do niezbędnej wartości.
pt: Um traço desenhado com a caneta consiste em inúmeras coordenadas de pontos. Após a conclusão do traço, o número de pontos é reduzido ao número necessário.
ru: Штрих, нарисованный стилусом, состоит из множества точек. После завершения штриха количество точек уменьшается до необходимого.
tr: Kalemle çizilen bir çizgi, sayısız nokta koordinatından oluşur. Bir çizgi tamamlandıktan sonra, nokta sayısı gerekli sayıya düşürülür.
zh_cn: 用手写笔绘制的笔触由无数个点坐标组成。笔触完成后，点数会减少到所需的数量。

# GbModify.Text
source: Modify strokes
ar: تعديل الضربات
cs: Upravit tahy
de_de: Striche ändern
es: Modificar trazos
fr: Modifier les traits
it: Modifica tratti
ja: ストロークを修正
pl: Modyfikuj kreskowania
pt: Modificar traços
ru: Изменить штрихи
tr: Çizimleri değiştir
zh_cn: 修改笔触

# CbMovementMouse.Text
source: Move also on mouse motion
ar: التحرك أيضًا على حركة الماوس
cs: Pohybovat se také pohybem myši
de_de: Auch bei Mausbewegungen
es: Mover también con el movimiento del ratón
fr: Déplacez-vous également sur le mouvement de la souris
it: Muoviti anche con il movimento del mouse
ja: マウスの動きに合わせて移動
pl: Przesuń również za pomocą ruchu myszy
pt: Mova também no movimento do mouse
ru: Двигаться также по движению мыши
tr: Fare hareketiyle de hareket edin
zh_cn: 鼠标移动时也移动

# importXyzDataToolStripMenuItem.Text
source: Import xyz data
cs: Import dat xyz
de_de: XYZ-Daten importieren
es: Importar datos xyz
fr: Importer des données XYZ
it: Importa dati xyz
ja: xyzデータのインポート
pl: Importuj dane xyz
pt: Importar dados xyz
ru: Импорт данных XYZ
tr: xyz verilerini içe aktar
zh_cn: 导入 xyz 数据

# importXyzDataToolStripMenuItem.ToolTipText
source: Import XYZ data from clipboard (tab seperated values x y z or x z)
cs: Import dat XYZ ze schránky (hodnoty x y z nebo x z oddělené tabulací)
de_de: XYZ-Daten aus der Zwischenablage importieren (tabulatorgetrennte Werte xyz oder xz)
es: Importar datos XYZ desde el portapapeles (valores separados por tabulaciones x y z o x z)
fr: Importer des données XYZ depuis le presse-papiers (valeurs x, y, z ou x, z séparées par des tabulations)
it: Importa dati XYZ dagli appunti (valori separati da tabulazione x y z o x z)
ja: クリップボードからXYZデータをインポートします（タブ区切りのxyzまたはxzの値）
pl: Importuj dane XYZ ze schowka (wartości rozdzielone tabulatorem x y z lub x z)
pt: Importar dados XYZ da área de transferência (valores x y z ou x z separados por tabulação)
ru: Импорт данных XYZ из буфера обмена (значения, разделенные табуляцией, x, y, z или x, z)
tr: Panodan XYZ verilerini içe aktar (sekmeyle ayrılmış değerler x y z veya x z)
zh_cn: 从剪贴板导入 XYZ 数据（制表符分隔的 xyz 或 xz 值）
