Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromTablet.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# importWholeDrawingToolStripMenuItem.ToolTipText
source: Read all strokes from canvas and convert them to GCode.
ar: اقرأ جميع الخطوط من اللوحة القماشية وحولها إلى GCode.
cs: Načíst všechny tahy z plátna a převést je do G-kódu.
de_de: Alle Striche von der Leinwand lesen und in GCode konvertieren.
es: Leer todos los trazos del lienzo y convertirlos a código G.
fr: Lire tous les traits du canevas et les convertir en GCode.
it: Leggi tutti i tratti dalla tela e convertili in GCode.
ja: キャンバスからすべてのストロークを読み取り、GCode に変換します。
pl: Odczytaj wszystkie pociągnięcia z płótna i przekonwertuj je na kod GCode.
pt: Leia todos os traços da tela e converta-os para GCode.
ru: Считывать все штрихи с холста и преобразовывать их в GCode.
tr: Tuvaldeki tüm vuruşları oku ve GCode'a dönüştür.
zh_cn: 读取画布上的所有笔触并将其转换为 GCode。

# CbMovementPenUp.Text
source: Move also if pen is up
ar: التحريك عند رفع القلم
cs: Pohyb při zvednutém peru
de_de: Bewegen bei angehobenen Stift
es: Mover al levantar la pluma
fr: Déplacement lorsque le stylet est levé
it: Sposta con penna sollevata
ja: ペンが上がっているときに移動
pl: Przesuń, gdy pióro jest w górze
pt: Mover com a caneta para cima
ru: Перемещение при поднятом пере
tr: Kalem yukarı doğru hareket ettir
zh_cn: 提笔时移动

# CbMovementPenUp.ToolTip
source: Also send move commands to the plotter if pen/stylus is up.
ar: إرسال أوامر التحريك إلى الراسم عند رفع القلم.
cs: Odesílá také příkazy pro pohyb do plotru, pokud je pero zvednuté.
de_de: Sendet auch Bewegungsbefehle an den Plotter, wenn der Stift angehoben ist.
es: También envía comandos de movimiento al plotter si la pluma está levantada.
fr: Envoie également des commandes de déplacement au traceur si le stylet est levé.
it: Invia anche comandi di spostamento al plotter se la penna è sollevata.
ja: ペンが上がっている場合も、プロッタに移動コマンドを送信します。
pl: Wysyłaj również polecenia ruchu do plotera, jeśli pióro jest w górze.
pt: Também envia comandos de movimento para o plotter se a caneta estiver para cima.
ru: Также отправляет команды перемещения плоттеру, если перо поднято.
tr: Ayrıca kalem yukarıdaysa çiziciye hareket komutları gönder.
zh_cn: 如果提笔，也向绘图仪发送移动命令。

# BtnRefresh.ToolTip
source: Update 2D view
ar: تحديث العرض ثنائي الأبعاد
cs: Aktualizovat 2D zobrazení
de_de: 2D-Ansicht aktualisieren
es: Actualizar vista 2D
fr: Mettre à jour la vue 2D
it: Aggiorna vista 2D
ja: 2Dビューを更新
pl: Aktualizuj widok 2D
pt: Atualizar visualização 2D
ru: Обновить 2D-вид
tr: 2B görünümü güncelle
zh_cn: 更新二维视图

# NudSizePen.ToolTip
source: Real pen width, needed to show correct pen width on canvas.
ar: عرض القلم الحقيقي ضروري لعرض عرض القلم الصحيح على اللوحة القماشية.
cs: Skutečná šířka pera, potřebná pro zobrazení správné šířky pera na plátně.
de_de: Reale Stiftbreite, erforderlich für die korrekte Stiftbreite auf der Leinwand.
es: Ancho real de la pluma, necesario para mostrar el ancho correcto de la pluma en el lienzo.
fr: Largeur réelle du stylet, nécessaire pour afficher la largeur correcte du stylet sur la zone de dessin.
it: Larghezza reale della penna, necessaria per visualizzare la larghezza corretta sulla tela.
ja: 実際のペン幅。キャンバス上で正しいペン幅を表示するために必要です。
pl: Rzeczywista szerokość pióra, potrzebna do wyświetlenia prawidłowej szerokości pióra na płótnie.
pt: Largura real da caneta, necessária para mostrar a largura correta da caneta na tela.
ru: Реальная ширина пера, необходимая для отображения правильной ширины пера на холсте.
tr: Gerçek kalem genişliği, tuvalde doğru kalem genişliğini göstermek için gereklidir.
zh_cn: 实际笔宽，需要在画布上显示正确的笔宽。

# NudSizeY.ToolTip
source: Canvas height will be translated to this plotter height.
ar: سيتم تحويل ارتفاع اللوحة القماشية إلى ارتفاع الراسمة هذا.
cs: Výška plátna bude převedena na tuto výšku plotru.
de_de: Die Leinwandhöhe wird auf diese Plotterhöhe umgerechnet.
es: La altura del lienzo se traducirá a la altura de este plotter.
fr: La hauteur de la zone de dessin sera convertie à cette hauteur du traceur.
it: L'altezza della tela verrà tradotta in base all'altezza del plotter.
ja: キャンバスの高さはこのプロッタの高さに変換されます。
pl: Wysokość płótna zostanie przetłumaczona na wysokość tego plotera.
pt: A altura da tela será convertida para a altura deste plotter.
ru: Высота холста будет переведена на эту высоту плоттера.
tr: Tuval yüksekliği bu çizici yüksekliğine çevrilecektir.
zh_cn: 画布高度将转换为绘图仪高度。

# NudSizeX.ToolTip
source: Canvas width will be translated to this plotter width.
ar: سيتم تحويل عرض اللوحة القماشية إلى عرض الراسمة هذا.
cs: Šířka plátna bude převedena na tuto šířku plotru.
de_de: Die Leinwandbreite wird auf diese Plotterbreite umgerechnet.
es: El ancho del lienzo se traducirá a la anchura de este plotter.
fr: La largeur de la zone de dessin sera convertie à cette largeur du traceur.
it: La larghezza della tela verrà tradotta in base all'altezza del plotter.
ja: キャンバスの幅はこのプロッタの幅に変換されます。
pl: Szerokość płótna zostanie przetłumaczona na szerokość tego plotera.
pt: A largura da tela será convertida para a largura deste plotter.
ru: Ширина холста будет переведена на эту ширину плоттера.
tr: Tuval genişliği bu çizici genişliğine çevrilecektir.
zh_cn: 画布宽度将转换为绘图仪宽度。

# tBflowControl.ToolTip
source: Assign regular GCode, seperate code into different lines using ';' as seperator. Or assign a filename containing GCode.
ar: عيّن GCode عاديًا، وافصل الكود إلى أسطر مختلفة باستخدام ; كفاصل. أو عيّن اسم ملف يحتوي على GCode.
cs: Přiřaďte běžný G-kód, oddělte kód na různé řádky pomocí znaku ';' jako oddělovače. Nebo přiřaďte název souboru obsahující G-kód.
de_de: Weisen Sie regulären GCode zu, trennen Sie den Code in verschiedene Zeilen und verwenden Sie dabei „;“ als Trennzeichen. Oder weisen Sie einen Dateinamen zu, der GCode enthält.
es: Asigna un GCode normal y separa el código en diferentes líneas usando ';' como separador. O bien, asigna un nombre de archivo que contenga GCode.
fr: Attribuez un GCode standard, séparez le code en différentes lignes à l'aide du séparateur « ; ». Ou attribuez un nom de fichier contenant du GCode.
it: Assegna un GCode normale, separando il codice in righe diverse usando ';' come separatore. Oppure assegna un nome file contenente il GCode.
ja: 通常の GCode を割り当てる場合は、区切り文字として ';' を使用してコードを複数の行に分割します。 または、GCode を含むファイル名を割り当てます。
pl: Przypisz zwykły GCode, rozdziel kod na różne linie używając ';' jako separatora. Lub przypisz nazwę pliku zawierającą GCode.
pt: Atribua um GCode comum, separe o código em linhas diferentes usando ';' como separador. Ou atribua um nome de arquivo contendo GCode.
ru: Назначьте обычный GCode, разделите код на разные строки, используя ';' в качестве разделителя. Или назначьте имя файла, содержащее GCode.
tr: Düzenli GCode atayın, kodu ayırıcı olarak ';' kullanarak farklı satırlara ayırın. Ya da GCode içeren bir dosya adı atayın.
zh_cn: 指定常规 GCode，使用“;”作为分隔符将代码分成不同的行。 或者指定包含 GCode 的文件名。

# cBToolChange.Text
source: Perform tool change on Tx M06
ar: تغيير الأداة في Tx M06
cs: Provést výměnu nástroje na příkazech Tx M06
de_de: Werkzeugwechsel an Tx M06 durchführen
es: Realizar cambio de herramienta en Tx M06
fr: Exécuter un changement d'outil sur la Tx M06
it: Esegui cambio utensile su Tx M06
ja: Tx M06 で工具交換を実行
pl: Wykonaj zmianę narzędzia w Tx M06
pt: Realizar troca de ferramenta no Tx M06
ru: Выполнить смену инструмента на Tx M06
tr: Tx M06'da araç değişikliği gerçekleştir
zh_cn: 在 Tx M06 上执行换刀

# cBToolChange.ToolTip
source: Execute following scripts on Tx M06 commands
ar: نفذ البرامج النصية التالية على أوامر Tx M06
cs: Spusťte následující skripty na příkazech Tx M06
de_de: Folgende Skripte für Tx M06-Befehle ausführen
es: Ejecutar los siguientes scripts en los comandos Tx M06
fr: Exécuter les scripts suivants sur les commandes Tx M06
it: Esegui i seguenti script sui comandi Tx M06
ja: Tx M06 コマンドで以下のスクリプトを実行
pl: Wykonaj następujące skrypty w poleceniach Tx M06
pt: Executar os seguintes scripts nos comandos do Tx M06
ru: Выполнить следующие скрипты на командах Tx M06
tr: Tx M06 komutlarında aşağıdaki komut dosyalarını yürüt
zh_cn: 在 Tx M06 命令上执行以下脚本

# cBImportGCToolM0.Text
source: Add Pause (M0) instead
ar: أضف إيقافًا مؤقتًا (M0) بدلاً من ذلك
cs: Přidat místo toho Pauza (M0)
de_de: Pause (M0) hinzufügen
es: Añadir Pausa (M0)
fr: Ajouter Pause (M0) à la place
it: Aggiungi Pausa (M0)
ja: 代わりに Pause (M0) を追加
pl: Zamiast tego dodaj Pauzę (M0)
pt: Adicionar Pausa (M0)
ru: Добавить вместо этого паузу (M0)
tr: Bunun yerine Duraklatma (M0) ekle
zh_cn: 添加暂停 (M0)

# cBImportGCToolM0.ToolTip
source: Replace any M06 (tool change) command by M0 (pause) for manual tool change.
ar: استبدل أي أمر M06 (تغيير أداة) بأمر M0 (إيقاف مؤقت) لتغيير الأداة يدويًا.
cs: Nahraďte jakýkoli příkaz M06 (výměna nástroje) příkazem M0 (pauza) pro ruční výměnu nástroje.
de_de: M06-Befehle (Werkzeugwechsel) durch M0 (Pause) für manuellen Werkzeugwechsel ersetzen.
es: Reemplazar cualquier comando M06 (cambio de herramienta) por M0 (pausa) para el cambio manual de herramienta.
fr: Remplacer toute commande M06 (changement d'outil) par M0 (pause) pour un changement d'outil manuel.
it: Sostituisci qualsiasi comando M06 (cambio utensile) con M0 (pausa) per il cambio utensile manuale.
ja: 手動工具交換の場合は、M06 (工具交換) コマンドを M0 (一時停止) に置き換えます。
pl: Zastąp polecenie M06 (zmiana narzędzia) poleceniem M0 (pauza) w celu ręcznej zmiany narzędzia.
pt: Substituir qualquer comando M06 (troca de ferramenta) por M0 (pausa) para troca manual de ferramenta.
ru: Заменить любую команду M06 (смена инструмента) на M0 (пауза) для ручной смены инструмента.
tr: Manuel araç değişikliği için herhangi bir M06 (araç değişikliği) komutunu M0 (duraklatma) ile değiştir.
zh_cn: 将任何 M06（换刀）命令替换为 M0（暂停）以进行手动换刀。

# cBImportGCTool.Text
source: Add Tool Change cmd Tx M06
ar: أضف أمر تغيير الأداة في Tx M06
cs: Přidat příkaz Výměna nástroje Tx M06
de_de: Werkzeugwechselbefehl Tx M06 hinzufügen
es: Añadir comando de cambio de herramienta Tx M06
fr: Ajouter une commande Changement d'outil Tx M06
it: Aggiungi comando Cambio utensile Tx M06
ja: Tx M06 に工具交換コマンドを追加
pl: Dodaj polecenie zmiany narzędzia Tx M06
pt: Adicionar comando de Troca de Ferramenta no Tx M06
ru: Добавить команду смены инструмента Tx M06
tr: Araç Değişikliği cmd'si Tx M06 ekle
zh_cn: 添加换刀命令 Tx M06

# cBImportGCTool.ToolTip
source: Perform tool change action on Tx M06 commands if information is available - check tab 'Tool change'.
ar: نفذ إجراء تغيير الأداة على أوامر Tx M06 إذا توفرت معلومات - حدد علامة التبويب "تغيير الأداة".
cs: Provést akci výměny nástroje na příkazech Tx M06, pokud jsou informace k dispozici - zaškrtněte záložku 'Výměna nástroje'.
de_de: Werkzeugwechselaktion für Tx M06-Befehle ausführen, falls Informationen verfügbar sind – siehe Registerkarte „Werkzeugwechsel“.
es: Realizar la acción de cambio de herramienta en los comandos Tx M06 si hay información disponible; consultar la pestaña "Cambio de herramienta".
fr: Exécuter un changement d'outil sur les commandes Tx M06 si les informations sont disponibles ; consulter l'onglet « Changement d'outil ».
it: Esegui l'azione di cambio utensile sui comandi Tx M06 se le informazioni sono disponibili - seleziona la scheda "Cambio utensile".
ja: 情報が利用可能な場合、Tx M06 コマンドで工具交換アクションを実行します - 「工具交換」タブを確認してください。
pl: Wykonaj akcję zmiany narzędzia w poleceniach Tx M06, jeśli informacje są dostępne — sprawdź kartę „Zmiana narzędzia”.
pt: Executar ação de troca de ferramenta nos comandos do Tx M06 se houver informações disponíveis - verifique a aba "Troca de Ferramenta".
ru: Выполнить действие смены инструмента на командах Tx M06, если информация доступна - проверьте вкладку «Смена инструмента».
tr: Bilgi mevcutsa Tx M06 komutlarında araç değişikliği eylemi gerçekleştir - 'Araç değişikliği' sekmesini kontrol et.
zh_cn: 如果有可用信息，则在 Tx M06 命令上执行换刀操作 - 检查“换刀”选项卡。

# GbMode.Text
source: Edit mode
ar: وضع التحرير
cs: Režim úprav
de_de: Bearbeitungsmodus
es: Modo de edición
fr: Mode Édition
it: Modalità di modifica
ja: 編集モード
pl: Tryb edycji
pt: Modo de Edição
ru: Режим редактирования
tr: Düzenleme modu
zh_cn: 编辑模式

# CbUpdate.Text
source: Update 2D view on pen up
ar: تحديث العرض ثنائي الأبعاد
cs: Aktualizovat 2D pohled
de_de: 2D-Ansicht aktualisieren
es: Actualizar vista 2D
fr: Mettre à jour la vue 2D
it: Aggiorna vista 2D
ja: 2D ビューを更新
pl: Aktualizuj widok 2D
pt: Atualizar vista 2D
ru: Обновить 2D-вид
tr: 2B görünümü güncelle
zh_cn: 更新 2D 视图

# GbPlotter.Text
source: Plotter live update
ar: تحديث مباشر للمخطط
cs: Živá aktualizace plotru
es: Actualización en vivo del trazador
fr: Mise à jour en direct du traceur
it: Aggiornamento in tempo reale del plotter
ja: プロッターのライブアップデート
pl: Aktualizacja plotera na żywo
pt: Atualização ao vivo do plotter
ru: Обновление плоттера в реальном времени
tr: Plotter canlı güncellemesi
zh_cn: 绘图仪实时更新

# label4.Text
source: Max stroke width
ar: الأعلى. عرض السكتة الدماغية
cs: Max. šířka tahu
de_de: Max. Strichbreite
es: Máx. ancho de trazo
fr: Max. largeur de trait
it: Massimo. larghezza del tratto
ja: 最大。ストローク幅
pl: Maks. szerokość obrysu
pt: Máx. largura do traço
ru: Макс. ширина штриха
tr: Maks. kontur genişliği
zh_cn: 最大限度。笔划宽度

# label3.Text
source: Y / Height
ar: Y / الارتفاع
cs: Y / Výška
de_de: Y / Höhe
es: Y / Altura
fr: Y / Hauteur
it: Y / Altezza
ja: Y / 高さ
pl: Y/Wysokość
pt: Y/Altura
ru: Y / Высота
tr: Y / Yükseklik
zh_cn: Y / 高度

# label2.Text
source: X / Width
ar: X / العرض
cs: X / Šířka
de_de: X / Breite
es: X / Ancho
fr: X / Largeur
it: X / Larghezza
ja: X / 幅
pl: X/Szerokość
pt: X/Largura
ru: X / Ширина
tr: X / Genişlik
zh_cn: X / 宽度

# label1.Text
source: The visible pen width depends on the selected plotter working size
ar: يعتمد عرض القلم المرئي على حجم الرسم التخطيطي المحدد
cs: Viditelná šířka pera závisí na zvolené pracovní velikosti plotru.
de_de: Die sichtbare Stiftbreite hängt von der gewählten Plotter-Arbeitsgröße ab
es: El ancho visible de la pluma depende del tamaño de trabajo del plotter seleccionado.
fr: La largeur visible du stylo dépend de la taille de travail du traceur sélectionné
it: La larghezza della penna visibile dipende dalla dimensione di lavoro del plotter selezionato
ja: 表示されるペン幅は、選択したプロッタの作業サイズによって異なります。
pl: Widoczna szerokość pisaka zależy od wybranego rozmiaru roboczego plotera
pt: A largura da caneta visível depende do tamanho de trabalho do plotter selecionado
ru: Видимая ширина пера зависит от выбранного рабочего размера плоттера.
tr: Görünür kalem genişliği, seçilen çizicinin çalışma boyutuna bağlıdır
zh_cn: 可见笔的宽度取决于所选的绘图仪工作尺寸

# CbTransparency.Text
source: Show transparency
ar: إظهار الشفافية
cs: Zobrazit průhlednost
de_de: Transparenz anzeigen
es: Mostrar transparencia
fr: Afficher la transparence
it: Mostra trasparenza
ja: 透明度を表示
pl: Pokaż przezroczystość
pt: Mostrar transparência
ru: Показать прозрачность
tr: Şeffaflığı göster
zh_cn: 显示透明度

# LblToolTable.Text
source: Load tool table
ar: تحميل جدول الأدوات
cs: Načíst tabulku nástrojů
de_de: Werkzeugtabelle laden
es: Cargar tabla de herramientas
fr: Charger la table d'outils
it: Carica tabella utensili
ja: ツールテーブルを読み込む
pl: Załaduj tabelę narzędzi
pt: Carregar tabela de ferramentas
ru: Загрузить таблицу инструментов
tr: Alet tablosunu yükle
zh_cn: 加载工具表

# GbToolChange.Text
source: From Setup form
ar: من نموذج الإعداد
cs: Z formuláře nastavení
de_de: Aus dem Setup-Formular
es: Desde el formulario de configuración
fr: Depuis le formulaire de configuration
it: Dal modulo di configurazione
ja: セットアップフォームから
pl: Z formularza konfiguracji
pt: Do formulário de configuração
ru: Из ​​формы настройки
tr: Kurulum formundan
zh_cn: 从设置表单

# cBflowControl.Text
source: Send gcode on pause
ar: إرسال رمز Gcode عند الإيقاف المؤقت
cs: Odeslat G-code při pozastavení
de_de: G-Code bei Pause senden
es: Enviar código G al pausar
fr: Envoyer le Gcode en pause
it: Invia gcode in pausa
ja: 一時停止時にGコードを送信
pl: Wyślij kod G po wstrzymaniu
pt: Enviar gcode ao pausar
ru: Отправить gcode на паузе
tr: Duraklatıldığında gcode gönder
zh_cn: 暂停时发送 G 代码

# BtnOpenSetup.Text
source: Open setup form
ar: فتح نموذج الإعداد
cs: Otevřít formulář nastavení
de_de: Setup-Formular öffnen
es: Abrir formulario de configuración
fr: Ouvrir le formulaire de configuration
it: Apri modulo di configurazione
ja: セットアップフォームを開く
pl: Otwórz formularz konfiguracji
pt: Abrir formulário de configuração
ru: Открыть форму настройки
tr: Kurulum formunu aç
zh_cn: 打开设置表单

# CboxToolFiles.Text
source: Last loaded tool table
ar: آخر جدول أدوات تم تحميله
cs: Naposledy načtená tabulka nástrojů
de_de: Zuletzt geladene Werkzeugtabelle
es: Última tabla de herramientas cargada
fr: Dernier tableau d'outils chargé
it: Ultima tabella utensili caricata
ja: 最後に読み込んだツールテーブル
pl: Ostatnio załadowana tabela narzędzi
pt: Última tabela de ferramentas carregada
ru: Последняя загруженная таблица инструментов
tr: Son yüklenen araç tablosu
zh_cn: 上次加载的工具表

# label5.Text
source: Selected color
ar: اللون المحدد
cs: Vybraná barva
de_de: Ausgewählte Farbe
es: Color seleccionado
fr: Couleur sélectionnée
it: Colore selezionato
ja: 選択した色
pl: Wybrany kolor
pt: Cor selecionada
ru: Выбранный цвет
tr: Seçili renk
zh_cn: 选定的颜色

# saveToolStripMenuItem.Text
source: Save
ar: حفظ
cs: Uložit
de_de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
pl: Zapisz
pt: Salvar
ru: Сохранить
tr: Kaydet
zh_cn: 保存

# RbMode0.Text
source: Draw
ar: رسم.
cs: Kreslení.
de_de: Zeichnen
es: Dibujar
fr: Dessiner.
it: Disegna
ja: 描画
pl: Narysuj
pt: Desenhar
ru: Нарисовать
tr: Çiz
zh_cn: 绘制

# RbMode1.Text
source: Select
ar: تحديد.
cs: Vybrat.
de_de: Auswählen
es: Seleccionar
fr: Sélectionner.
it: Seleziona
ja: 選択
pl: Wybierz
pt: Selecionar
ru: Выбрать
tr: Seç
zh_cn: 选择

# RbMode2.Text
source: Delete point
ar: حذف نقطة.
cs: Smazat bod.
de_de: Punkt löschen
es: Eliminar punto
fr: Supprimer un point.
it: Elimina punto
ja: 点を削除
pl: Usuń punkt
pt: Excluir ponto
ru: Удалить точку
tr: Noktayı sil
zh_cn: 删除点

# RbMode3.Text
source: Delete stroke
ar: حذف الخط
cs: Vymazat tah
de_de: Strich löschen
es: Eliminar trazo
fr: Supprimer le trait
it: Elimina tratto
ja: ストロークの削除
pl: Usuń obrys
pt: Excluir traço
ru: Удалить штрих
tr: İndirmeyi sil
zh_cn: 删除笔触

# $this.Text
source: Graphics tablet
ar: قرص الرسومات
cs: Grafický tablet
de_de: Grafiktablett
es: tableta gráfica
fr: Tablette graphique
it: Tavoletta grafica
ja: グラフィックタブレット
pl: Tablet graficzny
pt: Mesa digitalizadora
ru: Графический планшет
tr: Grafik tableti
zh_cn: 绘图板

# BtnHelp.ToolTip
source: Online help
ar: مساعدة عبر الإنترنت
cs: Online nápověda
de_de: Online-Hilfe
es: Ayuda en línea
fr: Aide en ligne
it: Aiuto online
ja: オンラインヘルプ
pl: Pomoc online
pt: Ajuda online
ru: Онлайн-помощь
tr: Çevrimiçi yardım
zh_cn: 在线帮助

# CboxPapersize.Text
source: Preset working size
ar: اختر الحجم القياسي
cs: Vyberte standardní velikost
de_de: Wähle ein Standardmaß
es: Elige un tamaño estándar
fr: Choisissez une taille standard
it: Scegli una taglia standard
ja: 標準サイズを選択してください
pl: Wybierz standardowy rozmiar
pt: Escolha um tamanho padrão
ru: Выберите стандартный размер
tr: Standart bir boyut seçin
zh_cn: 选择标准尺寸

# CboxPapersize.ToolTip
source: Units will be converted to mm
ar: سيتم تحويل الوحدات إلى مليمتر
cs: Jednotky budou převedeny na mm
de_de: Einheiten werden in mm umgerechnet
es: Las unidades se convertirán a mm
fr: Les unités seront converties en mm
it: Le unità verranno convertite in mm
ja: 単位はmmに変換されます
pl: Jednostki zostaną przeliczone na mm
pt: As unidades serão convertidas para mm
ru: Единицы будут преобразованы в мм
tr: Birimler mm'ye dönüştürülecek
zh_cn: 单位将转换为毫米

# CbUpdate.ToolTip
source: Update 2D view after pen-up
ar: منظر ثنائي الأبعاد بعد رفع القلم
cs: 2D pohled po zvednutí pera
de_de: 2D-Ansicht nach dem stift anheben
es: Vista 2D después de levantar el bolígrafo
fr: Vue 2D après avoir levé le stylo
it: Vista 2D dopo aver sollevato la penna
ja: ペンを持ち上げた後の2Dビュー
pl: ペンを持ち上げた後の2Dビュー
pt: Visão 2D após levantar a caneta
ru: 2D-вид после поднятия ручки
tr: Kalemi kaldırdıktan sonra 2D görünüm
zh_cn: 提笔后更新二维视图

# RbMode3.ToolTip
source: Click on a line to delete it
ar: انقر على خط لحذفه.
cs: Kliknutím na čáru ji smažete.
de_de: Klicken Sie auf eine Linie, um sie zu löschen.
es: Haz clic en una línea para eliminarla
fr: Cliquez sur une ligne pour la supprimer.
it: Fai clic su una linea per eliminarla
ja: 線をクリックして削除します。
pl: Kliknij linię, aby ją usunąć
pt: Clique em uma linha para excluí-la
ru: Нажмите на линию, чтобы удалить ее
tr: Bir çizgiyi silmek için üzerine tıklayın
zh_cn: 点击一条线即可删除它

# RbMode2.ToolTip
source: Click on to a specific point of a line to delete it
ar: انقر على نقطة محددة من خط لحذفها.
cs: Kliknutím na konkrétní bod čáry ji smažete.
de_de: Klicke auf einen bestimmten Punkt einer Linie, um ihn zu löschen.
es: Haz clic en un punto específico de una línea para eliminarlo
fr: Cliquez sur un point spécifique d'une ligne pour le supprimer.
it: Fai clic su un punto specifico di una linea per eliminarla
ja: 線上の特定の点をクリックして削除します。
pl: Kliknij określony punkt linii, aby go usunąć
pt: Clique em um ponto específico de uma linha para excluí-la
ru: Нажмите на определенную точку линии, чтобы удалить ее
tr: Bir çizgiyi silmek için belirli bir noktaya tıklayın
zh_cn: 点击线上的某个点即可删除它

# CbFitToCurve.Text
source: Fit to curve
ar: ملاءمة المنحنى.
cs: Přizpůsobit křivce.
de_de: An Kurve anpassen
es: Ajustar a la curva
fr: Ajuster à la courbe.
it: Adatta alla curva
ja: 曲線にフィット
pl: Dopasuj do krzywej
pt: Ajustar à curva
ru: Подогнать под кривую
tr: Eğriye uydur
zh_cn: 拟合曲线

# CbFitToCurve.ToolTip
source: After completing a line, it is smoothed.
ar: بعد إكمال الخط، يتم تنعيمه.
cs: Po dokončení čáry se vyhladí.
de_de: Nach Fertigstellung einer Linie wird diese geglättet.
es: Después de completar una línea, se suaviza.
fr: Une fois la ligne terminée, elle est lissée.
it: Dopo aver completato una linea, questa viene smussata.
ja: 線が完成すると、滑らかになります。
pl: Po zakończeniu linii jest ona wygładzana.
pt: Após completar uma linha, ela é suavizada.
ru: После завершения линии она сглаживается.
tr: Bir çizgi tamamlandıktan sonra yumuşatılır.
zh_cn: 完成一条线后，它会被平滑处理。

# RbMode1.ToolTip
source: Select a line by clicking on it or some lines by surround them for moving, scaling or deleting.
ar: حدد خطًا بالنقر عليه، أو حدد بعض الخطوط بإحاطتها للتحريك أو تغيير الحجم أو الحذف.
cs: Vybrat čáru kliknutím na ni nebo čáry obklopením pro přesun, změnu měřítka nebo smazání.
de_de: Wähle eine Linie durch Anklicken oder mehrere Linien durch Umranden aus, um sie zu verschieben, zu skalieren oder zu löschen.
es: Selecciona una línea haciendo clic en ella o varias líneas rodeándolas para moverlas, escalarlas o eliminarlas.
fr: Sélectionnez une ligne en cliquant dessus ou plusieurs lignes en les entourant pour les déplacer, les redimensionner ou les supprimer.
it: Seleziona una linea facendo clic su di essa o più linee circondandole per spostarle, ridimensionarle o eliminarle.
ja: 線をクリックするか、複数の線を囲んで選択し、移動、拡大縮小、削除します。
pl: Wybierz linię, klikając ją, lub niektóre linie, otaczając je, aby je przesunąć, skalować lub usunąć.
pt: Selecione uma linha clicando nela ou em algumas linhas, circundando-as para movê-las, redimensioná-las ou excluí-las.
ru: Выберите линию, щелкнув по ней, или несколько линий, окружив их для перемещения, масштабирования или удаления.
tr: Üzerine tıklayarak bir çizgiyi veya hareket ettirmek, ölçeklemek veya silmek için çevreleyerek bazı çizgileri seçin.
zh_cn: 点击一条线即可选择它，或者通过包围多条线来选择它们，以便移动、缩放或删除。

# RbMode0.ToolTip
source: Draw lines with the selected color.
ar: ارسم خطوطًا باللون المحدد.
cs: Kreslení čar vybranou barvou.
de_de: Zeichne Linien mit der ausgewählten Farbe.
es: Dibuja líneas con el color seleccionado.
fr: Dessiner des lignes avec la couleur sélectionnée.
it: Disegna linee con il colore selezionato.
ja: 選択した色で線を描画します。
pl: Rysuj linie wybranym kolorem.
pt: Desenhe linhas com a cor selecionada.
ru: Нарисовать линии выбранным цветом.
tr: Seçilen renkle çizgiler çizin.
zh_cn: 使用选定的颜色绘制线条。
