Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromShape.*.resx
Languages: cs, it, ja, pl, ru, tr

# cBNoZUp.Text
source: Avoid Z-up
cs: Vyhněte se Z-up
it: Evita Z-up
ja: Zアップを避ける
pl: Nie unoś Z
tr: Z-up'tan kaçının

# cBNoZUp.ToolTip
source: Do not raise Z to a safe height after each pass
it: Non sollevare Z ad un'altezza di sicurezza dopo ogni passaggio
pl: Nie unoś Z na bezpieczną wysokość po każdym przejściu.
tr: Her geçişten sonra Z'yi güvenli bir yüksekliğe yükseltmeyin

# label1.Text
source: Tool:
cs: Nástroj:
it: Attrezzo:
ja: ツール：
pl: Narz.:
tr: Alet:

# cBToolSet.Text
source: Get values from tool table
cs: Získejte hodnoty z tabulky nástrojů
it: Ottieni valori dalla tabella degli strumenti
ja: ツールテーブルから値を取得する
pl: Pobierz wartości z tabeli narzędzi
ru: Соединяйте буквы (только хершей)
tr: Alet tablosundan değerleri al

# nUDToolOverlap.ToolTip
source: Distance between two paths (when doing a pocket) as tool diameter. 100% = tool diameter step width.
cs: Vzdálenost mezi dvěma dráhami (při vytváření kapsy) jako průměr nástroje. 100 % = šířka kroku průměru nástroje.
it: Distanza tra due percorsi (quando si esegue una tasca) come diametro dell'utensile. 100% = larghezza del passo del diametro dell'utensile.
ja: ツールの直径としての2つのパス間の距離（ポケットを行うとき）。 100％=ツール直径のステップ幅。
pl: Odległość pomiędzy dwoma ścieżkami (przy wykonywaniu kieszeni) jako średnica narzędzia. 100% = szerokość kroku średnicy narzędzia.
ru: В слове соедините последнюю точку буквы с первой точкой следующей буквы
tr: Takım çapı olarak iki yol arasındaki mesafe (bir cep yaparken). %100 = takım çapı adım genişliği.

# label16.Text
source: Overlap %
cs: Překrytí %
it: % di sovrapposizione
ja: 重複率
pl: Pokrycie %
ru: перекрытие
tr: Örtüşmek %

# label16.ToolTip
source: Distance between two paths (when doing a pocket) as tool diameter. 100% = tool diameter step width.
cs: Vzdálenost mezi dvěma dráhami (při vytváření kapsy) jako průměr nástroje. 100 % = šířka kroku průměru nástroje.
it: Distanza tra due percorsi (quando si esegue una tasca) come diametro dell'utensile. 100% = larghezza del passo del diametro dell'utensile.
ja: ツールの直径としての2つのパス間の距離（ポケットを行うとき）。 100％=ツール直径のステップ幅。
pl: Odległość między dwoma ścieżkami (przy wykonywaniu kieszeni) jako średnica narzędzia. 100% = szerokość kroku średnicy narzędzia.
ru: Расстояние между двумя путями (при выполнении кармана) как диаметр инструмента. 100% = диаметр шага инструмента.
tr: Takım çapı olarak iki yol arasındaki mesafe (bir cep yaparken). %100 = takım çapı adım genişliği.

# nUDToolSpindleSpeed.ToolTip
source: Spindle speed
cs: Rychlost vřetena
it: Velocità del mandrino
ja: 主軸速度
pl: Prędkość obrotowa wrzeciona
tr: Mil hızı

# nUDToolFeedZ.ToolTip
source: Feed rate for Z
cs: Rychlost posuvu pro Z
it: Velocità di avanzamento per Z
ja: Zの送り速度
pl: Prędkość posuwu w kierunku Z
ru: Скорость подачи для направления Z
tr: Z için besleme hızı

# label14.Text
source: Feed-Z
pl: Posuw Z
tr: Besleme-Z

# nUDToolFeedXY.ToolTip
source: Feed rate for XY direction
cs: Rychlost posuvu pro směr XY
it: Avanzamento per direzione XY
ja: XY方向の送り速度
pl: Prędkość posuwu w kierunku XY
ru: Скорость подачи для направления XY
tr: XY yönü için ilerleme hızı

# label10.Text
source: Feed-XY
cs: Krmivo-XY
pl: Posuw XY
tr: Besleme-XY

# nUDToolZStep.ToolTip
source: Depth per pass (not final depth)
cs: Hloubka na průchod (ne konečná hloubka)
it: Profondità per passata (non profondità finale)
ja: パスごとの深さ（最終的な深さではありません）
pl: Głębokość na jeden przejazd (nie głębokość końcowa)
ru: Глубина за проход (не конечная глубина)
tr: Geçiş başına derinlik (nihai derinlik değil)

# nUDToolDiameter.ToolTip
source: Tool diameter to calculate offset path offset
cs: Průměr nástroje pro výpočet offsetu dráhy offsetu
it: Diametro utensile per calcolare l'offset del percorso di offset
ja: オフセットパスオフセットを計算するツール直径
pl: Średnica narzędzia do obliczenia przesunięcia ścieżki
ru: Диаметр инструмента (резец, лазер, ручка) для расчета смещения траектории
tr: Ofset yolu ofsetini hesaplamak için takım çapı

# label3.Text
source: Diameter
cs: Průměr
it: Diametro
ja: 直径
pl: Średnica
ru: Диаметр
tr: Çap

# groupBox1.Text
source: Tool
cs: Nástroj
it: Attrezzo
ja: ツール
pl: Narzędzie
ru: инструмент
tr: Alet

# label19.Text
source: Y-Dimension
cs: Rozměr Y
it: Dimensione Y
ja: Y寸法
pl: Rozmiar Y
ru: Измерение Y
tr: Y-Boyutu

# cBToolpathPocket.Text
source: Create Pocket
cs: Vytvořte kapsu
it: Crea tasca
ja: ポケットを作成
pl: Utwórz kieszeń
ru: Создать карман
tr: Cep Oluştur

# label18.Text
source: X-Dimension
cs: Rozměr X
it: Dimensione X
ja: X次元
pl: Rozmiar X
ru: Измерение X
tr: X-Boyutu

# label17.Text
source: Radius
cs: Poloměr
it: Raggio
ja: 半径
pl: Promień
ru: Радиус
tr: yarıçap

# rBShape2.Text
source: Rectangle round edge
cs: Obdélníkový kulatý okraj
it: Bordo tondo rettangolare
ja: 長方形の丸い縁
pl: Zaokrąglenie krawędzi prostokąta
ru: Прямоугольник вокруг края
tr: Dikdörtgen yuvarlak kenar

# rBShape1.Text
source: Rectangle
cs: Obdélník
it: Rettangolo
ja: 長方形
pl: Prostokąt
ru: Прямоугольник
tr: Dikdörtgen

# rBShape3.Text
source: Circle
cs: Kruh
it: Cerchio
ja: サークル
pl: Okrąg
ru: Круг
tr: Daire

# groupBox2.Text
source: Shape
cs: Tvar
it: Forma
ja: 形状
pl: Kształt
ru: форма
tr: Şekil

# nUDImportGCZDown.ToolTip
source: Final deepth of the shape
cs: Konečná hloubka tvaru
it: Profondità finale della forma
ja: 形状の最終的な深さ
pl: Finalna głębokość kształtu
ru: Конечная глубина формы
tr: Şeklin son derinliği

# label20.Text
source: Depth (Z)
cs: Hloubka (Z)
it: Profondità (Z)
ja: 深さ（Z）
pl: Głębokość (Z)
ru: Глубина (Z)
tr: Derinlik (Z)

# rBToolpath2.Text
source: Outside the shape
cs: Mimo tvar
it: Fuori la forma
ja: 形状の外側
pl: Na zewnątrz ksztatu
ru: Вне формы
tr: şeklin dışında

# rBToolpath3.Text
source: Inside the shape
cs: Uvnitř tvaru
it: Dentro la forma
ja: 形の中
pl: Wewnątrz kształtu
ru: Внутри формы
tr: şeklin içinde

# rBToolpath1.Text
source: On the shape (engraving)
cs: Na tvaru (rytí)
it: Sulla forma (incisione)
ja: 形の上（彫刻）
pl: Wenątrz kształtu (grawerowanie)
ru: На форме (гравировка)
tr: Şekil üzerinde (gravür)

# groupBox3.Text
source: Toolpath
cs: Dráha nástroje
it: Percorso utensile
ja: ツールパス
pl: Ścieżka narzędzia
tr: takım yolu

# btnApply.Text
source: Create G-Code
cs: Vytvořte G-Code
it: Crea codice G
ja: Gコードを作成
pl: Utwórz G-Code
ru: Создать G-Code
tr: G Kodu Oluştur

# groupBox5.Text
source: Origin
cs: Původ
it: Origine
ja: 起源
pl: Punkt zero
ru: происхождения
tr: Menşei

# btnCancel.Text
source: Close
cs: Zavřít
it: Chiudere
ja: 閉じる
pl: Zamknięty
ru: близко
tr: Kapalı

# nUDRZRadius.ToolTip
source: Radius in Z direction
cs: Poloměr ve směru Z
it: Raggio in direzione Z
ja: Z方向の半径
pl: Promień w kierunku Z
ru: Радиус в направлении Z
tr: Z yönündeki yarıçap

# nUDRZWidth.ToolTip
source: Width of the round off
cs: Šířka zaoblení
it: Larghezza dell'arrotondamento
ja: 四捨五入の幅
pl: Szerokość zaokrąglenia
ru: Ширина закругления
tr: Yuvarlama genişliği

# nUDRZStep.ToolTip
source: Max. allowed deviation to a 1/4 circle in units
cs: Max. povolená odchylka na 1/4 kruhu v jednotkách
it: Massimo deviazione consentita a 1/4 di cerchio in unità
ja: 最大単位で1/4円への偏差を許可
pl: Maks. dopuszczalne odchylenie do 1/4 koła w jednostkach
ru: Максимум. допустимое отклонение до 1/4 круга в единицах
tr: Maks. birimlerde 1/4 daireye izin verilen sapma

# BtnAddShape.Text
source: Save as
it: Salva come
pl: Zapisz jako
tr: Farklı kaydet

# BtnAddShape.ToolTip
source: Save settings with name below
it: Salva le impostazioni con il nome qui sotto
pl: Zapisz ustawienia z poniżaszą nazwą
tr: Ayarları aşağıdaki adla kaydedin

# TbShapeName.ToolTip
source: Text for
it: Testo per
pl: Tekst dla
tr: Şunun için metin yaz:

# BtnApplyShape.Text
source: Apply
it: Fare domanda a
pl: Zastosuj
tr: Uygula

# BtnApplyShape.ToolTip
source: Apply settings of selected shape
it: Applica le impostazioni della forma selezionata
pl: Zastosuj ustawienia zaznaczonego kształtu
tr: Seçilen şeklin ayarlarını uygula

# BtnDeleteShape.Text
source: Delete
it: Eliminare
pl: Usuń
tr: Silmek

# BtnDeleteShape.ToolTip
source: Delete selected shape
it: Elimina la forma selezionata
pl: Usuń wybrany kształt
tr: Seçili şekli sil

# CbShapeSelection.Text
source: last used
pl: Ostatnio użyte

# groupBox10.Text
source: Load shape settings
it: Carica le impostazioni della forma
pl: Wczytaj ustawienia
tr: Şekil ayarlarını yükle

# groupBox9.Text
source: Save shape settings
it: Salva le impostazioni della forma
pl: Zapisz ustawienia
tr: Şekil ayarlarını kaydet

# tabPage1.Text
source: Rectangle / Circle
cs: Obdélník / Kruh
it: Rettangolo / Cerchio
ja: 長方形/円
pl: Prostokąt / Koło
ru: Прямоугольник / Круг
tr: Dikdörtgen / Daire

# rBBevel1.Text
source: Round off
cs: Zaokrouhlit
it: Arrotondare
ja: 四捨五入
pl: Zaokrąglenie
ru: Округлять
tr: yuvarlak

# rBBevel2.Text
source: Bevel
cs: Úkos
it: smusso
ja: ベベル
pl: Faza
ru: Скос
tr: Eğim

# label2.Text
source: Radius / Distance
cs: Poloměr / Vzdálenost
it: Raggio / Distanza
ja: 半径/距離
pl: Promień / Odległość
ru: Радиус / Расстояние
tr: Yarıçap / Mesafe

# groupBox6.Text
source: Edge shape
cs: Tvar okraje
it: Forma del bordo
ja: エッジ形状
pl: Kształt krawędzi
ru: Форма края
tr: Kenar şekli

# tabPage2.Text
source: Bevel / Round off
cs: Zkosení / Zaoblení
it: Smusso / Arrotondamento
ja: ベベル/四捨五入
pl: Faza / Zaokrąglenie
ru: Скос / закругление
tr: Eğim / Yuvarlama

# label7.Text
source: Path calculation for cylindrical milling cutter
cs: Výpočet dráhy pro válcovou frézu
it: Calcolo del percorso per fresa cilindrica
ja: 円筒フライスの経路計算
pl: Obliczanie drogi dla frezu cylindrycznego
ru: Расчет траектории цилиндрической фрезы
tr: Silindirik freze bıçağı için yol hesaplaması

# rBRoundZYT.Text
source: Radius on Z-Y-top, width on X
cs: Poloměr nahoře Z-Y, šířka X
it: Raggio su Z-Y-top, larghezza su X
ja: Z-Y上部の半径、Xの幅
pl: Promień na Z-Y-góra, szerokość na X
ru: Радиус по Z-Y-вершине, ширина по X
tr: Yarıçap Z-Y-üstte, genişlik X'te

# rBRoundZYB.Text
source: Radius on Z-Y-bottom, width on X
cs: Poloměr na dně Z-Y, šířka na X
it: Raggio su Z-Y in basso, larghezza su X
ja: Z-Y底の半径、Xの幅
pl: Promień na Z-Y-dół, szerokość na X
ru: Радиус по Z-Y-снизу, ширина по X
tr: Z-Y-altta yarıçap, X'te genişlik

# rBRoundZXL.Text
source: Radius on Z-X-left, width on Y
cs: Poloměr na Z-X-vlevo, šířka na Y
it: Raggio su Z-X-sinistra, larghezza su Y
ja: Z-Xの半径-左、Yの幅
pl: Promień na Z-X-lewo, szerokość na Y
ru: Радиус по Z-X слева, ширина по Y
tr: Z-X-solda yarıçap, Y'de genişlik

# rBRoundZXR.Text
source: Radius on Z-X-right, width on Y
cs: Poloměr na Z-X-vpravo, šířka na Y
it: Raggio su Z-X-destra, larghezza su Y
ja: Z-Xの半径-右、Yの幅
pl: Promień na Z-X-prawo, szerokość na Y
ru: Радиус по Z-X-справа, ширина по Y
tr: Z-X-sağda yarıçap, Y'de genişlik

# groupBox8.Text
source: Round off position
cs: Zaokrouhlete pozici
it: Posizione di arrotondamento
ja: 四捨五入位置
pl: Pozycja zaokrąglenia
ru: Позиция округления
tr: Yuvarlama konumu

# label4.Text
source: Radius
cs: Poloměr
it: Raggio
ja: 半径
pl: Promień
ru: Радиус
tr: yarıçap

# label6.Text
source: Deviation
cs: Odchylka
it: Deviazione
ja: 偏差
pl: Odchylenie
ru: Отклонение
tr: Sapma

# label5.Text
source: Width
cs: Šířka
it: Larghezza
ja: 幅
pl: Szerokość
ru: Ширина
tr: Genişlik

# groupBox4.Text
source: Dimensions
cs: Rozměry
it: Dimensioni
ja: 寸法
pl: Wymiary
ru: Габаритные размеры
tr: boyutlar

# tabPage3.Text
source: Round off Z
cs: Zaokrouhlit Z
it: Arrotonda Z
ja: Zを四捨五入する
pl: Zaokrąglenie Z
ru: Закруглить Z
tr: Z'yi yuvarla

# groupBox7.Text
source: Depth
cs: Hloubka
it: Profondità
ja: 深さ
pl: Głębokość
ru: Глубина
tr: Derinlik

# cBMoveTo00.Text
source: Finally move to 0;0
cs: Nakonec přejděte na 0;0
it: Infine passa a 0;0
ja: 最後に0に移動します。 0
pl: Na koniec idź do 0;0
ru: Наконец перейдите к 0; 0
tr: Sonunda 0;0'a git

# CbInsertCode.Text
source: Insert shape into 2D-view (at position 0;0)
cs: Vložit tvar do 2D pohledu (na pozici 0;0)
it: Inserisci forma nella vista 2D (in posizione 0;0)
ja: 形状を2Dビューに挿入します（位置0; 0）
pl: Wstaw kształt do widoku 2D (w pozycji 0;0)
tr: 2B görünüme şekil ekle (0;0 konumunda)

# $this.Text
source: Create G-Code from Shapes
cs: Vytvořte G-kód z tvarů
it: Crea codice G da forme
ja: 図形からGコードを作成する
pl: Utwórz G-Code z kształtów
ru: Создать G-Code из фигур
tr: Şekillerden G Kodu Oluşturun

# label15.Text
source: Spindle-Spd
it: Mandrino-Spd
ja: スピンドル-Spd
tr: Mil-Spd
