Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromImage.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# CBoxPatternFiles.Text
source: Select example pattern
ar: حدد نموذجًا للنمط
cs: Vyberte vzorový vzor
es: Seleccionar patrón de ejemplo
fr: Sélectionnez un exemple de motif
it: Seleziona modello di esempio
pl: Wybierz przykładowy wzór
pt: Selecione padrão de exemplo
ru: Выберите пример шаблона
tr: Örnek desen seçin
zh_cn: 选择示例模式

# RbStartGrayS.Text
source: Gray value as Spindle speed (PWM)
ar: القيمة الرمادية كسرعة المغزل (PWM)
cs: Šedá hodnota jako otáčky vřetena (PWM)
es: Valor gris como velocidad del husillo (PWM)
fr: Valeur de gris comme vitesse de broche (PWM)
it: Valore grigio come velocità mandrino (PWM)
pl: Wartość szarości jako prędkość obrotowa wrzeciona (PWM)
pt: Valor cinza como velocidade do fuso (PWM)
ru: Значение серого как скорость шпинделя (ШИМ)
tr: İş mili hızı (PWM) olarak gri değer
zh_cn: 灰度值作为主轴转速（PWM）

# tabPageSize.Text
source: Size / Pattern
ar: الحجم / النمط
cs: Velikost / Vzor
es: Tamaño / Patrón
fr: Taille / Motif
it: Taglia/Modello
pl: Rozmiar / Wzór
pt: Tamanho / Padrão
ru: Размер/узор
tr: Boyut / Desen
zh_cn: 尺寸/图案

# GbToolEnable.Text
source: Deselect colors if not needed
ar: قم بإلغاء تحديد الألوان إذا لم تكن هناك حاجة إليها
cs: Zrušte výběr barev, pokud to není potřeba
es: Anule la selección de colores si no es necesario
fr: Désélectionnez les couleurs si vous n'en avez pas besoin
it: Deseleziona i colori se non necessario
pl: Odznacz kolory, jeśli nie są potrzebne
pt: Desmarque as cores se não for necessário
ru: Отмените выбор цветов, если они не нужны
tr: Gerekmiyorsa renklerin seçimini kaldırın
zh_cn: 如果不需要，请取消选择颜色

# NudEngravingAngle.ToolTip
source: Angle of the line pattern
cs: Úhel vzoru čáry
es: Ángulo del patrón de línea
pt: Ângulo do padrão de linha
ru: Угол линии рисунка
tr: Çizgi deseninin açısı

# button3.ToolTip
source: Online help
cs: Online podpora
es: Ayuda en linea
pt: Ajuda online
ru: Онлайн помощь
tr: Çevrimiçi yardım

# CbLaserOnly.Text
source: Use Laser
cs: Použijte laser
es: Usar láser
pt: Usar Laser
ru: Используйте лазер
tr: Lazer Kullan

# CbLaserOnly.ToolTip
source: For a laser, no Pen-up and -down code is needed, compared to pen, lifted by a servo.
cs: U laseru není potřeba žádný kód Pen-up a-down, ve srovnání s perem zvednutým servem.
es: Para un láser, no se necesita ningún código de lápiz hacia arriba y hacia abajo, en comparación con el lápiz, levantado por un servo.
pt: Para um laser, nenhum código de caneta para cima e para baixo é necessário, em comparação com a caneta levantada por um servo.
ru: Для лазера не требуется код подъема и опускания пера, в отличие от пера, поднимаемого сервоприводом.
tr: Lazer için, bir servo tarafından kaldırılan kalemle karşılaştırıldığında, Kalem yukarı ve aşağı koduna gerek yoktur.

# cBLaserModeOffEnd.ToolTip
source: Sets $32=0 at G-Code end
cs: Nastaví $32=0 na konci G-Code
es: Establece $32=0 al final del Código G
pt: Define $ 32 = 0 no final do código G
ru: Устанавливает $32=0 в конце G-кода
tr: G Kodunun sonunda $32=0 değerini ayarlar

# cBLaserModeOnStart.ToolTip
source: Sets $32=1 at G-Code start
cs: Nastaví $32=1 na začátku G-Code
es: Establece $32=1 al inicio del Código G
pt: Define $ 32 = 1 no início do código G
ru: Устанавливает $32=1 при запуске G-кода.
tr: G Kodu başlangıcında $32=1 değerini ayarlar

# CbEngravingCross.Text
source: Cross (add lines +90°)
cs: Kříž (přidat čáry +90°)
es: Cruz (añadir líneas +90°)
pt: Cruzar (adicionar linhas +90°)
ru: Крест (добавьте линии +90°)
tr: Çapraz (+90° çizgi ekle)

# CbEngravingCross.ToolTip
source: If checked a 2nd line pattern, turned by 90 degrees will be added
cs: Pokud je zaškrtnuto, bude přidán vzor 2. čáry, otočený o 90 stupňů
es: Si está marcado, se agregará un patrón de segunda línea, girado 90 grados.
pt: Se marcado, um padrão de 2ª linha, girado em 90 graus, será adicionado
ru: Если отмечено, будет добавлен образец второй линии, повернутый на 90 градусов.
tr: Eğer işaretlenirse 90 derece döndürülmüş 2. çizgi düzeni eklenecektir

# CbEngravingTopDown.Text
source: Top down
cs: Vzhůru nohama
es: De arriba hacia abajo
pt: Careca
ru: Сверху вниз
tr: Yukarıdan aşağıya

# CbEngravingTopDown.ToolTip
source: If checked an angle=0 it starts on the upper left edge. Otherwise it starts on the lower left edge.
cs: Pokud je zaškrtnuto úhel=0, začíná na levém horním okraji. Jinak začíná na levém dolním okraji.
es: Si marca un ángulo = 0, comienza en el borde superior izquierdo. De lo contrario, comienza en el borde inferior izquierdo.
pt: Se marcado um ângulo = 0, ele começa na borda superior esquerda. Caso contrário, começa na borda inferior esquerda.
ru: Если отмечен угол = 0, он начинается с верхнего левого края. В противном случае он начинается с нижнего левого края.
tr: Eğer açı=0 olarak işaretlenirse sol üst kenardan başlar. Aksi takdirde sol alt kenardan başlar.

# RbEngravingPattern.Text
source: Pattern
cs: Vzor
es: Patrón
pt: Padrão
ru: Шаблон
tr: Model

# RbEngravingLine.Text
source: Line by line
cs: Řádek po řádku
es: Linea por linea
pt: Linha por linha
ru: Построчно
tr: Satır satır

# label21.Text
source: Angle
cs: Úhel
de_de: Abwählen von Farben
es: Ángulo
ja: 不要な場合は色を選択解除します
pt: Ângulo
ru: Угол
tr: Açı

# tabPage2.Text
source: Line tracing
cs: Trasování čar
es: Seguimiento de líneas
pt: Rastreamento de linha
ru: Трассировка линий
tr: Hat izleme

# tabPage3.Text
source: Vectorization
cs: Vektorizovat
de_de: Farbersetzung
es: vectorizar
ja: 色置換
pt: Vetorizar
ru: Векторизовать
tr: vektörleştir

# RbGrayscalePattern.Text
source: Line tracing
ar: نمط
cs: Trasování čar
es: Seguimiento de líneas
it: Modello
pl: Wzór
pt: Rastreamento de linha
ru: Трассировка линий
tr: Hat izleme
zh_cn: 图案

# GbColorReplacingMode.Text
source: Color replacing mode
cs: Režim výměny barev

# RbPixelArtShape.Text
source: Draw a shape
cs: Nakreslete tvar

# label32.Text
source: Gap between dots / shapes
cs: Mezera mezi tečkami / tvary

# BtnPixelArtCalcSize.Text
source: Calculate width and height
cs: Vypočítejte šířku a výšku

# label31.Text
source: Dot tool diameter / shape width
cs: Průměr / šířka tvaru bodového nástroje

# label30.Text
source: Shown color order = tool change order in G-Code
cs: Zobrazené pořadí barev = pořadí výměny nástroje v G-kódu

# label29.Text
source: Dots / shapes per pixel
cs: Body / tvary na pixel

# RbPixelArtPbP.Text
source: Draw a dot
cs: Nakreslete tečku

# label24.Text
source: Draw pixel by pixel
cs: Kreslit pixel po pixelu

# GbColorReduction.Text
source: Color reduction
cs: Redukce barev

# GbConversionWizzard.Text
source: Conversion Wizard
cs: Průvodce převodem

# label29.ToolTip
source: Dots per pixel in X and Y direction. '2' results to 2x2 = 4 dots. '3' results to 3x3 = 9 dots.
cs: Počet bodů na pixel ve směru X a Y. „2“ znamená 2x2 = 4 tečky. „3“ znamená 3x3 = 9 bodů.

# CbSortInvert.Text
source: Invert order
cs: Invertovat pořadí

# RbSortToolsByNumber.Text
source: Sort by tool number
cs: Seřadit podle čísla nástroje

# RbSortToolsByPixel.Text
source: Sort by pixel amount
cs: Seřadit podle počtu pixelů

# CbPixelArtShapeFill.Text
source: Fill shape
cs: Vyplňte tvar

# label33.Text
source: Pen diameter
cs: Průměr pera

# RbPixelArtDrawShapeRect.Text
source: Rectangle
cs: Obdélník

# RbPixelArtDrawShapeCircle.Text
source: Circle
cs: Kruh

# GbOutputSizeSet.Text
source: Output size in units
cs: Výstupní velikost v jednotkách

# label37.Text
source: Height
cs: Výška

# label36.Text
source: Width
cs: Šířka

# label35.Text
source: G-Code
cs: G-kód

# label34.Text
source: Picture
cs: Obrázek

# GbOutputSizeShow.Text
source: Pixel Art dimension
cs: Rozměr Pixel Art

# lblInfo1.Text
source: Info
ar: معلومات
it: Informazioni
ja: 情報
pl: Informacje
tr: Bilgi

# label3.Text
source: Gamma
ar: غاما
es: Gama
ja: ガンマ
pt: Gama
ru: Гамма
tr: Gama
zh_cn: 伽玛

# rbModeDither.Text
source: Dithering
ar: التردد
es: Tramado
fr: Tramage
ja: ディザリング
ru: Смешение
tr: titreme
zh_cn: 抖动

# tabPageSetup.Text
source: Start
ar: يبدأ
es: Comenzar
it: Inizio
pt: Começar
ru: Начинать
tr: Başlangıç
zh_cn: 开始

# cBReduceColorsDithering.Text
source: Dithering
ar: التردد
ja: ディザリング
ru: Дизеринг
tr: titreme
zh_cn: 抖动

# btnInvert.Text
source: button5
it: pulsante5
