Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromImage.*.resx
Languages: ar, cs, de_de, es, fr, it, ja, pl, pt, ru, tr, zh_cn

# btnKeepSizeReso.Text
source: Keep orig. px size, calc. Resolution
ar: الحفاظ على الأصل. حجم بكسل ، احسب. القرار
cs: Ponechat orig. velikost pixelů, kalkul. Rozlišení
de_de: Orig. px Größe - Anpassung Auflös.
es: Mantener orig. tamaño px, calc. Resolución
fr: Gardez orig. taille px, calc. Résolution
it: Mantieni orig. dimensione px, cal. Risoluzione
ja: 元のままにしてください。 pxサイズ、計算。 解決
pl: Zachowaj oryginalny rozmiar px, oblicz rozdzielczość
pt: Mantenha orig. tamanho px, calc. Resolução
ru: Хранить ориг. Размер в пикс. разрешение
tr: orijini koru. piksel boyutu, hesap. Çözünürlük
zh_cn: 保持原始。 px尺寸，计算 解析度

# btnKeepSizeWidth.Text
source: Keep orig. px size, calc. Width
ar: الحفاظ على الأصل. حجم بكسل ، احسب. عرض
cs: Ponechat orig. velikost pixelů, kalkul. Šířka
de_de: Orig. px Größe - Anpassung Breite
es: Mantener orig. tamaño px, calc. Anchura
fr: Gardez orig. taille px, calc. Largeur
it: Mantieni orig. dimensione px, cal. Larghezza
ja: 元のままにしてください。 pxサイズ、計算。 幅
pl: Zachowaj oryginalny rozmiar px, oblicz szerokość
pt: Mantenha orig. tamanho px, calc. Largura
ru: Хранить ориг. Размер в пикс. ширина
tr: orijini koru. piksel boyutu, hesap. Genişlik
zh_cn: 保持原始。 px尺寸，计算 宽度

# lblSizeOrig.Text
source: Size
ar: بحجم
cs: Velikost
it: Dimensione
ja: サイズ
pl: Rozmiar
ru: Размер
tr: Boyut
zh_cn: 尺寸

# nUDResoX.ToolTip
source: Distance between lines, should match pen width
ar: يجب أن تتطابق المسافة بين السطور مع عرض القلم
cs: Vzdálenost mezi řádky by měla odpovídat šířce pera
de_de: Der Abstand zwischen den Linien sollte mit der Stiftbreite übereinstimmen
es: Distancia entre líneas, debe coincidir con el ancho de la pluma
fr: Distance entre les lignes, doit correspondre à la largeur du stylo
it: La distanza tra le righe dovrebbe corrispondere alla larghezza della penna
ja: 行間の距離、ペンの幅と一致する必要があります
pl: Odległość między liniami, powinna odpowiadać szerokości pióra
pt: Distância entre as linhas, deve corresponder à largura da caneta
ru: Расстояние между линиями должно соответствовать ширине пера
tr: Çizgiler arasındaki mesafe, kalem genişliğine uygun olmalıdır
zh_cn: 行之间的距离，应与笔的宽度相匹配

# lblSizeResult.Text
source: Size
ar: بحجم
cs: Velikost
it: Dimensione
ja: サイズ
pl: Rozmiar
ru: Размер
tr: Boyut
zh_cn: 尺寸

# label4.Text
source: Width
ar: عرض
cs: Šířka
de_de: Breite
es: Anchura
fr: Largeur
it: Larghezza
ja: 幅
pl: Szerokość
pt: Largura
ru: ширина
tr: Genişlik
zh_cn: 宽度

# label6.Text
source: Resolution X / pen width
ar: القرار X / عرض القلم
cs: Rozlišení X / šířka pera
de_de: Auflösung X / Stiftbreite
es: Resolución X / ancho de pluma
fr: Résolution X / largeur du stylo
it: Risoluzione X / larghezza penna
ja: 解像度X/ペン幅
pl: Rozdz. X / szer. pióra
pt: Resolução X / largura da caneta
ru: Разрешение X / ширина пера
tr: Çözünürlük X / kalem genişliği
zh_cn: 分辨率 X / 笔宽

# label5.Text
source: Height
ar: ارتفاع
cs: Výška
de_de: Höhe
es: la taille
fr: la taille
it: Altezza
ja: 高さ
pl: Wysokość
pt: Altura
ru: Высота
tr: Yükseklik
zh_cn: 高度

# cbLockRatio.Text
source: keep ratio
ar: إبقاء على النسبة
cs: zachovat poměr
de_de: Seitenverhältnis
es: mantener relación
fr: conserver le taux
it: mantenere il rapporto
ja: 比率を保つ
pl: utrzymaj proporcje
pt: manter relação
ru: держать соотношение
tr: oranı koru
zh_cn: 保持比率

# label18.Text
source: Line distance
ar: مسافة الخط
cs: Vzdálenost čáry
de_de: Linienabstand
es: Distancia de línea
fr: Distance de ligne
it: Distanza di linea
ja: 線間距離
pl: Odległość linii
pt: Distância da linha
ru: Расстояние линии
tr: Hat mesafesi
zh_cn: 线距

# label2.Text
source: Contrast
ar: تناقض
cs: Kontrast
de_de: Kontrast
es: Contraste
fr: Contraste
it: Contrasto
ja: コントラスト
pl: Kontrast
pt: Contraste
ru: контрастировать
tr: Zıtlık
zh_cn: 对比

# label1.Text
source: Brightness
ar: سطوع
cs: Jas
de_de: Helligkeit
es: Brillo
fr: Luminosité
it: Luminosità
ja: 輝度
pl: Jasność
pt: Brilho
ru: яркость
tr: Parlaklık
zh_cn: 亮度

# groupBox10.Text
source: Extract CMYK / RGB
ar: استخراج CMYK / RGB
cs: Extrahujte CMYK / RGB
de_de: CMYK / RGB extrahieren
es: Extraer CMYK / RGB
fr: Extraire CMJN / RVB
it: Estrai CMYK / RGB
ja: CMYK / RGBを抽出します
pl: Wyodrębnij CMYK / RGB
pt: Extrair CMYK / RGB
ru: Извлечь CMYK / RGB
tr: CMYK / RGB'yi çıkarın
zh_cn: 提取 CMYK/RGB

# cbGrayscaleChannel.Text
source: Single color channel
ar: قناة لون واحد
cs: Jednobarevný kanál
de_de: Einfarbiger Kanal
es: Canal de un solo color
fr: Canal de couleur unique
it: Canale singolo colore
ja: 単色チャンネル
pl: Kanał jednokolorowy
pt: Canal de cor única
ru: Одноцветный канал
tr: Tek renkli kanal
zh_cn: 单色通道

# cbGrayscale.Text
source: Grayscale
ar: الرمادي
cs: Stupně šedi
de_de: In Graustufen umwandeln
es: Escala de grises
fr: Niveaux de gris
it: Scala di grigi
ja: グレースケール
pl: Odcienie szarości
pt: Escala de cinza
ru: Оттенки серого
tr: gri tonlama
zh_cn: 灰阶

# rbModeGray.Text
source: Grayscale
ar: الرمادي
cs: Stupně šedi
de_de: Graustufen
es: Escala de grises
fr: Niveaux de gris
it: Scala di grigi
ja: グレースケール
pl: Odcienie szarości
pt: Escala de cinza
ru: Оттенки серого
tr: gri tonlama
zh_cn: 灰阶

# groupBox1.Text
source: Grayscale / black and white conversion
ar: التحويل إلى تدرج الرمادي / الأبيض والأسود
cs: Převod stupňů šedi / černobílé
de_de: Graustufen-/Schwarzweiß-Konvertierung
es: Conversión escala de grises/blanco y negro
fr: Conversion niveaux de gris / noir et blanc
it: Conversione in scala di grigi/bianco e nero
ja: グレースケール/白黒変換
pl: Konwersja do odcieni szarości / czerni-bieli
pt: Conversão de tons de cinza/preto e branco
ru: Оттенки серого / черно-белое преобразование
tr: Gri tonlama / siyah beyaz dönüştürme
zh_cn: 灰度/黑白转换

# btnInvert.ToolTip
source: Invert colors
ar: عكس الألوان
cs: Invertovat barvy
de_de: Bild invertieren
es: Colores invertidos
fr: Inverser les couleurs
it: Inverti i colori
ja: 色を反転
pl: Odwróć kolory
pt: Cores invertidas
ru: Инвертировать цвета
tr: Renkleri ters çevir
zh_cn: 反转颜色

# btnHorizMirror.ToolTip
source: Horizontal flip
ar: الوجه الأفقي
cs: Horizontální překlopení
de_de: Bild auf der Y-Achse spiegeln
es: Imagen especular en el eje Y
fr: Image miroir sur l'axe des ordonnées
it: Capovolgimento orizzontale
ja: 水平反転
pl: Odwrócenie poziome
pt: Aleta horizontal
ru: Зеркальное изображение по оси Y
tr: yatay çevirme
zh_cn: 在Y轴上镜像

# btnVertMirror.ToolTip
source: Vertical flip
ar: الوجه العمودي
cs: Vertikální překlopení
de_de: Bild auf der X-Achse spiegeln
es: Imagen espejo en el eje X
fr: Image miroir sur l'axe X
it: Capovolgimento verticale
ja: 垂直反転
pl: Odwrócenie pionowe
pt: Aleta vertical
ru: Зеркальное изображение по оси X
tr: Dikey çevirme
zh_cn: 在X轴上镜像

# btnRotateRight.ToolTip
source: Rotate picture 90° cw
ar: تدوير الصورة 90 درجة مئوية
cs: Otočit obrázek o 90° cw
de_de: Bild um 90° im Uhrzeigersinn drehen
es: Gire la imagen 90 ° en sentido horario
fr: Faire pivoter l'image de 90 ° dans le sens des aiguilles d'une montre
it: Ruota l'immagine di 90° in senso orario
ja: 画像を90°回転させる
pl: Obróć obraz 90° w prawo
pt: Rodar imagem 90 ° cw
ru: Повернуть изображение на 90 ° по часовой стрелке
tr: Resmi 90° sağa döndür
zh_cn: Повернуть изображение на 90 ° по часовой стрелке

# btnRotateLeft.ToolTip
source: Rotate picture 90° ccw
ar: تدوير الصورة 90 ° ccw
cs: Otočit obrázek o 90° ccw
de_de: Bild um 90° gegen den Uhrzeigersinn drehen
es: Gire la imagen 90 ° en sentido antihorario
fr: Tourner l'image de 90 ° dans le sens antihoraire
it: Ruota l'immagine di 90° in senso antiorario
ja: 画像を90°回転させる
pl: Obróć obraz 90° w lewo
pt: Rodar imagem 90 ° ccw
ru: Поверните изображение на 90 ° против часовой стрелки
tr: Resmi 90° ccw döndür
zh_cn: 将图像逆时针旋转90°

# BtnReloadPattern.Text
source: Reload pattern
ar: إعادة تحميل النمط
cs: Znovu načíst vzor
de_de: Muster neu laden
es: Patrón de recarga
fr: Recharger le modèle
it: Ricarica il modello
ja: リロードパターン
pl: Przeładuj wzór
pt: Recarregar padrão
ru: Шаблон перезагрузки
tr: Deseni yeniden yükle
zh_cn: 重装模式

# label25.Text
source: Center-pos. of pattern
ar: مركز نقاط البيع. من النمط
cs: Střed-poz. vzoru
de_de: Mittel-Pos. des Musters
es: Posición central de patrón
fr: Centre-pos. de modèle
it: Centro-pos. di modello
ja: センター位置パターンの
pl: Centralna pozycja wzoru
pt: Pos. Central de padrão
ru: Центр-поз. образца
tr: Merkez poz. desen
zh_cn: 中心位置。图案的

# rbEngravingPattern4.Text
source: from 2D view
ar: من العرض ثنائي الأبعاد
cs: z 2D pohledu
de_de: aus 2D-Ansicht
es: desde la vista 2D
fr: à partir de la vue 2D
it: dalla vista 2D
ja: 2Dビューから
pl: z widoku 2D
pt: da vista 2D
ru: из 2D вида
tr: 2B görünümden
zh_cn: 从二维视图

# rbEngravingPattern4.ToolTip
source: Load a SVG or DXF graphic as pattern for the image.
ar: قم بتحميل رسم SVG أو DXF كنمط للصورة.
cs: Načtěte grafiku SVG nebo DXF jako vzor pro obrázek.
de_de: Lädt eine SVG- oder DXF-Grafik als Muster für das Bild.
es: Cargue un gráfico SVG o DXF como patrón para la imagen.
fr: Chargez un graphique SVG ou DXF comme motif pour l'image.
it: Carica un elemento grafico SVG o DXF come modello per l'immagine.
ja: 画像のパターンとしてSVGまたはDXFグラフィックをロードします。
pl: Wczytaj grafikę SVG lub DXF jako wzór dla obrazu.
pt: Carregue um gráfico SVG ou DXF como padrão para a imagem.
ru: Загрузите графику SVG или DXF в качестве шаблона для изображения.
tr: Görüntü için model olarak bir SVG veya DXF grafiği yükleyin.
zh_cn: 加载 SVG 或 DXF 图形作为图像的图案。

# rbEngravingPattern3.Text
source: Spiral
ar: حلزوني
cs: Spirála
es: Espiral
fr: Spirale
it: Spirale
ja: 螺旋
pl: Spirala
pt: Espiral
ru: Спираль
tr: Sarmal
zh_cn: 螺旋

# rbEngravingPattern3.ToolTip
source: Internally generated spiral pattern. 'Line distance' = increase in radius per turn.
ar: يتم إنشاء نمط حلزوني داخليًا. "مسافة الخط" = زيادة نصف القطر لكل دورة.
cs: Interně generovaný spirálový vzor. 'Vzdálenost čáry' = zvětšení poloměru na otáčku.
de_de: Intern erzeugtes Spiralmuster. 'Linienabstand' = Zunahme des Radius pro Umdrehung.
es: Patrón de espiral generado internamente. 'Distancia de línea' = aumento de radio por vuelta.
fr: Motif en spirale généré en interne. 'Line distance' = augmentation du rayon par tour.
it: Motivo a spirale generato internamente. 'Distanza della linea' = aumento del raggio per giro.
ja: 内部で生成されたスパイラルパターン。 「線距離」=回転あたりの半径の増加。
pl: Wewnętrznie generowany wzór spirali. 'Odległość linii' = wzrost promienia na obrót.
pt: Padrão de espiral gerado internamente. 'Distância da linha' = aumento do raio por volta.
ru: Внутренний спиральный узор. «Расстояние по линии» = увеличение радиуса за оборот.
tr: Dahili olarak oluşturulan sarmal model. 'Hat mesafesi' = dönüş başına yarıçap artışı.
zh_cn: 内部生成的螺旋图案。 '线距' = 每圈半径增加。

# cBOnlyLeftToRight.Text
source: Only left to right
ar: فقط من اليسار إلى اليمين
cs: Pouze zleva doprava
de_de: Nur von links nach rechts
es: Solo de izquierda a derecha
fr: Seulement de gauche à droite
it: Solo da sinistra a destra
ja: 左から右のみ
pl: Tylko od lewej do prawej
pt: Só da esquerda para a direita
ru: Только слева направо
tr: Sadece soldan sağa
zh_cn: 只能从左到右

# cBOnlyLeftToRight.ToolTip
source: Only draw from one direction to avoid offsets
ar: ارسم من اتجاه واحد فقط لتجنب الإزاحة
cs: Kreslete pouze z jednoho směru, abyste se vyhnuli posunům
de_de: Zeichnet nur aus einer Richtung, um Versätze zu vermeiden
es: Dibuje solo desde una dirección para evitar desplazamientos
fr: Ne dessinez que dans une direction pour éviter les décalages
it: Disegna solo da una direzione per evitare offset
ja: オフセットを避けるために一方向からのみ描画します
pl: Rysuj tylko z jednego kierunku, aby uniknąć przesunięć
pt: Desenhe apenas em uma direção para evitar deslocamentos
ru: Рисуйте только в одном направлении, чтобы избежать смещений
tr: Ofsetleri önlemek için yalnızca bir yönden çizin
zh_cn: 只从一个方向绘制以避免偏移

# rbEngravingPattern2.Text
source: diagonal
ar: قطري
cs: úhlopříčka
it: diagonale
ja: 対角線
pl: diagonalny
ru: диагональ
tr: diyagonal
zh_cn: 对角线

# rbEngravingPattern1.Text
source: horizontal
ar: أفقي
cs: horizontální
it: orizzontale
ja: 水平
pl: horyzontalny
ru: горизонтальный
tr: yatay
zh_cn: 水平的

# btnGenerate.Text
source: Create G-Code
ar: قم بإنشاء G-Code
cs: Vytvořte G-Code
de_de: Erzeuge G-Code
es: Crear G-Code
fr: Créer un G-Code
it: Crea codice G
ja: Gコードを作成
pl: Utwórz G-Code
pt: Criar código G
ru: Создать G-Code
tr: G Kodu Oluştur
zh_cn: 创建G代码

# copyToolStripMenuItem.Text
source: Copy
ar: نسخ
cs: kopírovat
es: Copiar
fr: Copie
it: copia
ja: コピー
pl: Kopiuj
pt: cópia de
ru: копия
tr: kopyala
zh_cn: 复制

# setAsOriginalToolStripMenuItem.Text
source: Set as original
ar: تعيين الأصلي
cs: Nastavit jako originál
es: Establecer como original
fr: Définir comme original
it: Imposta come originale
ja: オリジナルとして設定
pl: Ustaw jako oryginał
pt: Definir como original
ru: Установить как оригинал
tr: Orijinal olarak ayarla
zh_cn: 设为原始

# lblImageSource.Text
source: original
ar: أصلي
cs: originál
it: originale
ja: 元の
pl: oryginał
tr: orijinal
zh_cn: 原来的

# label12.Text
source: Hue shift
ar: هوى التحول
cs: Posun odstínu
de_de: Farbwinkel
es: Cambio de tono
fr: Changement de teinte
it: Cambio di tonalità
ja: 色相シフト
pl: Odcień
pt: Mudança de matiz
ru: Сдвиг оттенка
tr: ton kayması
zh_cn: 色相偏移

# tBarHueShift.ToolTip
source: In HSV color range, add value to HUE
ar: في نطاق ألوان HSV ، أضف قيمة إلى HUE
cs: V rozsahu barev HSV přidejte hodnotu k HUE
de_de: Im HSV Farbraum wird der Farbwinkel verschoben
es: En la gama de colores HSV, agregue valor a HUE
fr: Dans la gamme de couleurs HSV, ajoutez de la valeur à HUE
it: Nella gamma di colori HSV, aggiungi valore a HUE
ja: HSVカラー範囲で、HUEに値を追加します
pl: W zakresie kolorów HSV, dodaj wartość do HUE
pt: Na faixa de cores HSV, agregue valor ao HUE
ru: В цветовом диапазоне HSV добавьте значение HUE
tr: HSV renk aralığında, HUE'ye değer katın
zh_cn: 在HSV颜色范围内，为HUE添加值

# nUDMaxColors.ToolTip
source: Max. amount = max. tool table entries
ar: ماكس. المبلغ = الحد الأقصى إدخالات جدول الأداة
cs: Max. množství = max. záznamy v tabulce nástrojů
de_de: Max. Menge = max. Werkzeugtabelleneinträge
es: Max. cantidad = max. entradas de la tabla de herramientas
fr: Max. montant = max. entrées de table d'outils
it: Massimo importo = max. voci della tabella degli strumenti
ja: 最大 量=最大 ツールテーブルエントリ
pl: Maks. ilość = maks. wpisy w tabeli narzędzi
pt: Máx. quantidade = máx. entradas da tabela de ferramentas
ru: Максимум. сумма = макс. записи в таблице инструментов
tr: Maks. miktar = maks. araç tablosu girişleri
zh_cn: 最高 数量=最大 工具表条目

# lblColors.Text
source: Color count
ar: عدد الألوان
cs: Počet barev
de_de: Anzahl Farben
es: número de colores
fr: nombre de couleurs
it: Conteggio colori
ja: カラーカウント
pl: Liczba kolorów
pt: Contagem de cores
ru: количество цветов
tr: renk sayısı
zh_cn: 色数

# cbExceptColor.Text
source: Exception Color
ar: لون الاستثناء
cs: Barva výjimky
de_de: Ausnahmefarbe
es: Color de excepción
fr: Couleur d'exception
it: Colore d'eccezione
ja: 例外色
pl: Kolor wyjątku
pt: Cor da exceção
ru: Цвет исключения
tr: İstisna Renk
zh_cn: 异常颜色

# cbExceptColor.ToolTip
source: Left click inside picture to select color which will not be drawn
ar: انقر بزر الماوس الأيسر داخل الصورة لتحديد اللون الذي لن يتم رسمه
cs: Kliknutím levým tlačítkem uvnitř obrázku vyberte barvu, která nebude vykreslena
de_de: Linksklick im Bild um Farbe auszuwählen, welche nicht exportiert werden soll
es: Haga clic izquierdo en la imagen para seleccionar el color, que no debe exportarse
fr: Clic gauche dans l'image pour sélectionner la couleur à ne pas exporter
it: Fare clic con il tasto sinistro all'interno dell'immagine per selezionare il colore che non verrà disegnato
ja: 画像内を左クリックして、描画されない色を選択します
pl: Kliknij lewym przyciskiem myszy wewnątrz obrazka, aby wybrać kolor, który nie będzie rysowany
pt: Clique esquerdo na imagem para selecionar a cor que não será desenhada
ru: Щелкните левой кнопкой мыши на изображении, чтобы выбрать цвет, который не должен быть экспортирован
tr: Çizilmeyecek rengi seçmek için resmin içine sol tıklayın
zh_cn: 左键单击图像以选择颜色，该颜色不应导出

# cbSkipToolOrder.Text
source: Skip orig. tool nr. use sequential nr.
ar: تخطي الاصليه. أداة رقم. استخدام الرقم التسلسلي.
cs: Přeskočit pův. nástroj č. použijte sekvenční nr.
de_de: Fortlaufende Werkzeugnummern
es: Números continuos de herramientas
fr: Numéros d'outil continus
it: Salta orig. strumento nr. utilizzare sequenziale nr.
ja: 元をスキップします。 ツール番号 シーケンシャルnrを使用します。
pl: Pomiń pierwotny numer narzędzia, użyj kolejnego numeru
pt: Ignorar orig. ferramenta nr. use sequencial nr.
ru: Непрерывные номера инструментов
tr: orijinali atla araç numarası sıra numarası kullan
zh_cn: 连续刀具编号

# cbSkipToolOrder.ToolTip
source: Instead of using tool number from tool table (e.g. 3,7,9) tools will be counted in ascending order (1,2,3)
ar: بدلاً من استخدام رقم الأداة من جدول الأدوات (على سبيل المثال ، 3،7،9) سيتم احتساب الأدوات بترتيب تصاعدي (1،2،3)
cs: Místo použití čísla nástroje z tabulky nástrojů (např. 3,7,9) budou nástroje počítány ve vzestupném pořadí (1,2,3)
de_de: Anstatt die Stiftnummer (=Werkzeugnummer) aus der Palette zu ermitteln, werden die Stifte der Reihe nach von Null beginnend gezählt (0,1,2...)
es: En lugar de encontrar el número de bolígrafo (= número de herramienta) de la paleta, los bolígrafos se cuentan en orden desde cero (0,1,2 ...)
fr: Au lieu de trouver le numéro de plume (= numéro d’outil) dans la palette, les plumes sont comptées dans l’ordre de zéro (0,1,2 ...)
it: Invece di utilizzare il numero utensile dalla tabella utensili (es. 3,7,9) gli utensili verranno contati in ordine crescente (1,2,3)
ja: ツールテーブルのツール番号（3,7,9など）を使用する代わりに、ツールは昇順（1,2,3）でカウントされます
pl: Zamiast używać numeru narzędzia z tabeli narzędzi (np. 3,7,9) narzędzia będą liczone w kolejności rosnącej (1,2,3)
pt: Em vez de usar o número da ferramenta na tabela de ferramentas (por exemplo, 3,7,9), as ferramentas serão contadas em ordem crescente (1,2,3)
ru: Вместо того, чтобы находить номер пера (= номер инструмента) из палитры, ручки отсчитываются по порядку от нуля (0,1,2 ...)
tr: Alet tablosundaki alet numarasını (örn. 3,7,9) kullanmak yerine, aletler artan sırada (1,2,3) sayılacaktır.
zh_cn: 代替从调色板中找到笔号（=工具号），笔从零（0,1,2 ...）开始按顺序计数

# tBRMin.ToolTip
source: Red Values below this, will be set to zero
ar: القيم الحمراء أدناه ، سيتم ضبطها على الصفر
cs: Červená Hodnoty pod touto hodnotou budou nastaveny na nulu
de_de: Rotwerte unterhalb dieses Wertes werden zu Null gesetzt
es: Los valores rojos debajo de esto se establecerán en cero
fr: Les valeurs rouges en dessous de celle-ci seront mises à zéro
it: Rosso I valori al di sotto di questo verranno impostati su zero
ja: これより下の赤の値はゼロに設定されます
pl: Wartości czerwonego poniżej tej wartości są ustawiane na zero
pt: Valores vermelhos abaixo disso, serão definidos como zero
ru: Значения красного цвета ниже этого будут установлены на ноль
tr: Bunun altındaki Kırmızı Değerler, sıfır olarak ayarlanacaktır.
zh_cn: 低于此值的红色值将设置为零

# tBRMax.ToolTip
source: Red Values above this, will be set to zero
ar: سيتم تعيين القيم الحمراء فوق هذا ، إلى صفر
cs: Červená Hodnoty nad touto hodnotou budou nastaveny na nulu
de_de: Rotwerte oberhalb dieses Wertes werden zu Null gesetzt
es: Los valores rojos por encima de esto se establecerán en cero
fr: Les valeurs rouges ci-dessus, seront mises à zéro
it: Rosso I valori superiori a questo verranno impostati su zero
ja: これより上の赤い値はゼロに設定されます
pl: Wartości czerwonego powyżej tej wartości będą ustawione na zero
pt: Valores vermelhos acima disso, serão definidos como zero
ru: Красные значения выше этого будут установлены на ноль
tr: Bunun üzerindeki Kırmızı Değerler, sıfır olarak ayarlanacaktır.
zh_cn: 高于此值的红色值将设置为零

# tBGMax.ToolTip
source: Green Values above this, will be set to zero
ar: سيتم تعيين القيم الخضراء فوق هذا ، إلى صفر
cs: Zelená Hodnoty nad touto hodnotou budou nastaveny na nulu
de_de: Grünwerte oberhalb dieses Wertes werden zu Null gesetzt
es: Los valores verdes por encima de esto se establecerán en cero
fr: Les valeurs vertes au-dessus de cette valeur seront définies sur zéro
it: Verde I valori superiori a questo verranno impostati su zero
ja: これより上の緑の値はゼロに設定されます
pl: Wartości zielonego powyżej tej wartości są ustawiane na zero
pt: Valores verdes acima disso serão definidos como zero
ru: Зеленые значения выше этого будут установлены на ноль
tr: Bunun üzerindeki Yeşil Değerler, sıfır olarak ayarlanacaktır.
zh_cn: 高于此的绿色值将被设置为零

# tBGMin.ToolTip
source: Green Values below this, will be set to zero
ar: القيم الخضراء أدناه ، سيتم ضبطها على الصفر
cs: Zelená Hodnoty pod touto hodnotou budou nastaveny na nulu
de_de: Grünwerte unterhalb dieses Wertes werden zu Null gesetzt
es: Los valores verdes debajo de esto se establecerán en cero
fr: Les valeurs vertes en dessous de celle-ci seront mises à zéro
it: Verde I valori al di sotto di questo verranno impostati su zero
ja: これ以下の緑の値はゼロに設定されます
pl: Wartości zielonego poniżej tej wartości są ustawiane na zero
pt: Os valores verdes abaixo disso serão definidos como zero
ru: Зеленые значения ниже этого будут установлены на ноль
tr: Bunun altındaki Yeşil Değerler, sıfır olarak ayarlanacaktır.
zh_cn: 低于此值的绿色值将设置为零

# tBBMax.ToolTip
source: Blue Values above this, will be set to zero
ar: سيتم تعيين القيم الزرقاء فوق هذا ، إلى صفر
cs: Modrá Hodnoty nad touto hodnotou budou nastaveny na nulu
de_de: Blauwerte oberhalb dieses Wertes werden zu Null gesetzt
es: Les valeurs bleues au-dessus de cette valeur seront mises à zéro
fr: Les valeurs bleues au-dessus de cette valeur seront mises à zéro
it: I valori blu al di sopra di questo verranno impostati a zero
ja: これより上の青い値はゼロに設定されます
pl: Wartości niebieskiego powyżej tej wartości są ustawiane na zero
pt: Valores azuis acima disso, serão definidos como zero
ru: Значения синего выше этого будут установлены на ноль
tr: Mavi Bunun üzerindeki değerler, sıfır olarak ayarlanacaktır.
zh_cn: 高于此的蓝色值将设置为零

# tBBMin.ToolTip
source: Blue Values below this, will be set to zero
ar: سيتم تعيين القيم الزرقاء أدناه ، إلى صفر
cs: Modrá Hodnoty pod touto hodnotou budou nastaveny na nulu
de_de: Blauwerte unterhalb dieses Wertes werden zu Null gesetzt
es: Los valores azules debajo de esto se establecerán en cero
fr: Les valeurs bleues en dessous de celle-ci seront mises à zéro
it: Blu I valori al di sotto di questo verranno impostati a zero
ja: これより下の青の値はゼロに設定されます
pl: Wartości niebieskiego poniżej tej wartości są ustawiane na zero
pt: Os valores azuis abaixo disso serão definidos como zero
ru: Значения синего цвета ниже этого будут установлены на ноль
tr: Bunun altındaki Mavi Değerler, sıfır olarak ayarlanacaktır.
zh_cn: 低于此值的蓝色值将设置为零
