Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/GCodeCreation/CreateFromForm/GCodeFromText.*.resx
Languages: de_de, fr, it, ja, pl, pt, tr, zh_cn

# label11.Text
source: Line distance
de_de: Zeilenabstand
fr: interligne
it: Distanza di linea
ja: ライン距離
pl: Odstęp linii
pt: Distância da linha
tr: Hat mesafesi
zh_cn: 行距

# label3.Text
source: Tool:
it: Attrezzo:
ja: ツール：
pl: Narz.:
tr: Alet:
zh_cn: 工具：

# label10.Text
source: Letter distance
de_de: Zeichenabstand
fr: Distance lettre
it: Distanza lettera
ja: 文字距離
pl: Odstęp między znakami
pt: Distância da letra
tr: Harf mesafesi
zh_cn: 字母距离

# cBPauseWord.Text
source: Add Pause before word
de_de: Pause nach Wort
fr: Ajouter une pause avant mot
it: Aggiungi Pausa prima della parola
ja: 単語の前に一時停止を追加します。
pl: Dodaj pauzę przed słowem
pt: Adicionar Pausa antes da palavra
tr: Kelimeden önce Duraklat ekle
zh_cn: 在单词前添加暂停

# btnApply.Text
source: Create G-Code
de_de: Erzeuge G-Code
fr: Créer un G-Code
it: Crea codice G
ja: Gコードを作成します。
pl: Utwórz G-Code
pt: Criar código G
tr: G Kodu Oluştur
zh_cn: 创建G代码

# cBPauseLine.Text
source: Add Pause before Line
de_de: Pause nach Zeile
fr: Ajouter une pause avant la ligne
it: Aggiungi Pausa prima della riga
ja: 行の前に一時停止を追加します。
pl: Dodaj pauzę przed linią
pt: Adicionar pausa antes da linha
tr: Satırdan Önce Duraklat Ekle
zh_cn: 在行前添加暂停

# $this.Text
source: Create G-Code from Text
de_de: Erzeuge G-Code aus Text
fr: Créer un G-Code à partir d'un texte
it: Crea codice G dal testo
ja: テキストからGコードを作成
pl: Utwórz G-Code dla tekstu
pt: Criar código G a partir do texto
tr: Metinden G Kodu Oluşturun
zh_cn: 从文本创建G代码

# label2.Text
source: Other G-Code settings in Setup SVG-Import
de_de: Weitere G-Code Einstellungen in Setup SVG-Import
fr: Autres paramètres G-Code dans Setup SVG-Import
it: Altre impostazioni del codice G in Setup SVG-Import
ja: セットアップSVG-Importの他のGコード設定
pl: Inne ustawienia G-Code w ustawieniach importu SVG
pt: Outras configurações do código G em Setup SVG-Import
tr: SVG-Import Kurulumundaki diğer G Kodu ayarları
zh_cn: 设置SVG导入中的其他G代码设置

# label11.ToolTip
source: Distance between lines
de_de: Abstand zwischen Zeilen
fr: Distance entre les lignes
it: Distanza tra le righe
ja: ライン間の距離
pl: Odstęp między liniami
pt: Distância entre linhas
tr: Çizgiler arasındaki mesafe
zh_cn: 行间距离

# btnCancel.Text
source: Close
de_de: Beenden
fr: proche
it: Chiudere
ja: 閉じる
pl: Zamknij
pt: Fechar
tr: Kapalı
zh_cn: 关

# cBConnectLetter.Text
source: Connect letters (only hershey)
de_de: Verbinde Buchstaben (nur Hershey Font)
fr: Connecter des lettres (seulement pour eux)
it: Collega lettere (solo hershey)
ja: 接続文字（ハーシーのみ）
pl: Połącz litery (tylko Hershey)
pt: Conectar letras (somente dela)
tr: Harfleri birleştir (yalnızca hershey)
zh_cn: 连接字母（仅限hershey）

# cBToolTable.ToolTip
source: Within a word connect last point of letter with first point of next letter
de_de: Verbinde letzten Punkt eines Buchstabens mit ersten Punkt des nächsten Buchstabens, innerhalb eines Wortes
fr: En un mot, reliez le dernier point de la lettre au premier point de la lettre suivante
it: All'interno di una parola collega l'ultimo punto della lettera con il primo punto della lettera successiva
ja: 単語内で、文字の最後のポイントを次の文字の最初のポイントに接続します
pl: Połącz ostatni punkt litery z pierwszym punktem następnej litery w obrębie słowa
pt: Dentro de uma palavra, conecte o último ponto da letra ao primeiro ponto da próxima letra
tr: Bir kelime içinde, harfin son noktasını sonraki harfin ilk noktasıyla birleştirin
zh_cn: 在一个单词内，将字母的最后一个点与下一个字母的第一个点连接

# label1.Text
source: Letter height
de_de: Zeichenhöhe
fr: Hauteur de la lettre
it: Altezza della lettera
ja: 文字の高さ
pl: Wysokośc znaku
pt: Altura da letra
tr: Harf yüksekliği
zh_cn: 字母高度

# cBPauseChar.Text
source: Add Pause before letter
de_de: Pause nach Buchstaben
fr: Ajouter une pause avant la lettre
it: Aggiungi Pausa prima della lettera
ja: 手紙の前に一時停止を追加
pl: Dodaj pauzę przed znakiem
pt: Adicionar Pausa antes da letra
tr: Harften önce duraklama ekle
zh_cn: 在字母前添加暂停

# groupBox1.Text
source: G-Code
it: Codice G
ja: Gコード
tr: G Kodu
zh_cn: G代码

# cBConnectLetter.ToolTip
source: Within a word connect last point of letter with first point of next letter
de_de: Verbinde letzten Punkt eines Buchstabens mit ersten Punkt des nächsten Buchstabens, innerhalb eines Wortes
fr: En un mot, reliez le dernier point de la lettre au premier point de la lettre suivante
it: All'interno di una parola collega l'ultimo punto della lettera con il primo punto della lettera successiva
ja: 単語内で、文字の最後のポイントを次の文字の最初のポイントに接続します
pl: Połącz ostatni punkt litery z pierwszym punktem następnej litery w obrębie słowa
pt: Dentro de uma palavra, conecte o último ponto da letra ao primeiro ponto da próxima letra
tr: Bir kelime içinde, harfin son noktasını sonraki harfin ilk noktasıyla birleştirin
zh_cn: 在一个单词内，将字母的最后一个点与下一个字母的第一个点连接

# label1.ToolTip
source: Height of letters
de_de: Höhe der Buchstaben
fr: Hauteur des lettres
it: Altezza delle lettere
ja: 文字の高さ
pl: Wysokość znaków
pt: Altura das letras
tr: Harflerin yüksekliği
zh_cn: 字母的高度

# cBToolTable.Text
source: Get values from tool table
de_de: Übernehme Werte aus Werkzeugliste
fr: Obtenir des valeurs de la table d'outils
it: Ottieni valori dalla tabella degli strumenti
ja: ツールテーブルから値を取得する
pl: Pobierz wartości z tabeli narzędzi
pt: Obter valores da tabela de ferramentas
tr: Alet tablosundan değerleri al
zh_cn: 从工具表获取值

# label10.ToolTip
source: Additional space between letters
de_de: Zusätzlicher Abstand zwischen Buchstaben
fr: Espace supplémentaire entre les lettres
it: Spazio aggiuntivo tra le lettere
ja: 文字間の追加スペース
pl: Dodatkowy odstęp między znakami
pt: Espaço adicional entre letras
tr: Harfler arasında ek boşluk
zh_cn: 字母之间的额外空间

# tabPage1.Text
source: Text creation
de_de: Texterstellung
fr: Création de texte
it: Creazione del testo
ja: テキストの作成
pl: Tworzenie tekstu
pt: Criação de texto
tr: Metin oluşturma
zh_cn: 创建文本

# tabPage2.Text
source: Hershey Font information
de_de: Schriftinformationen
fr: Informations sur la police
it: Informazioni sui caratteri
ja: フォント情報
pl: Informacje o czcionce Hershey
pt: Informação da fonte
tr: Hersey Yazı tipi bilgisi
zh_cn: 字体信息

# cBLineBreak.Text
source: Line break after (estimated)
de_de: Zeilenumbruch nach (geschätzt)
fr: Saut de ligne après (estimé)
it: Interruzione di riga dopo (stimata)
ja: 後の改行（推定）
pl: Podział wiersza po (szac.)
pt: Quebra de linha após (estimado)
tr: Şundan sonra satır sonu (tahmini)
zh_cn: 断行后（估计）

# cBLineBreak.ToolTip
source: Estimates the word length and adds a line break after the specified length
de_de: Schätzt die Wortlänge und fügt nach der angegebenen Länge einen Zeilenumbruch hinzu
fr: Estime la longueur du mot et ajoute un saut de ligne après la longueur spécifiée
it: Stima la lunghezza della parola e aggiunge un'interruzione di riga dopo la lunghezza specificata
ja: 語長を推定し、指定された長さの後に改行を追加します
pl: Szacuje długość słowa i dodaje przerwę w wierszu po określonej długości.
pt: Estima o comprimento da palavra e adiciona uma quebra de linha após o comprimento especificado
tr: Sözcük uzunluğunu tahmin eder ve belirtilen uzunluktan sonra bir satır sonu ekler
zh_cn: 估计单词长度，并在指定长度后添加换行符

# RbAlign3.Text
source: right
de_de: rechts
fr: À droite
it: Giusto
ja: 右の方へ
pl: po prawej
pt: Para a direita
tr: Sağ
zh_cn: 靠右

# RbAlign2.Text
source: center
de_de: mitte
fr: centre
it: centro
ja: 中心
pl: na środku
pt: Centro
tr: merkez
zh_cn: 居中

# RbAlign1.Text
source: left
de_de: links
fr: La gauche
it: sinistra
ja: 左
pl: po lewej
pt: Deixou
tr: sol
zh_cn: 靠左

# CbInsertCode.Text
source: Insert text into 2D-view (at position 0;0)
de_de: Text in 2D-Ansicht einfügen (an Position 0;0)
fr: Insérer du texte dans la vue 2D (à la position 0;0)
it: Inserisci testo nella vista 2D (alla posizione 0;0)
ja: テキストを2Dビューに挿入します（位置0; 0）
pl: Wstaw tekst do widoku 2D (na pozycji 0;0)
pt: Inserir texto na visualização 2D (na posição 0;0)
tr: Metni 2B görünüme ekleyin (0;0 konumunda)
zh_cn: 将文本插入 2D 视图（在位置 0;0）

# CbOutline.Text
source: Outline
de_de: Umriss
fr: Contour
ja: 概要
pl: Obrys
pt: Contorno
tr: Anahat
zh_cn: 轮廓

# CbOutline.ToolTip
source: Fill letters with hatch fill pattern, defined in [Setup - Graphics import - Path import - Path modifications]
de_de: Buchstaben mit Schraffurfüllmuster füllen, definiert in [Setup - Grafikimport - Pfadimport - Pfadänderungen]
fr: Remplir les lettres avec un motif de remplissage hachuré, défini dans [Configuration - Importation de graphiques - Importation de chemin - Modifications de chemin]
ja: [設定 - グラフィックのインポート - パスのインポート - パスの変更] で定義されたハッチ塗りつぶしパターンで文字を塗りつぶします。
pl: Wypełnij litery wzorem wypełnienia kreskowania, zdefiniowanym w [Ustawienia - Import grafiki - Import ścieżek - Modyfikacje ścieżek].
pt: Letras de preenchimento com padrão de preenchimento de hachura, definido em [Configuração - Importação de gráficos - Importação de caminho - Modificações de caminho]
tr: Harfleri, [Kurulum - Grafikleri içe aktarma - Yolu içe aktarma - Yol değişiklikleri] bölümünde tanımlanan tarama dolgu deseniyle doldurun
zh_cn: 用影线填充图案填充字母，在[设置-图形导入-路径导入-路径修改]中定义

# CbHatchFill.Text
source: Hatch fill
de_de: Schraffur
fr: Remplissage hachuré
ja: ハッチ塗りつぶし
pl: Kreskowanie
pt: Preenchimento de hachura
tr: ambar dolgusu
zh_cn: 影线填充

# CbHatchFill.ToolTip
source: Fill letters with hatch fill pattern, defined in [Setup - Graphics import - Path import - Path modifications]
de_de: Buchstaben mit Schraffurfüllmuster füllen, definiert in [Setup - Grafikimport - Pfadimport - Pfadänderungen]
fr: Remplir les lettres avec un motif de remplissage hachuré, défini dans [Configuration - Importation de graphiques - Importation de chemin - Modifications de chemin]
ja: [設定 - グラフィックのインポート - パスのインポート - パスの変更] で定義されたハッチ塗りつぶしパターンで文字を塗りつぶします。
pl: Wypełnij litery wzorem wypełnienia kreskowania, zdefiniowanym w [Ustawienia - Import grafiki - Import ścieżek - Modyfikacje ścieżek].
pt: Letras de preenchimento com padrão de preenchimento de hachura, definido em [Configuração - Importação de gráficos - Importação de caminho - Modificações de caminho]
tr: Harfleri, [Kurulum - Grafikleri içe aktarma - Yolu içe aktarma - Yol değişiklikleri] bölümünde tanımlanan tarama dolgu deseniyle doldurun
zh_cn: 用影线填充图案填充字母，在[设置-图形导入-路径导入-路径修改]中定义

# CbWordWrap.Text
source: Word wrap
de_de: Zeilenumbruch
fr: Retour à la ligne
ja: ワードラップ
pl: Zawijanie wyrazów
pt: Quebra de linha
tr: kelime sarma
zh_cn: 自动换行

# RbFont2.Text
source: System font
de_de: Systemschrift
fr: Police système
ja: システムフォント
pl: Czcionka systemowa
pt: Fonte do sistema
tr: Sistem yazı tipi
zh_cn: 系统字体

# RbFont1.Text
source: Single-line font (Hershey)
de_de: Einzeilige Schriftart (Hershey)
fr: Police à une seule ligne (Hershey)
ja: 単線フォント (ハーシー)
pl: Czcionka jednoliniowa (Hershey)
pt: Fonte de linha única (Hershey)
tr: Tek satırlık yazı tipi (Hershey)
zh_cn: 单行字体 (Hershey)

# groupBox2.Text
source: Text alignment
de_de: Textausrichtung
fr: Alignement du texte
ja: テキストの配置
pl: Wyrównanie tekstu
pt: Alinhamento de texto
tr: Metin hizalama
zh_cn: 文本对齐

# BtnSelectFont.Text
source: Select font
de_de: Schriftart auswählen
fr: Sélectionnez la police
ja: フォントを選択
pl: Wybierz czcionkę
pt: Selecione a fonte
tr: yazı tipi seç
zh_cn: 选择字体

# LblFont.Text
source: Font:
de_de: Schriftart:
fr: Police de caractère:
ja: フォント：
pl: Czcionka:
pt: Fonte:
tr: Yazı tipi:
zh_cn: 字体：

# LblInfoFont.Text
source: Font
de_de: Schriftart
fr: Police de caractère
ja: フォント
pl: Czcionka
pt: Fonte
tr: Yazı tipi
zh_cn: 字体

# LblInfoSize.Text
source: Size
de_de: Größe
fr: Taille
ja: サイズ
pl: Rozmiar
pt: Tamanho
tr: Boyut
zh_cn: 尺寸

# LblSize.Text
source: Size:
de_de: Größe:
fr: Taille:
ja: サイズ：
pl: Rozmiar:
pt: Tamanho:
tr: Boyut:
zh_cn: 尺寸：

# LblWidth.Text
source: Width:
de_de: Breite:
fr: Largeur:
ja: 幅：
pl: Szerokość:
pt: Largura:
tr: Genişlik:
zh_cn: 宽度：

# LblHeight.Text
source: Height:
de_de: Höhe:
fr: Hauteur:
ja: 身長：
pl: Wysokość
pt: Altura:
tr: Yükseklik:
zh_cn: 高度：

# LblInfoWidth.ToolTip
source: Text width of created G-Code with current font-size and word wrap setting
de_de: Textbreite des erstellten G-Codes mit aktueller Schriftgröße und Zeilenumbrucheinstellung
fr: Largeur du texte du G-Code créé avec la taille de police actuelle et le réglage de retour à la ligne
ja: 現在のフォントサイズとワードラップ設定で作成された G コードのテキスト幅
pl: Szerokość tekstu tworzonego G-Code z aktualnym rozmiarem czcionki i ustawieniem zawijania wyrazów
pt: Largura do texto do G-Code criado com tamanho de fonte atual e configuração de quebra de linha
tr: Geçerli yazı tipi boyutu ve kelime kaydırma ayarı ile oluşturulan G Kodunun metin genişliği
zh_cn: 使用当前字体大小和自动换行设置创建的 G 代码的文本宽度

# LblInfoHeight.ToolTip
source: Text height of created G-Code with current font-size and word wrap setting
de_de: Texthöhe des erstellten G-Codes mit aktueller Schriftgröße und Zeilenumbrucheinstellung
fr: Hauteur du texte du G-Code créé avec la taille de police actuelle et le réglage de retour à la ligne
ja: 現在のフォントサイズとワードラップ設定で作成された G コードのテキストの高さ
pl: Wysokość tekstu tworzonego G-Code z aktualnym rozmiarem czcionki i ustawieniem zawijania wyrazów
pt: Altura do texto do G-Code criado com tamanho de fonte atual e configuração de quebra de linha
tr: Geçerli yazı tipi boyutu ve kelime kaydırma ayarıyla oluşturulan G Kodunun metin yüksekliği
zh_cn: 使用当前字体大小和自动换行设置创建的G代码的文本高度

# linkLabel1.Text
source: Free fonts
de_de: Kostenlose Schriftarten
fr: Polices gratuites
ja: フリーフォント
pl: Bezpłatne czcionki
pt: Fontes gratuitas
tr: ücretsiz yazı tipleri
zh_cn: 免费字体

# linkLabel1.ToolTip
source: Link to 'www.dafont.com' - usage is on your own risk.
de_de: Link zu 'www.dafont.com' - die Nutzung erfolgt auf eigene Gefahr.
fr: Lien vers 'www.dafont.com' - l'utilisation est à vos risques et périls.
ja: 「www.dafont.com」へのリンク - 使用は自己責任で行ってください。
pl: Link do 'www.dafont.com' - wykorzystanie na własną odpowiedzialność.
pt: Link para 'www.dafont.com' - o uso é por sua conta e risco.
tr: 'www.dafont.com' bağlantısı - kullanım riski size aittir.
zh_cn: 链接到“www.dafont.com” - 使用风险由您自行承担。

# NUDWidth.ToolTip
source: Set desired text width and adapt font-size to reach it.
de_de: Stellen Sie die gewünschte Textbreite ein und passen Sie die Schriftgröße an, um sie zu erreichen.
fr: Définissez la largeur de texte souhaitée et adaptez la taille de la police pour l'atteindre.
ja: 目的のテキスト幅を設定し、それに達するように font-size を調整します。
pl: Ustaw żądaną szerokość tekstu i dostosuj rozmiar czcionki, aby ją osiągnąć.
pt: Defina a largura do texto desejada e adapte o tamanho da fonte para alcançá-la.
tr: İstenen metin genişliğini ayarlayın ve buna ulaşmak için yazı tipi boyutunu ayarlayın.
zh_cn: 设置所需的文本宽度并调整字体大小以达到它。

# NUDHeight.ToolTip
source: Set desired text height and adapt font-size to reach it.
de_de: Stellen Sie die gewünschte Texthöhe ein und passen Sie die Schriftgröße an, um sie zu erreichen.
fr: Définissez la hauteur de texte souhaitée et adaptez la taille de la police pour l'atteindre.
ja: 目的のテキストの高さを設定し、それに達するように font-size を調整します。
pl: Ustaw żądaną wysokość tekstu i dostosuj rozmiar czcionki, aby ją osiągnąć.
pt: Defina a altura do texto desejada e adapte o tamanho da fonte para alcançá-la.
tr: İstenen metin yüksekliğini ayarlayın ve buna ulaşmak için yazı tipi boyutunu ayarlayın.
zh_cn: 设置所需的文本高度并调整字体大小以达到该高度。

# BtnSetWidth.Text
source: set
de_de: einstellen
fr: Positionner
ja: セットする
pl: Ust.
pt: definir
tr: ayarlamak
zh_cn: 设置

# BtnSetWidth.ToolTip
source: Calculate and set font-size to reach given text width
de_de: Berechnen und setzen Sie die Schriftgröße, um die angegebene Textbreite zu erreichen
fr: Calculer et définir la taille de la police pour atteindre la largeur de texte donnée
ja: 指定されたテキスト幅に達するように font-size を計算して設定します
pl: Oblicz i ustaw rozmiar czcionki, aby osiągnąć daną szerokość tekstu.
pt: Calcule e defina o tamanho da fonte para atingir a largura do texto
tr: Verilen metin genişliğine ulaşmak için yazı tipi boyutunu hesaplayın ve ayarlayın
zh_cn: 计算并设置字体大小以达到给定的文本宽度

# BtnSetHeight.Text
source: set
de_de: einstellen
fr: Positionner
ja: セットする
pl: Ust.
pt: definir
tr: ayarlamak
zh_cn: 设置

# BtnSetHeight.ToolTip
source: Calculate and set font-size to reach given text height
de_de: Berechnen und setzen Sie die Schriftgröße, um die angegebene Texthöhe zu erreichen
fr: Calculer et définir la taille de la police pour atteindre la hauteur de texte donnée
ja: 指定されたテキストの高さに達するように font-size を計算して設定します
pl: Oblicz i ustaw rozmiar czcionki, aby osiągnąć daną wysokość tekstu.
pt: Calcule e defina o tamanho da fonte para atingir a altura do texto
tr: Verilen metin yüksekliğine ulaşmak için yazı tipi boyutunu hesaplayın ve ayarlayın
zh_cn: 计算并设置字体大小以达到给定的文本高度
