Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: de_de, es, fr, ja, pl, ru

# importMessageSVGMetaDataOk
source: SVG Metadata processed
de_de: SVG-Metadaten verarbeitet
es: Metadatos SVG procesados
fr: Métadonnées SVG traitées
ja: SVGメタデータが処理されました
pl: Przetworzono metadane SVG
ru: Метаданные SVG обработаны

# importMessageSVGMetaDataNok1
source: SVG Metadata available, but not enabled!
de_de: SVG-Metadaten verfügbar, aber nicht aktiviert!
es: ¡Metadatos SVG disponibles pero no habilitados!
fr: Métadonnées SVG disponibles mais non activées !
ja: SVG メタデータは利用可能ですが、アクティブ化されていません。
pl: Metadane SVG są dostępne, ale nie włączone!
ru: Метаданные SVG доступны, но не включены!

# importMessageRelMovement
source: Relative movements are enabled
de_de: Relativbewegungen aktiviert (kann zu Problemen führen)
es: Movimientos relativos activados (puede dar problemas)
fr: Mouvements relatifs activés (peuvent entraîner des problèmes)
ja: 相対的な動きがアクティブになる (問題が発生する可能性があります)
pl: Aktywowane ruchy względne (mogą prowadzić do problemów)
ru: Активированы относительные движения (могут привести к проблемам)

# importMessageAddGraphic
source: Add imported graphic
de_de: Importierte Grafik hinzufügen
es: Añadir gráfico importado
fr: Ajouter un graphique importé
ja: インポートしたグラフィックを追加する
pl: Dodaj zaimportowaną grafikę
ru: Добавить импортированную графику

# importMessageToolTableNeeded
source: Tool table needed, last loaded:
de_de: Werkzeugtabelle wird benötigt, zuletzt geladen:
es: Requerir tabla de herramientas, cargada por última vez:
fr: Nécessite une table d'outils, chargée en dernier :
ja: ツール テーブルが必要です。最後にロードされました:
pl: Wymagaj tabeli narzędzi, ostatnio załadowana:
ru: Требовать таблицу инструментов, последняя загруженная:

# importMessageGeneralSettings
source: General settings:
de_de: Allgemeine Einstellungen:
es: Configuración general:
fr: Réglages généraux:
ja: 一般設定：
pl: Ustawienia główne:
ru: Общие настройки:

# importMessageXYFeed
source: XY Feed
de_de: XY-Vorschub
es: alimentación XY
fr: Alimentation XY
ja: XY送り
pl: Posuw XY
ru: подача XY

# importMessageMaxXYFeed
source: grbl X/Y Max. rate:
de_de: grbl X/Y max. Vorschub:
es: grbl X/Y avance máximo:
fr: grbl Avance max X/Y :
ja: grbl X/Y 最大送り:
pl: grbl X/Y maks. posuw:
ru: grbl X/Y максимальная подача:

# importMessageGcodeHeader
source: GCode Header
de_de: GCode-Kopfzeile
es: Encabezado de código G
fr: En-tête GCode
ja: GCodeヘッダー
pl: Nagłówek GCode
ru: Заголовок GCode

# importMessageGcodeFooter
source: GCode Footer
de_de: GCode-Fußzeile
es: Pie de página de código G
fr: Pied de page GCode
ja: Gコードフッター
pl: Stopka GCode
ru: Нижний колонтитул GCode

# importMessageLaserMode
source: Lasermode: use M3S0 instead of M5 to switch off laser (or spindle)
de_de: Lasermode: Verwendet M3S0 anstelle von M5, um den Laser (oder die Spindel) auszuschalten.
es: Modo láser: use M3S0 en lugar de M5 para apagar el láser (o el eje)
fr: Mode laser : utilisez M3S0 au lieu de M5 pour éteindre le laser (ou la broche)
ja: レーザー モード: M5 の代わりに M3S0 を使用してレーザー (またはスピンドル) をオフにします。
pl: Tryb lasera: użyj M3S0 zamiast M5, aby wyłączyć laser (lub wrzeciono)
ru: Режим лазера: используйте M3S0 вместо M5, чтобы выключить лазер (или шпиндель)

# importMessageLaserModeNok
source: grbl Laser mode $32 is not enabled
de_de: grbl Lasermodus $32 ist nicht aktiviert
es: modo láser grbl $32 no está activado
fr: le mode laser grbl $32 n'est pas activé
ja: grbl レーザー モード $32 がアクティブ化されていません
pl: tryb laserowy grbl 32 USD nie jest aktywowany
ru: grbl лазерный режим $32 не активирован

# importMessageLaserPower
source: Laser power
de_de: Laserleistung
es: potencia láser
fr: puissance laser
ja: レーザー出力
pl: moc lasera
ru: мощность лазера

# importMessageSpindleSpeed
source: Spindle Speed
de_de: Spindeldrehzahl
es: eje de velocidad
fr: vitesse de broche
ja: 主軸速度
pl: Prędkość wrzeciona
ru: скорость вращения шпинделя

# importMessageSpindleSpeedMax
source: grbl Spindle speed Max.
de_de: grbl Spindeldrehzahl max.
es: grbl velocidad del husillo máx.
fr: grbl vitesse de broche max.
ja: GRBL スピンドル最大速度
pl: prędkość obrotowa wrzeciona grbl max.
ru: grbl скорость шпинделя макс.

# importMessagePUD
source: Pen up/down translation:
de_de: Stift-Up/Down-Übersetzung:
es: Traducción de pluma arriba/abajo:
fr: Traduction du stylet haut/bas :
ja: ペンの上下の変換:
pl: Tłumaczenie w górę/w dół pióra:
ru: Перевод пера вверх/вниз:

# importMessagePUDZ
source: Z axis enabled
de_de: Z-Achse aktiviert
es: Eje Z activado
fr: Axe Z activé
ja: Z軸有効化
pl: Oś Z włączona
ru: Ось Z активирована

# importMessagePUDZNoSpindle
source: Spindle will not be switched on
de_de: Spindel wird nicht eingeschaltet
es: El husillo no está encendido
fr: La broche n'est pas allumée
ja: スピンドルのスイッチが入っていない
pl: Wrzeciono nie jest włączone
ru: Шпиндель не включен

# importMessagePUDZFeed
source: Z Feed
de_de: Z-Vorschub
es: Alimentación Z
fr: Avance Z
ja: Z送り
pl: kanał Z
ru: Z-подача

# importMessagePUDZUp
source: Z Up (save)
de_de: Z oben (sichere Höhe)
es: Z Up (altura segura)
fr: Z vers le haut (hauteur de sécurité)
ja: Zアップ（安全な高さ）
pl: Z Up (bezpieczna wysokość)
ru: Z вверх (безопасная высота)

# importMessagePUDZDown
source: Z Down (engrave)
de_de: Z unten (Gravur)
es: Z Abajo (grabado)
fr: Z vers le bas (gravure)
ja: Zダウン（刻印）
pl: Z W dół (grawerowanie)
ru: Z Вниз (гравюра)

# importMessagePUDZDepthPass
source: Depth per pass
de_de: Tiefe pro Durchgang
es: profundidad por pasada
fr: profondeur par passe
ja: パスごとの深さ
pl: głębokość na przejście
ru: глубина за проход

# importMessagePUDZDepthPassNoZUp
source: No Z up between passes
de_de: Kein Z Up zwischen den Durchgängen
es: Sin Z Up entre pases
fr: Pas de Z Up entre les passes
ja: パス間の Z アップなし
pl: Brak Z Up między przejściami
ru: Нет Z Up между проходами

# importMessagePUDZFeedMax
source: grbl Z Max. Feed rate:
de_de: grbl Z max. Vorschub:
es: grbl Z avance máx.:
fr: grbl Z avance max.:
ja: grbl Z 最大送り:
pl: grbl Z maks. posuw:
ru: grbl Z максимальная подача:

# importMessagePUDPWM
source: PWM enabled (Servo control)
de_de: PWM aktiviert (Servosteuerung)
es: PWM habilitado (servocontrol)
fr: PWM activé (asservissement)
ja: PWM有効（サーボ制御）
pl: PWM włączone (sterowanie serwomechanizmem)
ru: ШИМ включен (сервоуправление)

# importMessagePUDPWMUp
source: PWM Up
de_de: PWM oben
es: PWM alto
fr: PWM élevé
ja: PWM高
pl: PWM wysoki
ru: ШИМ высокий

# importMessagePUDPWMZero
source: PWM Zero
de_de: PWM Null
es: PWM cero
fr: PWM zéro
ja: PWMゼロ
ru: ноль ШИМ

# importMessagePUDPWMDown
source: PWM Down
de_de: PWM unten
es: PWM abajo
fr: PWM ci-dessous
ja: 以下のPWM
pl: PWM poniżej
ru: ШИМ ниже

# importMessagePUDSpindle
source: Spindle on/off with Pen down/up
de_de: Spindel ein-/ausschalten mit Stift nach unten/oben
es: Encender/apagar el eje con el lápiz hacia abajo/arriba
fr: Allumer/éteindre la broche avec le stylet bas/haut
ja: ペンのダウン/アップでスピンドルのオン/オフを切り替えます
pl: Włączanie/wyłączanie wrzeciona za pomocą pióra w dół/w górę
ru: Включение/выключение шпинделя ручкой вниз/вверх

# importMessagePUDIndividual
source: Individual commands
de_de: Individuelle Befehle
es: Comandos individuales
fr: Commandes individuelles
ja: 個別のコマンド
pl: Indywidualne polecenia
ru: Отдельные команды

# importMessagePUDPenUp
source: Pen Up
de_de: Stift hoch
es: encerrar
fr: stylo vers le haut
ja: ペンアップ
pl: pióro
ru: ручка вверх

# importMessagePUDPenDown
source: Pen Down
de_de: Stift runter
es: pluma abajo
fr: stylo vers le bas
ja: ペンダウン
pl: ołówek w dół
ru: ручка вниз

# importMessageOption1
source: Path interpretation:
de_de: Pfadinterpretation:
es: Interpretación de la ruta:
fr: Interprétation du chemin :
ja: パスの解釈:
pl: Interpretacja ścieżki:
ru: Интерпретация пути:

# importMessageOptionNodesOnly
source: Nodes only - make dots at given coordinates
de_de: Nur Knoten – Punkte an bestimmten Koordinaten erstellen
es: Solo nodos: cree puntos en coordenadas específicas
fr: Nœuds uniquement - créer des points à des coordonnées spécifiques
ja: ノードのみ - 特定の座標にポイントを作成します
pl: Tylko węzły — twórz punkty o określonych współrzędnych
ru: Только узлы - создание точек с определенными координатами

# importMessageOptionZFromWidth
source: Get Z value from line width (depth)
de_de: Ermittelt den Z-Wert aus der Linienbreite (Tiefe).
es: Encuentra el valor Z del ancho de línea (profundidad).
fr: Trouve la valeur Z à partir de la largeur de ligne (profondeur).
ja: 線幅（深さ）からZ値を求めます。
pl: Znajduje wartość Z na podstawie szerokości (głębokości) linii.
ru: Находит значение Z по ширине (глубине) линии.

# importMessageOptionSFromWidth
source: Get S value from line width (laser power / spindle speed)
de_de: Ermittelt den S-Wert aus der Linienbreite (Laserleistung / Spindelgeschwindigkeit).
es: Determina el valor S a partir del ancho de línea (potencia del láser/velocidad del husillo).
fr: Détermine la valeur S à partir de la largeur de ligne (puissance laser / vitesse de broche).
ja: 線幅（レーザーパワー/スピンドル速度）からS値を決定します。
pl: Określa wartość S na podstawie szerokości linii (moc lasera / prędkość wrzeciona).
ru: Определяет значение S по ширине линии (мощность лазера/скорость шпинделя).

# importMessageOptionCircleToDot
source: Convert circle to point
de_de: Kreis in Punkt umwandeln
es: Convertir círculo en punto
fr: Convertir cercle en point
ja: 円を点に変換
pl: Zamień okrąg na punkt
ru: Преобразовать круг в точку

# importMessageOptionCircleRadiusToZ
source: Convert circle-radius to Z value
de_de: Konvertiert den Kreisradius in den Z-Wert
es: Convierte el radio del círculo a valor z
fr: Convertit le rayon du cercle en valeur z
ja: 円の半径を Z 値に変換します
pl: Konwertuje promień okręgu na wartość z
ru: Преобразует радиус окружности в z-значение

# importMessageOption2
source: Path modification:
de_de: Pfadänderung:
es: cambio de ruta:
fr: changement de chemin :
ja: パス変更:
pl: zmiana ścieżki:
ru: изменение пути:

# importMessageOptionFilter
source: Filter graphic elements (remove objects)
de_de: Grafische Elemente filtern (Objekte entfernen)
es: Filtrar elementos gráficos (eliminar objetos)
fr: Filtrer les éléments graphiques (supprimer des objets)
ja: グラフィック要素のフィルタリング (オブジェクトの削除)
pl: Filtruj elementy graficzne (usuwaj obiekty)
ru: Фильтровать графические элементы (удалять объекты)

# importMessageOptionHatchFill
source: Add Hatch fill
de_de: Schraffurfüllung hinzufügen
es: Agregar relleno de sombreado
fr: Ajouter un remplissage hachuré
ja: ハッチングの塗りつぶしを追加する
pl: Dodaj wypełnienie kreskowania
ru: Добавить заливку штриховки

# importMessageOptionClip
source: Crop or tile graphic
de_de: Grafik zuschneiden oder kacheln
es: Gráfico de cultivo o mosaico
fr: Graphique de recadrage ou de mosaïque
ja: グラフィックのトリミングまたはタイル化
pl: Przytnij lub ułóż grafikę
ru: Обрезать или мозаичное изображение

# importMessageOptionTangential
source: Tangential axis
de_de: Tangentialachse
es: eje tangencial
fr: axe tangentiel
ja: 接線軸
pl: oś styczna
ru: тангенциальная ось

# importMessageOptionDragTool
source: Adapt path for Drag tool
de_de: Pfad für Drag-Tool anpassen
es: Personalizar la ruta para la herramienta de arrastre
fr: Personnaliser le chemin pour l'outil de glissement
ja: ドラッグツールのパスをカスタマイズする
pl: Dostosuj ścieżkę dla narzędzia przeciągania
ru: Настроить путь для инструмента перетаскивания

# importMessageOptionExtend
source: Extend path (e.g. for laser cutting)
de_de: Weg verlängern (z. B. für Laserschneiden)
es: Extender ruta (por ejemplo, para corte por láser)
fr: Prolonger le chemin (par exemple pour la découpe au laser)
ja: パスの延長 (例: レーザー切断用)
pl: Wydłuż ścieżkę (np. do cięcia laserowego)
ru: Расширение пути (например, для лазерной резки)

# importMessageOptionOutlineDevelop
source: Outline development
de_de: Abwicklung
es: terminación
fr: achèvement
ja: 完了
pl: ukończenie
ru: завершение

# importMessageOptionWireBender
source: Wire bender
de_de: Drahtbieger
es: dobladora de alambre
fr: cintreuse de fil
ja: ワイヤーベンダー
pl: giętarka do drutu
ru: сгибатель проволоки

# importMessageOption1Link
source: Possible path interpretations
de_de: Mögliche Pfadinterpretationen
es: Posibles interpretaciones de rutas
fr: Interprétations de chemin possibles
ja: 考えられるパスの解釈
pl: Możliwe interpretacje ścieżki
ru: Возможные интерпретации пути

# importMessageOption2Link
source: Possible path modifications
de_de: Mögliche Pfadänderungen
es: Posibles modificaciones de ruta
fr: Modifications de chemin possibles
ja: 可能なパス変更
pl: Możliwe modyfikacje ścieżki
ru: Возможные модификации пути

# importMessageSourceMetadata
source: From Metadata
de_de: Aus Metadaten
es: De metadatos
fr: À partir des métadonnées
ja: メタデータから
pl: Z metadanych
ru: Из метаданных

# importMessageSourceTooltable
source: From tool table
de_de: Aus der Werkzeugtabelle
es: De la tabla de herramientas
fr: De la table d'outils
ja: ツールテーブルから
pl: Z tabeli narzędzi
ru: Из таблицы инструментов

# importMessageSpindleDirection
source: Laser mode / Spindle direction
de_de: Lasermodus / Spindelrichtung
es: Modo láser / Dirección del husillo
fr: Mode laser / sens de broche
ja: レーザーモード / スピンドル方向
pl: Tryb lasera / Kierunek wrzeciona
ru: Режим лазера/направление шпинделя

# importMessageSpindleDirectionM3
source: M3 (CW-clockwise) Constant Laser Power Mode
de_de: M3 (im Uhrzeigersinn) Modus mit konstanter Laserleistung
es: M3 (CW en el sentido de las agujas del reloj) Modo de potencia láser constante
fr: M3 (CW dans le sens des aiguilles d'une montre) Mode de puissance laser constante
ja: M3 (時計回り) 一定レーザー出力モード
pl: M3 (CW-zgodnie z ruchem wskazówek zegara) Tryb stałej mocy lasera
ru: M3 (по часовой стрелке) Режим постоянной мощности лазера

# importMessageSpindleDirectionM4
source: M4 (CCW-counterclockwise) Dynamic Laser Power Mode
de_de: M4 (CCW-gegen den Uhrzeigersinn) Dynamischer Laserleistungsmodus
es: M4 (CCW-sentido antihorario) Modo de potencia de láser dinámico
fr: Mode d'alimentation laser dynamique M4 (CCW-sens antihoraire)
ja: M4 (CCW-反時計回り) ダイナミックレーザーパワーモード
pl: M4 (CCW-przeciwnie do ruchu wskazówek zegara) Tryb dynamicznej mocy lasera
ru: M4 (против часовой стрелки) Режим динамической мощности лазера

# loadMessageContinue
source: Continue last job?
de_de: Letzten Auftrag fortsetzen?
es: ¿Continuar con el último trabajo?
fr: Continuer le dernier travail ?
ja: 前回の仕事を続けますか?
pl: Kontynuować ostatnią pracę?
ru: Продолжить последнюю работу?

# loadMessageLastProcessed
source: Loading the last processed G-Code
de_de: Laden des zuletzt verarbeiteten G-Codes
es: Cargando el último código G procesado
fr: Chargement du dernier G-Code traité
ja: 最後に処理された G コードをロードしています
pl: Ładowanie ostatnio przetworzonego kodu G
ru: Загрузка последнего обработанного G-кода

# loadMessageLoad1
source: Loading G-Code
de_de: G-Code wird geladen
es: Cargando código G
fr: Chargement du code G
ja: Gコードをロード中
pl: Ładowanie kodu G
ru: Загрузка G-кода

# loadMessageNoImport
source: No import options applied!
de_de: Keine Importoptionen angewendet!
es: ¡No se aplicaron opciones de importación!
fr: Aucune option d'importation appliquée !
ja: インポート オプションが適用されていません。
pl: Nie zastosowano żadnych opcji importu!
ru: Параметры импорта не применяются!

# loadMessageReplaceM34
source: Load G-Code option: Replaces laser mode command M3 by M4
de_de: Option „G-Code laden“: Ersetzt den Lasermodusbefehl M3 durch M4
es: Opción Cargar código G: Reemplaza el comando de modo láser M3 por M4
fr: Option Load G-Code : Remplace la commande de mode laser M3 par M4
ja: G コードの読み込みオプション: レーザー モード コマンド M3 を M4 に置き換えます。
pl: Opcja Load G-Code: Zastępuje polecenie trybu lasera M3 przez M4
ru: Опция «Загрузить G-код»: заменяет команду режима лазера M3 на M4.

# loadMessageReplaceM43
source: Load G-Code option: Replaces laser mode command M4 by M3
de_de: Option „G-Code laden“: Ersetzt den Lasermodusbefehl M4 durch M3
es: Opción Cargar código G: Reemplaza el comando de modo láser M4 por M3
fr: Option Load G-Code : Remplace la commande de mode laser M4 par M3
ja: G コードの読み込みオプション: レーザー モード コマンド M4 を M3 に置き換えます。
pl: Opcja Load G-Code: Zastępuje polecenie trybu lasera M4 przez M3
ru: Опция «Загрузить G-код»: заменяет команду режима лазера M4 на M3.

# loadMessageStreaming
source: Streaming is active, can't load new file.
de_de: Streaming ist aktiv, neue Datei kann nicht geladen werden.
es: La transmisión está activa, no se puede cargar un archivo nuevo.
fr: Le streaming est actif, impossible de charger un nouveau fichier.
ja: ストリーミングがアクティブなので、新しいファイルをロードできません。
pl: Przesyłanie strumieniowe jest aktywne, nie można załadować nowego pliku.
ru: Потоковая передача активна, не удается загрузить новый файл.

# loadMessageToolChange
source: Automatic tool change is enabled
de_de: Der automatische Werkzeugwechsel ist aktiviert
es: El cambio automático de herramienta está habilitado
fr: Le changement d'outil automatique est activé
ja: 自動工具交換が有効になっています
pl: Automatyczna zmiana narzędzia jest włączona
ru: Автоматическая смена инструмента включена

# mainStartMissingFiles
source: Missing program files,<br>please check the GRBL-Plotter installation
de_de: Fehlende Programmdateien.<br>Bitte überprüfen Sie die GRBL-Plotter-Installation
es: Faltan archivos de programa,<br>verifique la instalación de GRBL-Plotter
fr: Fichiers de programme manquants,<br>veuillez vérifier l'installation de GRBL-Plotter
ja: プログラム ファイルが見つかりません。<br>GRBL-Plotter のインストールを確認してください。
pl: Brakujące pliki programu,<br>sprawdź instalację GRBL-Plotter
ru: Отсутствуют программные файлы,<br>пожалуйста, проверьте установку GRBL-Plotter

# statusStripeSelectionMoveShift
source: press 'Shift' to snap on grid
de_de: Drücke die Umschalttaste, um das Raster einzurasten
es: Presione Shift para ajustar la cuadrícula
fr: Appuyez sur Shift pour accrocher la grille
ja: Shift キーを押してグリッドをスナップします
pl: Naciśnij Shift, aby przyciągnąć siatkę
ru: Нажмите Shift, чтобы привязать сетку

# statusStripeSelectionResize
source: Resized by
de_de: Größe geändert um
es: Redimensionado por
fr: Redimensionné par
ja: サイズ変更
pl: Rozmiar zmieniony przez
ru: Размер изменен на

# statusStripeSelectionResizeCtrl
source: press 'Ctrl' to keep ratio
de_de: Drücke die Strg-Taste, um das Verhältnis beizubehalten
es: Presione Ctrl para mantener la proporción.
fr: Appuyez sur Ctrl pour maintenir le rapport
ja: Ctrl キーを押して比率を維持します
pl: Naciśnij klawisz Ctrl, aby zachować proporcje
ru: Нажмите Ctrl, чтобы сохранить соотношение

# statusStripeSelectionRotate
source: Rotated by
de_de: Umgedreht
es: Volteado
fr: Retourné
ja: 振り返った
pl: Obrócił się
ru: Развернулся

# statusStripeSelectionRotateShift
source: press 'Shift' to snap on full degrees
de_de: Drücke die Umschalttaste, um volle Grad anzuzeigen
es: Presione Shift para mostrar grados completos
fr: Appuyez sur Shift pour afficher les degrés complets
ja: Shift キーを押すと完全な度が表示されます
pl: Naciśnij Shift, aby wyświetlić pełne stopnie
ru: Нажмите Shift, чтобы отобразить полные градусы.

# textNewFontException
source: If you tried to select a font that was installed while GRBL-Plotter was running, please restart GRBL-Plotter and try again!
de_de: Wenn Sie versucht haben, eine Schriftart auszuwählen, die während der Ausführung von GRBL-Plotter installiert wurde, starten Sie bitte GRBL-Plotter neu und versuchen Sie es erneut!
es: Si intentó seleccionar una fuente que se instaló mientras se ejecutaba GRBL-Plotter, reinicie GRBL-Plotter e inténtelo nuevamente.
fr: Si vous avez essayé de sélectionner une police installée pendant l'exécution de GRBL-Plotter, veuillez redémarrer GRBL-Plotter et réessayer !
ja: GRBL-Plotter の実行中にインストールされたフォントを選択しようとした場合は、GRBL-Plotter を再起動してもう一度お試しください。
pl: Jeśli próbowałeś wybrać czcionkę zainstalowaną podczas działania GRBL-Plottera, uruchom ponownie GRBL-Plotter i spróbuj ponownie!
ru: Если вы попытались выбрать шрифт, который был установлен во время работы GRBL-Plotter, перезапустите GRBL-Plotter и повторите попытку!

source: probing
pl: sondowanie

source: scan
pl: skanowanie

source: height scan
pl: skanowanie wys.
