Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: de_de, es, fr, ja, pl, ru

# mainAttention
source: Attention
de_de: Achtung
es: Atención
ja: 注意
pl: Uwaga
ru: Внимание

# mainHelpLanguage
source: Feel free to improove translation
es: Siéntase libre de mejorar la traducción
fr: N'hésitez pas à améliorer la traduction
ja: 翻訳をお気軽に
pl: Zapraszam do poprawy tłumaczenia
ru: Не стесняйтесь улучшать перевод

# mainHotkeyError
source: File 'hotkeys.xml' not found, no hotkeys set!
de_de: Datei 'hotkeys.xml' nicht gefunden, keine Hotkeys gesetzt!
es: Archivo 'hotkeys.xml' no encontrado, no hay teclas de acceso rápido configuradas!
fr: Fichier 'hotkeys.xml' non trouvé, aucun raccourci clavier défini!
ja: ファイル 'hotkeys.xml'が見つかりません、ホットキーが設定されていません！
pl: Nie znaleziono pliku 'hotkeys.xml', nie ustawiono klawiszy skrótu!
ru: Файл 'hotkeys.xml' не найден, горячие клавиши не установлены!

# mainHotkeyError1
source: Unknown action:
de_de: Unbekannte Aktion:
es: Acción desconocida:
fr: Action inconnue:
ja: 不明なアクション：
pl: Nieznana akcja:
ru: Неизвестное действие:

# mainHotkeyError2
source: Error with Hotkey.xml
de_de: Fehler mit Hotkey.xml
es: Error con Hotkey.xml
fr: Erreur avec Hotkey.xml
ja: Hotkey.xmlのエラー
pl: Błąd hotkeys.xml
ru: Ошибка с Hotkey.xml

# mainInfoCheckCode
source: Check G-Code
de_de: Überprüfe G-Code
es: Verifique el código G
fr: Vérifier le code G
ja: Gコードを確認
pl: Sprawdź G-Code
ru: Проверьте G-код

# mainInfoErrorLine
source: Error before line
de_de: Fehler vor Zeile
es: Error antes de la línea
fr: Erreur avant la ligne
ja: 行の前のエラー
pl: Błąd przed linią
ru: Ошибка перед строкой

# mainInfoFinishCheck
source: Finish checking G-Code
de_de: Check G-Code beendet
es: Termine de verificar el código G
fr: Terminer la vérification du code G
ja: Gコードのチェックを終了
pl: Zakończ sprawdzanie G-Code
ru: Завершить проверку G-кода

# mainInfoFinishSend
source: Finish sending G-Code
de_de: Senden G-Code beendet
es: Terminer l'envoi du code G
fr: Terminer l'envoi du code G
ja: Gコードの送信を完了
pl: Zakończ przesyłanie G-Code
ru: Завершить отправку G-кода

# mainInfoKill
source: Press 'Kill Alarm' to proceed ('$X')
es: Presione 'Kill Alarm' para continuar
fr: Appuyez sur 'Kill Alarm' pour continuer
ja: 「殺すアラーム」を押して続行します
pl: Wciśnij "Kill Alarm", aby kontynuować ("$X")
ru: Нажмите «Kill Alarm», чтобы продолжить

# mainInfoLaserModeOff
source: Laser Mode not active $32=0
es: Modo láser no activo $32 = 0
fr: Mode laser non actif $32 = 0
ja: レーザーモードがアクティブではない$ 32 = 0
pl: Tryb lasera nieaktywny $32=0
ru: Лазерный режим не активен $32 = 0

# mainInfoLaserModeOn
source: Laser Mode active $32=1
es: Modo láser activo $32 = 1
fr: Mode laser actif $32 = 1
ja: レーザーモードがアクティブ$ 32 = 1
pl: Tryb lasera aktywny $32=1
ru: Лазерный режим активен $32 = 1

# mainInfoPause
source: Pause streaming - press play (
es: Pausar transmisión - presione play (
fr: Pause streaming - appuyez sur play (
ja: ストリーミングの一時停止-プレスプレイ（
pl: Wstrzymaj przesyłąnie - naciśnij przycisk odtwarzania (
ru: Пауза потоковой передачи - нажмите кнопку воспроизведения (

# mainInfoProbing
source: Probing
es: Sondeo
fr: Sondage
ja: プロービング
pl: Sondowanie
ru: прощупывание

# mainInfoResume
source: Press 'Resume' to proceed
es: Presione 'Reanudar' para continuar
fr: Appuyez sur 'Reprendre' pour continuer
ja: [再開]を押して続行します
pl: Naciśnij "Wznów", aby kontynuować
ru: Нажмите «Продолжить», чтобы продолжить

# mainInfoSendCode
source: Send G-Code
de_de: Sende G-Code
es: Enviar código G
fr: Envoyer le code G
ja: Gコードを送信
pl: Wyśli G-Code
ru: Отправить G-код

# mainInfoStopStream
source: STOP streaming (
es: DETENER la transmisión (
fr: ARRÊTER le streaming (
ja: ストリーミングを停止（
ru: Остановить потоковую передачу (

# mainInfoStopStream2
source: STOP streaming ( Line
es: DETENER la transmisión (línea
fr: ARRÊTER le streaming (Line
ja: ストリーミングを停止（ライン
pl: STOP streaming ( Linia
ru: STOP потоковое (Линия

# mainInfoToolChange
source: Tool change...
de_de: Werkzeug wechseln...
es: Cambio de herramienta...
fr: Changement d'outil ...
ja: ツールの変更...
pl: Zmiana narzędzia...
ru: Смена инструмента ...

# mainInfoUndo
source: Undo last action
de_de: Letzte Aktion rückgängig machen
es: Deshacer la última acción
fr: Annuler la dernière action
ja: 最後のアクションを元に戻す
pl: Cofnij ostatnią akcję
ru: Отменить последнее действие

# mainInfoWaitIdle
source: Wait for IDLE, then pause (
es: Espere IDLE, luego pause (
fr: Attendez IDLE, puis faites une pause (
ja: IDLEを待ってから、一時停止（
pl: Poczekaj na IDLE, a następnie wstrzymaj (
ru: Жди бездействия, потом пауза (

# mainLimits1
source: Next move will exceed machine limits!\r
de_de: Die nächste Bewegung wird die Maschinengrenzen überschreiten! \r
es: ¡El próximo movimiento excederá los límites de la máquina!\r
fr: Le prochain mouvement dépassera les limites de la machine!\r
ja: 次の動きはマシンの制限を超えます！\ r
pl: Następny ruch przekroczy limity urządzenia!\r
ru: Следующий ход превысит пределы машины!\r

# mainLimits2
source: \r\n Press 'Ok' to move anyway
de_de: \r\n Drücke 'Ok', um trotzdem zu fahren
es: \r\n Presione 'Ok' para moverse de todos modos
fr: \r\n Appuyez sur 'Ok' pour continuer quand même
ja: \ r \ n [OK]を押して移動します
pl: \r\n Naciśnij przycisk "Ok", aby kontynuować ruch.
ru: \r\n Нажмите «ОК», чтобы все равно двигаться

# mainLimits3
source: Graphics dimension exceeds machine dimension!\r\nTransformation is recommended to avoid damaging the machine!
de_de: Grafikgröße überschreitet Maschinengröße! \r\nTransformation wird empfohlen, um eine Beschädigung der Maschine zu vermeiden!
es: ¡La dimensión de gráficos excede la dimensión de la máquina! \r\n ¡Se recomienda la transformación para evitar dañar la máquina!
fr: La dimension graphique dépasse la dimension de la machine! \r\nLa transformation est recommandée pour éviter d’endommager la machine!
ja: グラフィックスの寸法が機械の寸法を超えています！\ r \ n機械の損傷を防ぐために、変形をお勧めします！
pl: Wymiar grafiki przekracza wymiar urządzenia!\r\nTransformacja jest zalecana, aby uniknąć uszkodzenia urządzenia!
ru: Размерность графики превышает размеры машины! \r\n Преобразование рекомендуется во избежание повреждения машины!

# mainLoadError
source: Streaming must be stopped before loading new file
de_de: Das Streaming muss vor dem Laden einer neuen Datei gestoppt werden
es: La transmisión debe detenerse antes de cargar un nuevo archivo
fr: Le streaming doit être arrêté avant de charger le nouveau fichier
ja: 新しいファイルを読み込む前にストリーミングを停止する必要があります
pl: Przesyłanie strumieniowe musi zostać zatrzymane przed załadowaniem nowego pliku
ru: Перед загрузкой нового файла потоковая передача должна быть остановлена

# mainLoadError1
source: File not found: '
de_de: Datei nicht gefunden: '
es: Archivo no encontrado: '
fr: Fichier non trouvé: '
ja: ファイルが見つかりません： '
pl: Nie znaleziono pliku: '
ru: Файл не найден: '

# mainLoadError2
source: URL extension is not 'svg' or 'dxf'\r\nTry SVG import anyway, but without setting 'Recent File' list.
de_de: Die URL-Erweiterung lautet nicht "svg" oder "dxf". \r\nVersuche trotzdem den SVG-Import, ohne jedoch die Liste "Zuletzt verwendete Dateien" zu aktualisieren.
es: La extensión de URL no es 'svg' o 'dxf' \r\n Intente importar SVG de todos modos, pero sin configurar la lista 'Archivo reciente'.
fr: L’extension d’URL n’est pas 'svg' ou 'dxf' \r\nEssayez quand même d’importer du SVG, mais sans définir la liste 'Fichier récent'.
ja: URL拡張子が「svg」または「dxf」ではありません\ r \ nSVGインポートを試してください。ただし、「最近使用したファイル」リストは設定しません。
pl: Rozszerzeniem adresu URL nie jest 'svg' lub 'dxf'\r\nSpróbuj mimo to zaimportować SVG, ale bez ustawiania listy 'Ostatnie pliki'.
ru: Расширение URL не равно 'svg' или 'dxf' \r\n. Попробуйте импортировать SVG, но без настройки списка последних файлов.

# mainLoadError3
source: File extension not supported '
de_de: Dateierweiterung nicht unterstützt '
es: Extensión de archivo no compatible '
fr: Extension de fichier non prise en charge "
ja: サポートされていないファイル拡張子 '
pl: Rozszerzenie pliku nie jest obsługiwane '
ru: Расширение файла не поддерживается

# mainParseError
source: Not a valid number
de_de: Keine gültige Zahl
es: No es un numero valido
fr: Pas un numéro valide
ja: 有効な番号ではありません
pl: Nieprawidłowy numer
ru: Неверный номер

# mainParseError1
source: Not a valid number, set line to 0
de_de: Keine gültige Zahl, Zeile auf 0 setzen
es: No es un número válido, establezca la línea en 0
fr: Numéro non valide, définissez la ligne sur 0
ja: 有効な数値ではありません。行を0に設定してください
pl: Nieprawidłowy numer, ustaw linię na 0
ru: Недопустимый номер, установите строку в 0

# mainPauseStream
source: Pause streaming - press play
de_de: Streaming unterbrochen - Play drücken
es: Pausar transmisión - presione play
fr: Pause streaming - appuyez sur play
ja: ストリーミングを一時停止-プレスプレイ
pl: Wstrzymano przesyłanie strumieniowe - naciśnij 'Rozpocznij'
ru: Пауза потоковой передачи - нажмите кнопку воспроизведения

# mainPauseStream1
source: The last job was paused at line
de_de: Der letzte Auftrag wurde angehalten in Zeile
es: El último trabajo se detuvo en la línea.
fr: Le dernier travail a été mis en pause à la ligne
ja: 最後のジョブはラインで一時停止されました
pl: Ostatnie zadanie zostało wstrzymane w wierszu
ru: Последняя работа была приостановлена в очереди

# mainPauseStream2
source: Do you want to continue the job?
de_de: Möchten Sie den Job fortsetzen?
es: ¿Quieres continuar con el trabajo?
fr: Voulez-vous continuer le travail?
ja: 仕事を続けますか?
pl: Czy chcesz kontynuować pracę?
ru: Вы хотите продолжить работу?

# mainProblem
source: Problem
es: Problema
fr: Problème
ja: 問題
ru: проблема

# mainProgress
source: Progress
de_de: Fortschritt
es: Progreso
fr: Le progrès
ja: 進捗
pl: Postęp
ru: Прогресс

# mainQuit
source: Quit GRBL-Plotter?
de_de: GRBL-Plotter beenden?
es: Salir de GRBL-Plotter?
fr: Quittez GRBL-Plotter?
ja: GRBL-Plotterを終了しますか？
pl: Wyjśc z GRBL-Plotter?
ru: Выйти из GRBL-Плоттера?

# mainStreamingActive
source: Streaming is still active - press Stop and try again
de_de: Das Streaming ist immer noch aktiv - drücke Stopp und versuche es erneut
es: La transmisión aún está activa: presione Detener e intente nuevamente
fr: Le streaming est toujours actif - appuyez sur Arrêter et réessayez.
ja: ストリーミングはまだアクティブです-停止を押して再試行してください
pl: Streaming jest nadal aktywny - naciśnij Stop i spróbuj ponownie.
ru: Потоковая передача все еще активна - нажмите Стоп и попробуйте снова

# mainToolChange
source: Tool / Pen change!
de_de: Werkzeug- / Stiftwechsel!
es: ¡Cambio de herramienta / lápiz!
fr: Changement d'outil / stylo!
ja: ツール/ペン交換！
pl: Zmiana pióra / narzędzia!
ru: Смена инструмента / ручки!

# mainToolChange1
source: Tool change needed:\r
de_de: Werkzeugwechsel erforderlich: \r
es: Cambio de herramienta necesario: \r
fr: Changement d'outil nécessaire: \r
ja: ツールの変更が必要：\ r
pl: Wymagana zmiana narzędzia:\r
ru: Требуется смена инструмента: \r

# mainToolChange2
source: \rpress start to continue.
de_de: \r Drücke Start, um fortzufahren.
es: \r presione inicio para continuar.
fr: \r appuyez sur start pour continuer.
ja: \ rpress startは続行します。
pl: \rWciśnij start, aby kontynuować
ru: \r нажмите Старт, чтобы продолжить.

# mainUnknownCode
source: Fixed some unknown G-Code:\r\n
de_de: Unbekannten G-Code auskommentiert: \r\n
es: G-Code desconocido comentado: \r\n
fr: G-Code inconnu commenté: \r\n
ja: 不明なGコードを修正しました：\ r \ n
pl: Naprawiono nieznany G-Code:\r\n
ru: Неизвестный G-Code закомментирован: \r\n

# probingCancel1
source: Probing canceled
de_de: Abtasten abgebrochen
es: Muestreo abortado
fr: Échantillonnage annulé
ja: プローブがキャンセルされました
pl: Sondowanie anulowane
ru: Выборка прервана

# probingCancel2
source: Process last command
de_de: Letzten Befehl verarbeiten
es: Procesar último comando
fr: Traiter la dernière commande
ja: 最後のコマンドを処理する
pl: Przetwarzanie ostatniego polecenia
ru: Обработать последнюю команду

# probingCenter
source: Move to center
de_de: In die Mitte fahren
es: Mover al centro
fr: Déplacer au centre
ja: 中央に移動
pl: Idź na środek
ru: Переместить в центр

# probingFail1
source: Fail: no contact
de_de: Fehler: kein Kontakt
es: Fallo: sin contacto
fr: Echec: pas de contact
ja: 不合格：連絡なし
pl: Niepowodzenie: brak kontaktu
ru: Ошибка: нет контакта

# probingFail2
source: Cancel probing
de_de: Abtasten wird abgebrochen
es: Cancelar sondeo
fr: Annuler le sondage
ja: 調査をキャンセル
pl: Anuluj sondowanie
ru: Отменить зондирование

# probingFinish
source: Finish
de_de: Fertig
es: Terminar
fr: Terminer
ja: 終わり
pl: Koniec
ru: Конец

# probingProbingOn
source: Probing on
de_de: Abtasten auf
es: Sondeo en
fr: Enquête sur
ja: 調査中
pl: Sondowanie włączone
ru: Зондирование на

# probingSetCenter
source: Set center
de_de: Setze Mitte
es: Establecer centro
fr: Définir le centre
ja: セットセンター
pl: Ustaw środek
ru: Установить центр

# probingTimeOut
source: Time out
de_de: Zeit überschritten
es: Se acabó el tiempo
fr: Temps libre
ja: タイムアウト
ru: Время вышло

# serialClose
source: Close
de_de: Schließen
es: Desconectar
fr: Proche
ja: 閉じる
pl: Zamknij
ru: Закрыть

# serialCloseError
source: Serial Connection is needed.\r\nClose main window instead
de_de: Eine serielle Verbindung ist erforderlich. \r\nSchließen Sie stattdessen das Hauptfenster
es: Se necesita conexión en serie. \r\nCierre la ventana principal
fr: Une connexion série est nécessaire. \r\nFermez la fenêtre principale à la place.
ja: シリアル接続が必要です。\ r \ n代わりにメインウィンドウを閉じます
pl: Wymagane jest połączenie szeregowe.\r\nZamiast tego zamknij okno główne
ru: Необходимо последовательное соединение. \r\nЗакройте главное окно

# serialOpen
source: Open
de_de: Öffnen
es: Conectar
fr: Ouvrir
ja: 開いた
pl: Otwórz
ru: Открыть

# mainSimuStart
source: Start path simulation
de_de: Starte Pfadsimulation
es: Iniciar simulación de ruta
fr: Lancer la simulation de trajectoire
ja: パスシミュレーションを開始
pl: Rozpocznij symulację ścieżki
ru: Начать симуляцию пути

# mainSimuStop
source: Stop simulation
es: Detener la simulación
fr: Arrêter la simulation
ja: シミュレーションを停止
pl: Zatrzymaj symulację ścieżki
ru: Остановить симуляцию

# mainSimuSpeed
source: Speed
es: Velo.
fr: La vitesse
ja: 速度
pl: Prędkość
ru: скорость

# grblAlarm
source: Alarm
es: Alarma
fr: Alarme
ja: 警報
ru: Аварийная

# grblCheck
source: Check
es: Cheque
fr: Vérifier
ja: 小切手
ru: Проверьте

# grblDoor
source: Door
es: Puerta
fr: Porte
ja: ドア
ru: Дверь

# grblHold
source: Hold
es: Sostener
fr: Tenir
ja: ホールド
ru: Держать

# grblHome
source: Home
es: Hogar
fr: Accueil
ja: ホーム
ru: Дом

# grblIdle
source: Idle
es: Ocioso
ja: アイドル状態
ru: вхолостую

# grblJog
source: Jog
es: Empujoncito
ja: ジョグ
ru: бегать трусцой

# grblProbe
source: Probe
es: Investigacion
fr: Sonde
ja: 調査
ru: зонд

# grblRun
source: Run
es: correr
fr: Courir
ja: 走る
ru: Бегать

# grblSleep
source: Sleep
es: Dormir
fr: Sommeil
ja: 睡眠
ru: Спать

# statusStripeCheckCOM
source: Check COM-window for further information
de_de: Überprüfen Sie das COM-Fenster für weitere Informationen
es: Consulte la ventana COM para obtener más información.
fr: Consultez la fenêtre COM pour plus d'informations
ja: 詳細については、COMウィンドウを確認してください
pl: Sprawdź okno COM, aby uzyskać więcej informacji
ru: Проверьте COM-окно для получения дополнительной информации

# statusStripeClickKeys
source: Alt-Click to select Figure; Control-Click to select Group; Shift-Click to select Tile;Or click on XML-Tag
de_de: Alt-Mausklick, um Figur auszuwählen; Ctrl-Mausklick, um Gruppe auszuwählen. Umschalttaste-Mausklick, um Kachel auszuwählen, oder klicken Sie auf XML-Tag
es: Alt-Click para seleccionar Figura; Control-clic para seleccionar Grupo; Shift-Click para seleccionar Tile; O haga clic en XML-Tag
fr: Alt-clic pour sélectionner Figure; Contrôle-cliquez pour sélectionner Groupe; Shift-Click pour sélectionner Tile; Ou cliquez sur XML-Tag
ja: Altキーを押しながらクリックして図を選択します。 Control-クリックしてグループを選択します。 Shiftキーを押しながらクリックしてタイルを選択するか、XMLタグをクリックします
pl: Alt-Click, aby zaznaczyć rysunek; Control-Click, aby zaznaczyć grupę; Shift-Click, aby zaznaczyć kafelek; lub kliknij na tag XML
ru: Alt-щелчок, чтобы выбрать рисунок; Щелкните, удерживая клавишу Control, чтобы выбрать группу; Щелкните мышью, удерживая клавишу Shift, чтобы выбрать плитку; или щелкните XML-тег

# statusStripeClickKeys2
source: Click: mark Figure; Control-Click: mark Group; Shift-Click: mark Tile;Alt-Click: show GCode line
de_de: Mausklick markiert die Figur; Control-Mausklick: Gruppe markieren; Umschalt-Mausklick: Kachel markieren; Alt-Klick: GCode-Zeile anzeigen
es: Haga clic en: marque la figura; Control-clic: grupo de marcas; Shift-Click: marcar Tile; Alt-Click: mostrar la línea GCode
fr: Cliquez sur: marquez la figure; Contrôle-clic: marque le groupe; Maj-clic: marque la vignette; Alt-clic: affiche la ligne GCode
ja: クリック：図をマークします。 Controlキーを押しながらクリック：グループをマークします。 Shiftキーを押しながらクリック：タイルをマーク; Altキーを押しながらクリック：Gコード行を表示
pl: Kliknięcie: zaznaczenie rysunku; Control-Click: zaznaczenie grupy; Shift-Click: zaznaczenie kafelka; Alt-Click: pokazanie linii kodu G-Code
ru: Щелкните: отметьте рисунок; Control-Click: отметить группу; Shift-Click: отметить плитку; Alt-Click: показать строку GCode

# statusStripeDownKeys
source: Control-Down to move selected Block one down; Control-Shift-Down to move to end
de_de: Strg-Ab, um den ausgewählten Block 1 nach unten zu verschieben; Strg-Umschalt-Ab, um zum Ende zu gelangen
es: Control-Abajo para mover el bloque seleccionado hacia abajo; Control-Shift-Down para moverse hasta el final
fr: Contrôle-Bas pour déplacer le bloc sélectionné d'un vers le bas; Control-Shift-Down pour aller jusqu'à la fin
ja: Ctrlキーを押しながら選択したブロックを1つ下に移動します。 Ctrl-Shift-Downで最後に移動
pl: Control-Dół, aby przesunąć wybrany blok o jeden w dół; Control-Shift-Dół, aby przesunąć do końca
ru: Control-Down для перемещения выбранного блока один вниз; Control-Shift-Down для перехода в конец

# statusStripeEditModeOn
source: Edit mode on - click into 2D view to finish
de_de: Bearbeitungsmodus ein - Klicken Sie zum Abschluss in die 2D-Ansicht
es: Modo de edición activado: haga clic en la vista 2D para finalizar
fr: Mode édition activé - cliquez dans la vue 2D pour terminer
ja: 編集モードがオン-2Dビューをクリックして終了
pl: Tryb edycji włączony - kliknij w widoku 2D, aby zakończyć
ru: Режим редактирования на - нажмите в 2D вид, чтобы закончить

# statusStripeFileLoad
source: File loading
de_de: Datei laden
es: Carga de archivos
fr: Chargement de fichiers
ja: ファイルの読み込み
pl: Ładowanie pliku
ru: Загрузка файла

# statusStripeFileNotFound
source: File not found - remove from list
de_de: Datei nicht gefunden - aus Liste entfernen
es: Archivo no encontrado - eliminar de la lista
fr: Fichier introuvable - supprimer de la liste
ja: ファイルが見つかりません-リストから削除
pl: Nie znaleziono pliku - usuń z listy
ru: Файл не найден - удалить из списка

# statusStripeGrblResetNeeded
source: Perhaps serial port is locked and a restart of GRBL-Plotter is needed
de_de: Möglicherweise ist die serielle Schnittstelle gesperrt und ein Neustart von GRBL-Plotter ist erforderlich
es: Quizás el puerto serie está bloqueado y se necesita reiniciar GRBL-Plotter
fr: Le port série est peut-être verrouillé et un redémarrage de GRBL-Plotter est nécessaire
ja: おそらくシリアルポートがロックされていて、GRBL-Plotterの再起動が必要です
pl: Być może port szeregowy jest zablokowany i konieczne jest ponowne uruchomienie GRBL-Plotter
ru: Возможно, последовательный порт заблокирован и необходим перезапуск GRBL-Plotter

# statusStripeResetNeeded
source: Probably a reset of the controller is needed
de_de: Möglicherweise ist ein Reset des Controllers erforderlich
es: Probablemente sea necesario reiniciar el controlador
fr: Une réinitialisation du contrôleur est probablement nécessaire
ja: おそらくコントローラーのリセットが必要です
pl: Prawdopodobnie potrzebny jest reset kontrolera
ru: Вероятно, необходим сброс контроллера

# statusStripeStreamingStatusSaved
source: Streaming status and G-Code are saved in '_lastProcessed.nc'. Continuation after program restart is possible.
de_de: Streaming-Status und G-Code werden in '_lastProcessed.nc' gespeichert. Fortsetzung nach Programmneustart ist möglich.
es: El estado de transmisión y el código G se guardan en '_lastProcessed.nc'. La continuación después del reinicio del programa es posible.
fr: Le statut de streaming et le G-Code sont enregistrés dans '_lastProcessed.nc'. La poursuite après le redémarrage du programme est possible.
ja: ストリーミングステータスとGコードは「_lastProcessed.nc」に保存されます。 プログラムの再起動後の継続が可能です。
pl: Status przesyłania strumieniowego i G-Code są zapisywane w pliku "_lastProcessed.nc". Kontynuacja po ponownym uruchomieniu programu jest możliwa.
ru: Статус потоковой передачи и G-код сохраняются в _lastProcessed.nc. Продолжение после перезапуска программы возможно.

# statusStripeUpKeys
source: Control-Up to move selected Block one up; Control-Shift-Up to move to top
de_de: Control-Up, um den ausgewählten Block 1 nach oben zu verschieben; Control-Shift-Up, um nach oben zu gelangen
es: Control-Up para mover el bloque seleccionado hacia arriba; Control-Shift-Up para moverse hacia arriba
fr: Contrôle vers le haut pour déplacer le bloc sélectionné vers le haut; Control-Shift-Up pour aller en haut
ja: Ctrlキーを押しながら選択したブロックを1つ上に移動します。 Control-Shift-Upでトップに移動
pl: Control-Góra, aby przesunąć wybrany blok o jeden w górę; Control-Shift-Góra, aby przesunąć na górę.
ru: Control-Up для перемещения выбранного блока один вверх; Control-Shift-Up для перемещения наверх

# statusStripeSelectionMoved
source: Selection moved by
de_de: Auswahl verschoben um
es: Selección movida por
fr: Sélection déplacée par
ja: 選択を移動しました
pl: Wybór przesunięty o
ru: Выбор перемещен

# statusStripeCheckUpdate
source: 'Check for new GRBL-Plotter release on GitHub' - can be disabled in [Setup - Program control]
de_de: 'Auf GitHub nach neuer GRBL-Plotter-Version suchen' - kann in [Setup - Programmsteuerung] deaktiviert werden.
es: 'Buscar nueva versión de GRBL-Plotter en GitHub': se puede desactivar en [Configuración - Control de programa]
fr: 'Vérifier la nouvelle version de GRBL-Plotter sur GitHub' - peut être désactivé dans [Configuration - Contrôle de programme]
ja: 「GitHubで新しいGRBL-Plotterリリースを確認する」-[設定-プログラム制御]で無効にできます
pl: "Sprawdź nowe wydanie GRBL-Plotter na GitHub" można wyłączyć w [Ustawienia-Sterowanie programem]
ru: «Проверить новую версию GRBL-Plotter на GitHub» - можно отключить в [Настройка - Управление программой]

# cameraMountFix
source: Fix mounted camera
de_de: Fix montierte Kamera
es: Arreglar la cámara montada
fr: Caméra montée fixe
ja: マウントされたカメラを修正する
pl: Kamera zamontowana na stałe
ru: Исправить установленную камеру

# cameraMountXy
source: Camera mounted on XY platform
de_de: Kamera auf XY-Plattform montiert
es: Cámara montada en plataforma XY
fr: Caméra montée sur plate-forme XY
ja: XYプラットフォームに取り付けられたカメラ
pl: Kamera zamontowana na platformie XY
ru: Камера установлена ​​на платформе XY

# cameraMountXyz
source: Camera mounted on Z axis
de_de: Kamera auf Z-Achse montiert
es: Cámara montada en el eje Z
fr: Caméra montée sur l'axe Z
ja: Z軸に取り付けられたカメラ
pl: Kamera zamontowana na osi Z
ru: Камера установлена ​​на оси Z

# cameraSetRadius
source: Set radius
de_de: Gesetzter Radius
es: Establecer radio
fr: Définir le rayon
ja: 半径を設定する
pl: Ustaw promień
ru: Установить радиус

# cameraScaling
source: scaling
de_de: Skalierung
es: Escalada
fr: Mise à l'échelle
ja: スケーリング
pl: skalowanie
ru: Масштабирование

# cameraTeachRadius
source: Teach circle radius of
de_de: Setze Kreisradius von einlernen
es: Establecer el radio del círculo de aprendizaje
fr: Définir le rayon du cercle d'apprentissage
ja: ティーチインの円半径を設定します
pl: Ustaw promień okręgu
ru: Установите радиус окружности обучения

# cameraForUpperPos
source: for upper camera position
de_de: für obere Kameraposition
es: para la posición superior de la cámara
fr: pour la position supérieure de la caméra
ja: 上部カメラ位置用
pl: dla górnej pozycji kamery
ru: для верхнего положения камеры

# cameraForLowerPos
source: for lower camera position
de_de: für untere Kameraposition
es: para la posición más baja de la cámara
fr: pour position basse de la caméra
ja: 下のカメラ位置用
pl: dla dolnej pozycji kamery
ru: для нижнего положения камеры
