Repository: svenhb/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: de_de, es, fr, ja, pl, ru

# cameraQuit
source: Press 'ESC' to quit teaching.
de_de: Drücke 'ESC', um das Teachen zu beenden.
es: Presione 'ESC' para finalizar la enseñanza.
fr: Appuyez sur 'ESC' pour terminer l'apprentissage.
ja: 「ESC」を押してティーチングを終了します。
pl: Naciśnij "ESC", aby zakończyć uczenie.
ru: Нажмите «ESC», чтобы завершить обучение.

# cameraSetMount
source: Set camera mounting to
de_de: Setzen der Kamerabefestigung
es: Configuración del soporte de la cámara
fr: Réglage du support de caméra
ja: カメラマウントの設定
pl: Ustaw mocowanie kamery na
ru: Установка крепления камеры

# cameraSetCrossHairs
source: Click to set cross hairs position
de_de: Klicke, um die Fadenkreuzposition zu setzen
es: Haga clic para establecer la posición de la cruz
fr: Cliquez pour définir la position du réticule
ja: クリックして十字線の位置を設定します
pl: Kliknij, aby ustawić celownik
ru: Щелкните, чтобы установить положение перекрестия

# cameraSetDistortion
source: Teach four edges of the distorted rectangle (ratio 4:3). Press ESC to abort.
de_de: Markiere die vier Ecken des verzerrten Rechtecks (Verhältnis 4:3). Drücke ESC, um abzubrechen.
es: Marque las cuatro esquinas del rectángulo distorsionado (proporción 4: 3). Presione ESC para cancelar.
fr: Marquez les quatre coins du rectangle déformé (rapport 4 : 3). Appuyez sur ESC pour annuler.
ja: 歪んだ長方形の四隅に印を付けます（比率4：3）。 ESCを押してキャンセルします。
pl: Ustaw cztery krawędzie zniekształconego prostokąta (proporcje 4:3). Naciśnij ESC, aby przerwać.
ru: Отметьте четыре угла искаженного прямоугольника (соотношение 4: 3). Для отмены нажмите ESC.

# cameraNoCamera
source: No camera source found. Close and open this window after connecting a camera.
de_de: Keine Kameraquelle gefunden. Schließen und öffnen Sie dieses Fenster, nachdem Sie eine Kamera angeschlossen haben.
es: No se encontró ninguna fuente de cámara. Cierre y abra esta ventana después de conectar una cámara.
fr: Aucune source de caméra trouvée. Fermez et ouvrez cette fenêtre après avoir connecté une caméra.
ja: カメラソースが見つかりません。カメラを接続した後、このウィンドウを閉じて開きます。
pl: Nie znaleziono źródła kamery. Zamknij i otwórz to okno po podłączeniu kamery.
ru: Источник камеры не найден. Закройте и откройте это окно после подключения камеры.

# cameraNextClick
source: Next click will teach scaling\r\n of camera view to
de_de: Beim nächsten Klick wird die Skalierung \r\n der Kameraansicht gesetzt
es: Con el siguiente clic, se establece la escala \ r \ n de la vista de la cámara
fr: Avec le clic suivant, la mise à l'échelle \ r \ n de la vue de la caméra est définie
ja: 次のクリックで、カメラビューのスケーリング\ r \ nが設定されます
pl: Kolejne kliknięcie spowoduje ustawienie skalowania widoku kamery do
ru: Следующим щелчком мыши устанавливается масштабирование \ r \ n обзора камеры.

# cameraDistortionMarker
source: Distortion marker
de_de: Verzerrungsmarker
es: Marcador de distorsión
fr: Marqueur de distorsion
ja: 歪みマーカー
pl: Znacznik zniekształcenia
ru: Маркер искажения

# grblNotConnected
source: grbl controller is not connected!\r\nCannot perform the desired action!
de_de: grbl-Controller ist nicht verbunden!\r\nDie gewünschte Aktion kann nicht ausgeführt werden!
es: ¡El controlador grbl no está conectado! \r\n¡No se puede realizar la acción deseada!
fr: le contrôleur grbl n'est pas connecté !\r\nImpossible d'effectuer l'action souhaitée !
ja: grblコントローラーが接続されていません！\r\n目的のアクションを実行できません！
pl: Kontroler GRBL nie jest podłączony! Nie można wykonać żądanej akcji!
ru: Контроллер grbl не подключен! \r\nНе удается выполнить желаемое действие!

# useCaseInfo
source: A use-case is a presetted setup to adjust settings for a specific machine and/or application.\r\nThe settings of a selected and applied use-case also remain after the import of the graphics.\r\nA use-case needs to be stored in \data\usecases to be accessible.\r\nAlso exported machine-settings and sub-sets of it can be used.
de_de: Ein Anwendungsfall ist ein voreingestelltes Setup, um Einstellungen für eine bestimmte Maschine und/oder Anwendung anzupassen.\r\nDie Einstellungen eines ausgewählten und angewendeten Anwendungsfalls bleiben auch nach dem Import der Grafiken erhalten.\r\nEin Anwendungsfall muss in \data\usecases gespeichert werden, um zugänglich zu sein.\r\nAuch exportierte Maschineneinstellungen und Teilmengen davon können verwendet werden.
es: Un caso de uso es una configuración preestablecida para ajustar la configuración de una máquina y/o aplicación específica.\r\nLa configuración de un caso de uso seleccionado y aplicado también permanece después de la importación de los gráficos.\r\nUn caso de uso necesita para almacenarse en \data\usecases para que sea accesible.\r\nTambién se pueden usar configuraciones de máquina exportadas y subconjuntos de la misma.
fr: Un cas d'utilisation est une configuration prédéfinie pour ajuster les paramètres d'une machine et/ou d'une application spécifique.\r\nLes paramètres d'un cas d'utilisation sélectionné et appliqué restent également après l'importation des graphiques.\r\nUn cas d'utilisation doit à stocker dans \data\usecases pour être accessible.\r\nLes paramètres de la machine exportés et leurs sous-ensembles peuvent également être utilisés.
ja: ユースケースは、特定のマシンやアプリケーションの設定を調整するための事前設定されたセットアップです。\ r \ n選択して適用したユースケースの設定は、グラフィックのインポート後も残ります。\ r \ nユースケースのニーズアクセスできるように\ data \ usecasesに保存されます。\ r \ nエクスポートされたマシン設定とそのサブセットも使用できます。
pl: Przypadek użycia to wstępnie skonfigurowana konfiguracja umożliwiająca dostosowanie ustawień dla określonej maszyny i/lub aplikacji. Ustawienia wybranego i zastosowanego przypadku użycia pozostaje również po zaimportowaniu grafiki. Przypadek użycia musi być przechowywany w folderze \data\usecases, aby był dostępny.
ru: Вариант использования — это предустановленная настройка для настройки параметров для конкретной машины и/или приложения.\r\nНастройки выбранного и примененного варианта использования также сохраняются после импорта графики.\r\nПотребности варианта использования для хранения в \data\usecases, чтобы быть доступным.\r\nТакже можно использовать экспортированные настройки машины и их подмножества.

# useCaseInfo2
source: Information
es: Información
ja: 情報
pl: Informacja
ru: Информация

# useCaseHeader1
source: Use current settings (last loaded: '{0}')
de_de: Aktuelle Einstellungen verwenden (zuletzt geladen: '{0}')
es: Usar la configuración actual (última carga: '{0}')
fr: Utiliser les paramètres actuels (dernier chargement : '{0}')
ja: 現在の設定を使用します（最終ロード： '{0}'）
pl: Użyj bieżących ustawień (ostatnio załadowane: '{0}')
ru: Использовать текущие настройки (последние загружены: '{0}')

# useCaseHeader2
source: Settings from '{0}'
de_de: Einstellungen von '{0}'
es: Configuración de '{0}'
fr: Paramètres de '{0}'
ja: '{0}'からの設定
pl: Ustawienia z '{0}'
ru: Настройки из "{0}"

# useCaseItem0
source: ### Current settings ###
de_de: ### Aktuelle Einstellungen ###
es: ### Configuraciones actuales ###
fr: ### Paramètres actuels ###
ja: ###現在の設定###
pl: ### Aktualne ustawienia ###
ru: ### Текущие настройки ###

# codeMessage_1_unknowncommand
source: Given command is unknown or not supported, start an issue on github to clarify.
de_de: Der angegebene Befehl ist unbekannt oder wird nicht unterstützt. Starten Sie ein Problem auf GitHub, um dies zu klären.
es: El comando dado es desconocido o no es compatible, inicie un problema en github para aclararlo.
fr: La commande donnée est inconnue ou non prise en charge, lancez un problème sur github pour clarifier.
ja: 与えられたコマンドが不明またはサポートされていない場合は、githubで問題を開始して明確にします。
pl: Podane polecenie jest nieznane lub nieobsługiwane, rozpocznij zgłoszenie na github, aby wyjaśnić.
ru: Данная команда неизвестна или не поддерживается, задайте вопрос на github, чтобы уточнить.

# codeMessage_2_highdataamount
source: The amount of single, selectable, figures exceeds the given maximum an would decrease the performance. \r\nAll figures are summarized to one figure.\r\nThe limit can be adjusted in\r\n[Setup - Graphics import - Path import - Grouping and tools - Conversion concerning]
de_de: Die Anzahl der einzelnen, wählbaren Ziffern übersteigt das vorgegebene Maximum und würde die Performance mindern. Alle Zahlen werden zu einer Figur zusammengefasst.\r\nDas Limit kann in\r\n[Setup - Grafikimport - Pfadimport - Gruppierung und Werkzeuge - Einschränkung betreffend] angepasst werden
es: La cantidad de cifras únicas seleccionables excede el máximo dado y disminuiría el rendimiento. Todas las cifras se resumen en una cifra.\r\nEl límite se puede ajustar en\r\n[Configuración - Importación de gráficos - Importación de ruta - Agrupación y herramientas - Concesión relativa]
fr: Le nombre de chiffres uniques sélectionnables dépasse le maximum donné et réduirait les performances. Tous les chiffres sont résumés en un seul chiffre.\r\nLa limite peut être ajustée dans\r\n[Configuration - Importation de graphiques - Importation de chemin - Regroupement et outils - Concersion concernant]
ja: 単一の選択可能な数値の量が指定された最大値を超えると、パフォーマンスが低下します。すべての図が1つの図にまとめられています。\r\n制限は\r\n[セットアップ-グラフィックのインポート-パスのインポート-グループ化とツール-懸念事項]で調整できます。
pl: Ilość pojedynczych, wybieranych figur przekracza podane maksimum i zmniejsza wydajność.\r\nWszystkie figury są łączone do jednej figury. Limit można dostosować w [Konfiguracja - Import grafiki - Import ścieżki - Grupowanie i narzędzia].
ru: Количество одиночных выбираемых фигур превышает заданный максимум, что снижает производительность. Все цифры суммируются в одну цифру.\r\nОграничение можно настроить в\r\n[Настройка - Импорт графики - Импорт пути - Группировка и инструменты - Концерн относительно]

# codeMessage_2_zdoubletang
source: The z-axis is assigned twice: as tangential axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
de_de: Die z-Achse ist doppelt belegt: als Tangentialachse UND als Pen-Up/Down-Achse. \r\nDies führt zu seltsamem und unvorhersehbarem Verhalten.
es: El eje z se asigna dos veces: como eje tangencial Y como eje Pluma arriba/abajo. \r\nEsto provocará un comportamiento extraño e impredecible.
fr: L'axe z est affecté deux fois : en tant qu'axe tangentiel ET en tant qu'axe de plume haut/bas. \r\nCela entraînera un comportement étrange et imprévisible.
ja: z軸は、接線軸とペンアップ/ダウン軸の2回割り当てられます。 \ r \ nこれにより、奇妙で予測できない動作が発生します。
pl: Oś Z jest przypisana dwukrotnie: jako oś styczna ORAZ jako oś 'Pen-Up/Down'. \r\nSpowoduje to dziwne i nieprzewidywalne zachowanie.
ru: Ось Z назначается дважды: как тангенциальная ось И как ось пера вверх/вниз. \r\nЭто приведет к странному и непредсказуемому поведению.

# codeMessage_3_spindlestaysoff
source: M3|M4 / M5 command will not be sent! -> Spindle stays off. \r\nCheck option in \r\n[Setup - Graphics import - G-Code generation - Z axis Pen up/down translation] \r\n☐ Do not switch on spindle
de_de: M3|M4 / M5 Befehl wird nicht gesendet! -> Spindel bleibt aus. \r\nÜberprüfen Sie die Option in \r\n[Setup - Grafikimport - G-Code-Generierung - Z-Achse Stift auf/ab Verschiebung] \r\n☐ Schalten Sie die Spindel nicht ein
es: ¡El comando M3|M4 / M5 no se enviará! -> El eje se queda apagado. \r\nVerifique la opción en \r\n[Configuración - Importación de gráficos - Generación de código G - Traducción arriba/abajo del lápiz del eje Z] \r\n☐ No encienda el eje
fr: La commande M3|M4 / M5 ne sera pas envoyée ! -> La broche reste éteinte. \r\nVérifiez l'option dans \r\n[Configuration - Importation de graphiques - Génération de code G - Axe Z Translation du stylet vers le haut/bas] \r\n☐ Ne pas allumer la broche
ja: M3 | M4 / M5コマンドは送信されません！ ->スピンドルはオフのままです。 \ r\nオプションをチェック\r\n[セットアップ-グラフィックスのインポート-Gコードの生成-Z軸ペンの上下移動]\r\n☐スピンドルをオンにしないでください
pl: Polecenie M3|M4/M5 nie zostanie wysłane! -> Wrzeciono pozostaje wyłączone. \r\nSprawdź opcję w \r\n[Ustawienia - Import grafiki - Generowanie G-Code - Translacja 'Pen-Up/Down' na osi Z]. \r\n☐ Nie włączaj wrzeciona
ru: Команда M3|M4 / M5 не будет отправлена! -> Шпиндель остается выключенным. \r\nПроверьте параметр в \r\n[Настройка - Импорт графики - Генерация G-кода - Перемещение пера по оси Z вверх/вниз] \r\n☐ Не включать шпиндель

# codeMessage_3_zdoubleaux
source: The z-axis is assigned twice: as auxillary axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
de_de: Die z-Achse ist doppelt belegt: als Hilfsachse UND als Pen-Up/Down-Achse. \r\nDies führt zu seltsamem und unvorhersehbarem Verhalten.
es: El eje z se asigna dos veces: como eje auxiliar Y como eje Pluma arriba/abajo. \r\nEsto provocará un comportamiento extraño e impredecible.
fr: L'axe z est affecté deux fois : comme axe auxiliaire ET comme axe de plume haut/bas. \r\nCela entraînera un comportement étrange et imprévisible.
ja: z軸は、補助軸とペンアップ/ダウン軸の2回割り当てられます。 \ r \ nこれにより、奇妙で予測できない動作が発生します。
pl: Oś Z jest przypisana dwukrotnie: jako oś pomocnicza ORAZ jako oś 'Pen-Up/Down'. \r\nSpowoduje to dziwne i nieprzewidywalne zachowanie.
ru: Ось Z назначается дважды: как вспомогательная ось И как ось пера вверх/вниз. \r\nЭто приведет к странному и непредсказуемому поведению.

# codeMessage_3_zdoubletang
source: The z-axis is assigned twice: as tangential axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
de_de: Die z-Achse ist doppelt belegt: als Tangentialachse UND als Pen-Up/Down-Achse. \r\nDies führt zu seltsamem und unvorhersehbarem Verhalten.
es: El eje z se asigna dos veces: como eje tangencial Y como eje Pluma arriba/abajo. \r\nEsto provocará un comportamiento extraño e impredecible.
fr: L'axe z est affecté deux fois : en tant qu'axe tangentiel ET en tant qu'axe de plume haut/bas. \r\nCela entraînera un comportement étrange et imprévisible.
ja: z軸は、接線軸とペンアップ/ダウン軸の2回割り当てられます。 \ r \ nこれにより、奇妙で予測できない動作が発生します。
pl: Oś Z jest przypisana dwukrotnie: jako oś styczna ORAZ jako oś 'Pen-Up/Down'. \r\nSpowoduje to dziwne i nieprzewidywalne zachowanie.
ru: Ось Z назначается дважды: как тангенциальная ось И как ось пера вверх/вниз. \r\nЭто приведет к странному и непредсказуемому поведению.

# codeMessage_attention
source: Attention
de_de: Achtung
es: Atención
ja: 注意
pl: Uwaga
ru: Внимание

# codeMessage_error
source: Error
de_de: Fehler
fr: Erreur
ja: エラー
pl: Błąd
ru: Ошибка

# codeMessage_warning
source: Warning
de_de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
pl: Ostrzeżenie
ru: Предупреждение

# codeMessage_1202_dontplot
source: Layer is not visible or printing of layer is disabled. Check: https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
de_de: Ebene ist nicht sichtbar oder Drucken ist deaktiviert. Siehe https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
es: La capa no está visible o la impresión está deshabilitada. Consulte https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
fr: Le calque n'est pas visible ou l'impression est désactivée. Vérifiez https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
ja: レイヤーが表示されていないか、印刷が無効になっています。 https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlistを確認してください
pl: Warstwa nie jest widoczna lub drukowanie warstwy jest wyłączone. Sprawdź: https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
ru: Слой не виден или печать отключена. Проверьте https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist.

# codeMessage_1302_dontplot
source: Layer, path or object is not visible because of visibility attribute.
de_de: Ebene, Pfad oder Objekt sind aufgrund des Sichtbarkeitsattributs nicht sichtbar.
es: La capa, la ruta o el objeto no son visibles debido al atributo de visibilidad.
fr: Le calque, le chemin ou l'objet n'est pas visible en raison de l'attribut de visibilité.
ja: 可視性属性のため、レイヤー、パス、またはオブジェクトは表示されません。
pl: Warstwa, ścieżka lub obiekt nie jest widoczny z powodu atrybutu widoczności.
ru: Слой, путь или объект не видны из-за атрибута видимости.

# statusStripeButtonBlocked
source: Custom button is blocked while streaming
de_de: Die benutzerdefinierte Schaltfläche ist während des Streamings blockiert
es: El botón personalizado está bloqueado durante la transmisión
fr: Le bouton personnalisé est bloqué pendant la diffusion
ja: ストリーミング中はカスタムボタンがブロックされます
pl: Włąsny przycisk jest zablokowany podczas przesyłania
ru: Пользовательская кнопка заблокирована во время потоковой передачи

# statusStripeStreamingPause
source: Streaming PAUSE
es: Pausa de transmisión
fr: PAUSE de la diffusion en continu
ja: ストリーミング一時停止
pl: PAUZA przesyłania
ru: Потоковая передача ПАУЗА

# statusStripeStreamingContinue
source: Continue streaming
de_de: Streaming fortsetzen
es: Continuar transmitiendo
fr: Continuer la diffusion
ja: ストリーミングを続ける
pl: Kontynuuj przesyłanie
ru: Продолжить трансляцию

# statusStripeStreamingCheck
source: Check G-Code on grbl controller
de_de: Überprüfung des G-Code auf dem Grbl-Controller
es: Compruebe el código G en el controlador grbl
fr: Vérifiez le code G sur le contrôleur grbl
ja: grblコントローラーのGコードを確認してください
pl: Sprawdź G-Code na kontrolerze GRBL
ru: Проверить G-код на контроллере grbl

# statusStripeStreamingStop
source: Streaming STOP at line
de_de: Streaming STOP an der Zeile
es: Streaming STOP en la línea
fr: Streaming STOP à la ligne
ja: ラインでのストリーミング停止
pl: STOP przesyłania na linii
ru: Потоковое СТОП на линии

# statusStripeStreamingStart
source: Streaming START from line
de_de: Streaming START von Zeile
es: Streaming START desde la línea
fr: Streaming START à partir de la ligne
ja: ラインからのストリーミングSTART
pl: START przesyłania od linii
ru: Потоковое СТАРТ с линии

# statusStripeStreamingFinish
source: Streaming FINISHED after
de_de: Streaming FERTIG nach
es: Transmisión FINALIZADA después de
fr: Streaming TERMINÉ après
ja: ストリーミング終了後
pl: Przesyłanie ZAKOŃCZONE po
ru: Трансляция ЗАВЕРШЕНА после

# codeMessage_1102_dontplot
source: Layer, path or object is not visible because of visibility attribute.
de_de: Ebene, Pfad oder Objekt sind aufgrund des Sichtbarkeitsattributs nicht sichtbar.
es: La capa, la ruta o el objeto no son visibles debido al atributo de visibilidad.
fr: Le calque, le chemin ou l'objet n'est pas visible en raison de l'attribut de visibilité.
ja: 可視性属性のため、レイヤー、パス、またはオブジェクトは表示されません。
pl: Warstwa, ścieżka lub obiekt nie są widoczne z powodu atrybutu widoczności.
ru: Слой, путь или объект не видны из-за атрибута видимости.

# codeMessage_1103_elementsupport
source: An unsupported SVG-XML element was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
de_de: Es wurde ein nicht unterstütztes SVG-XML-Element gefunden. Das resultierende Bild kann anders als erwartet aussehen. Mögliche Problemumgehung: Versuchen Sie, das Objekt in einen Pfad umzuwandeln.
es: Se encontró un elemento SVG-XML no admitido. La imagen resultante puede tener un aspecto diferente al esperado. Posible solución alternativa: intente convertir el objeto en ruta.
fr: Un élément SVG-XML non pris en charge a été trouvé. L'image résultante peut sembler différente de celle attendue. Solution de contournement possible : essayez de convertir l'objet en chemin.
ja: サポートされていない SVG-XML 要素が見つかりました。 結果のイメージは、予想とは異なる場合があります。 考えられる回避策: オブジェクトをパスに変換してみてください。
pl: Znaleziono nieobsługiwany element SVG-XML. Obraz wynikowy może wyglądać inaczej niż oczekiwano. Możliwe obejście: spróbuj przekonwertować obiekt na ścieżkę.
ru: Обнаружен неподдерживаемый элемент SVG-XML. Полученное изображение может выглядеть иначе, чем ожидалось. Возможный обходной путь: попробуйте преобразовать объект в путь.

# codeMessage_1104_elementuk
source: An unknown SVG-XML element was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
de_de: Ein unbekanntes SVG-XML-Element wurde gefunden. Das resultierende Bild kann anders als erwartet aussehen. Mögliche Problemumgehung: Versuchen Sie, das Objekt in einen Pfad umzuwandeln.
es: Se encontró un elemento SVG-XML desconocido. La imagen resultante puede tener un aspecto diferente al esperado. Posible solución alternativa: intente convertir el objeto en ruta.
fr: Un élément SVG-XML inconnu a été trouvé. L'image résultante peut sembler différente de celle attendue. Solution de contournement possible : essayez de convertir l'objet en chemin.
ja: 不明な SVG-XML 要素が見つかりました。 結果のイメージは、予想とは異なる場合があります。 考えられる回避策: オブジェクトをパスに変換してみてください。
pl: Znaleziono nieobsługiwany element SVG-XML. Obraz wynikowy może wyglądać inaczej niż oczekiwano. Możliwe obejście: spróbuj przekonwertować obiekt na ścieżkę.
ru: Обнаружен неизвестный элемент SVG-XML. Полученное изображение может выглядеть иначе, чем ожидалось. Возможный обходной путь: попробуйте преобразовать объект в путь.

# codeMessage_1105_textpath
source: An 'tspan' element within a 'textPath' element was found. This combination is not supported. The resulting image may look different than expected. Possible workaround: try to convert object to path.
de_de: Ein 'tspan'-Element innerhalb eines 'textPath'-Elements wurde gefunden. Diese Kombination wird nicht unterstützt. Das resultierende Bild kann anders als erwartet aussehen. Mögliche Problemumgehung: Versuchen Sie, das Objekt in einen Pfad umzuwandeln.
es: Se encontró un elemento 'tspan' dentro de un elemento 'textPath'. Esta combinación no es compatible. La imagen resultante puede tener un aspecto diferente al esperado. Posible solución alternativa: intente convertir el objeto en ruta.
fr: Un élément 'tspan' dans un élément 'textPath' a été trouvé. Cette combinaison n'est pas prise en charge. L'image résultante peut sembler différente de celle attendue. Solution de contournement possible : essayez de convertir l'objet en chemin.
ja: 「textPath」要素内に「tspan」要素が見つかりました。この組み合わせはサポートされていません。 結果のイメージは、予想とは異なる場合があります。 考えられる回避策: オブジェクトをパスに変換してみてください。
pl: Znaleziono element 'tspan' wewnątrz elementu 'textPath'. Ta kombinacja nie jest obsługiwana. Obraz wynikowy może wyglądać inaczej niż oczekiwano. Możliwe obejście: spróbuj przekonwertować obiekt na ścieżkę.
ru: Обнаружен элемент tspan в элементе textPath. Эта комбинация не поддерживается. Полученное изображение может выглядеть иначе, чем ожидалось. Возможный обходной путь: попробуйте преобразовать объект в путь.

# codeMessage_1106_attributesupport
source: An unsupported SVG-XML attribute was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
de_de: Es wurde ein nicht unterstütztes SVG-XML-Attribut gefunden. Das resultierende Bild kann anders als erwartet aussehen. Mögliche Problemumgehung: Versuchen Sie, das Objekt in einen Pfad umzuwandeln.
es: Se encontró un atributo SVG-XML no compatible. La imagen resultante puede tener un aspecto diferente al esperado. Posible solución alternativa: intente convertir el objeto en ruta.
fr: Un attribut SVG-XML non pris en charge a été trouvé. L'image résultante peut sembler différente de celle attendue. Solution de contournement possible : essayez de convertir l'objet en chemin.
ja: サポートされていない SVG-XML 属性が見つかりました。 結果のイメージは、予想とは異なる場合があります。 考えられる回避策: オブジェクトをパスに変換してみてください。
pl: Znaleziono nieobsługiwany atrybut SVG-XML. Obraz wynikowy może wyglądać inaczej niż oczekiwano. Możliwe obejście: spróbuj przekonwertować obiekt na ścieżkę.
ru: Обнаружен неподдерживаемый атрибут SVG-XML. Полученное изображение может выглядеть иначе, чем ожидалось. Возможный обходной путь: попробуйте преобразовать объект в путь.

# importMessageTitle
source: Import information
de_de: Import Informationen
es: información de importación
fr: importer des informations
ja: 輸入情報
pl: importować informacje
ru: информация об импорте

# importMessageFileName
source: File name:
de_de: Dateiname:
es: Nombre del archivo:
fr: Nom de fichier:
ja: ファイル名：
pl: Nazwa pliku:
ru: Имя файла:

# importMessageFilePath
source: File path:
de_de: Dateipfad:
es: Ruta de archivo:
fr: Chemin du fichier:
ja: ファイルパス：
pl: Ścieżka pliku:
ru: Путь к файлу:
